{"id":1018,"date":"2020-12-02T23:00:00","date_gmt":"2020-12-02T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2020\/12\/02\/1500-elo-lichess\/"},"modified":"2020-12-02T23:00:00","modified_gmt":"2020-12-02T23:00:00","slug":"1500-elo-lichess","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2020\/12\/1500-elo-lichess.html","title":{"rendered":"On Reaching 1500 Elo On Lichess.org!"},"content":{"rendered":"<p>\n  Back in May, I wrote an article on the <a href=\"\/2020\/05\/chess.html\">basics of Chess<\/a>. Today, I&#8217;m super excited to announce and celebrate the milestone of breaking into the 1500s on Lichess.org rapid (barely, but surely).\n<\/p>\n<p>\n  When I started playing chess back in late December last year, I had little idea where I stood on the chess skills ladder. I knew how the pieces moved and how a game is won, lost or drawn. I also knew castling rules and that queen is kinda important.\n<\/p>\n<p>\n  But alas, there was a lot more to this beautiful game than just knowing how each piece moved. So after losing a few games in a bar in Amsterdam, I created a Lichess.org account to practice with the computer and online strangers.\n<\/p>\n<p>\n  I quickly realized I played very bad. It came as a surprise (although in hindsight, I see why it shouldn&#8217;t have been one). To me, chess was like cycling. I learned how to play chess exactly like I learned how to ride a bike. You just learn it once (often at a young age) and that&#8217;s it, that&#8217;s all there is to it, you think.\n<\/p>\n<p>\n  But as with anything else, chess (or cycling) can be thought of as a skill that can be honed with training. What I think was happening was&#8211;I was in a competitive chess environment, playing with the bare minimum understanding of the game against people who treated it like a skill. I was losing most games I played, unsurprisingly. In fact, I had a losing streak of 41 games from January till March and also reached my lowest Elo rating of 863 in the same month.\n<\/p>\n<figure>\n  <img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/lowest-chess-rating.png\"\/><figcaption>That&#8217;s the 2-percentile among lichess.org users&#8211;a little embarrassing<\/figcaption><\/figure>\n<p>\n  Then came the pandemic and the whole world changed around us. Remote working, lockdown, stay at home etc meant there was a lot of time to invest in a new hobby. It could&#8217;ve been German language studies, or something useful, but no. My mind chose the game of chess to become obsessed with.\n<\/p>\n<p>\n  Over the course of the following months, I played hundreds of games in the evenings, watched videos on chess theory over lunch and thought about chess while in shower. Interestingly, I wasn&#8217;t alone. There&#8217;s a huge surge of people (re)discovering this game and getting into the community just like I did.\n<\/p>\n<p><script type=\"text\/javascript\" src=\"https:\/\/ssl.gstatic.com\/trends_nrtr\/2431_RC01\/embed_loader.js\"><\/script><br \/>\n<script type=\"text\/javascript\">\n    trends.embed.renderExploreWidget(\"TIMESERIES\", {\"comparisonItem\":[{\"keyword\":\"chess\",\"geo\":\"\",\"time\":\"2018-07-01 2020-12-04\"}],\"category\":0,\"property\":\"\"}, {\"exploreQuery\":\"date=2018-07-01%202020-12-04&q=chess\",\"guestPath\":\"https:\/\/trends.google.com:443\/trends\/embed\/\"});\n<\/script><\/p>\n<p>\n  Finally, like the title says, I reached 1500 today. That&#8217;s more than 600 rating points gain since March this year. I believe it is purely a function of the time I&#8217;ve put into it and nothing else. While it remains debatable whether that&#8217;s a wise thing to do, I do recommend giving chess a shot if you&#8217;ve not played it in years, especially if you&#8217;re in some kind of lockdown or prefer staying indoors and are looking for a new hobby. It is even more fun if you can compete over Elo rating with a friend!\n<\/p>\n<p>\n  If there&#8217;s any general takeaway from this whole exercise, it is that with enough practice and motivation, seemingly impossible things become possible. The world is full of arbitrary things. Chess and other such games, surely, but also many more allegedly important things like career prospects or learning a new language. Just things made by us for ourselves. So it follows that mastering German or getting the dream job could be similarly approached&#8211;immersion, finding that bit of motivation, finding people to have friendly competition with and seeing the results and improvements immediately (and some of that sweet sweet luck, of course).\n<\/p>\n<p>\n  I leave you at that until next time. Thank you for reading!\n<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/highest-rating-chess.png\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Back in May, I wrote an article on the basics of Chess. Today, I&#8217;m super excited to announce and celebrate the milestone of breaking into the 1500s on Lichess.org rapid (barely, but surely). When I started playing chess back in late December last year, I had little idea where I stood on the chess skills [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":329,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[27],"class_list":["post-1018","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-chess"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1018","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1018"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1018\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/329"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1018"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1018"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1018"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}