{"id":1034,"date":"2020-01-13T23:00:00","date_gmt":"2020-01-13T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2020\/01\/13\/2019-year-review\/"},"modified":"2020-01-13T23:00:00","modified_gmt":"2020-01-13T23:00:00","slug":"2019-year-review","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2020\/01\/2019-year-review.html","title":{"rendered":"2019 Year Review"},"content":{"rendered":"<p>\n  We entered a new year couple of weeks ago. I was a bit occupied with stuff around the new year&#8217;s time, but finally I can sit down and reflect upon how the last year went by for me. I&#8217;ll try to follow the same format as last year by writing what was good, what wasn&#8217;t, and my hopes for 2020. You can also check out <a href=\"\/2018\/12\/2018-year-review.html\">2019&#8217;s year review article<\/a>.\n<\/p>\n<h3>In short<\/h3>\n<p>\n  The start of this year was very busy given that I would be in India only for a week before <a href=\"\/2019\/01\/mumbai-to-berlin.html\">setting out for Germany<\/a>. There were a lot of feelings within me, all mixed together like the flavours in <a href=\"https:\/\/youtu.be\/_UIZ71cA1Xs?t=30\">Bhel Puri<\/a>. It wasn&#8217;t super comfortable knowing that I&#8217;m moving away from the comforts of home in a totally foreign country where I knew no one, and didn&#8217;t speak the language. Integrating in Germany was actually easier than what I had expected, and I think I was super lucky to find a good set of people around me. There was a lot of <a href=\"\/2019\/06\/berlin-flat-search-experience.html\">moving around in the city<\/a>, travelling within Europe, meeting new people and making friends, trying all sorts of food and much more.\n<\/p>\n<p>\n  2019 was a busy year, but a very positive one in that. It was the year when I could understand a bit more about the kind of person I was, and the kind of people I like having around. I am genuinely thankful to all the people who touched my life this year. Following are a few highlights from the past year and TODOs for this one.\n<\/p>\n<h3>Highlights<\/h3>\n<ul>\n<li>\n    No sick days, at work or otherwise.\n  <\/li>\n<li>\n    Lost weight and got back into good health, started doing sports again and rode bike regularly.\n  <\/li>\n<li>\n    Started learning German. Did A1, and that really changed my experience in Germany.\n  <\/li>\n<li>\n    Did well socially, made sure I have no regrets when I think back about my start in this new world.\n  <\/li>\n<li>\n    Got super comfortable with what I do professionally and got some clarity on the kind of professional expertise I&#8217;d like to develop in the long run.\n  <\/li>\n<li>\n    Played board games, card games, chess, did karaoke, went to the lakes, biked 58kms in a day, lost my flight and <a href=\"https:\/\/localhost:4000\/doodles\/arrival-berlin.html\">luggage<\/a> on the way to Berlin and many such memorable events.\n  <\/li>\n<li>\n    Travelled solo to a number of neighboring cities and countries.\n  <\/li>\n<li>\n    Realized my dream of turning a flat into <a href=\"\/2018\/02\/home.html\">my home<\/a> with a lot of interesting customizations; warm and cozy with fairy lights, a good place to work, listen to music, read etc.\n  <\/li>\n<li>\n    Became much more confident about the kind of person I am, and gained insights about how I react in certain situations, especially adverse ones.\n  <\/li>\n<li>\n    Exchanged gifts with many people&#8211;friends and strangers&#8211;throughout the year. Learned the joys of giving.\n  <\/li>\n<\/ul>\n<h3>#TODO in 2020<\/h3>\n<ul>\n<li>\n    Try and eat healthier food, cook often. Prepare lunch for office?\n  <\/li>\n<li>\n    Money management: Keep an eye on spending habits.\n  <\/li>\n<li>\n    Make faster progress with learning the German language.\n  <\/li>\n<li>\n    Read more.\n  <\/li>\n<li>\n    Lower the time spent on social media \/ reddit \/ youtube.\n  <\/li>\n<li>Talk to even more people from around the world, get better socially and be a pleasant person.<\/li>\n<li>Help, teach and mentor people. Share whatever knowledge and experience I have more actively.<\/li>\n<li>\n    Travel more than just superficially, explore by means other than air, go hiking.\n  <\/li>\n<li>\n    Get a license, go driving on the autobahn and Nurburgring. <strong>Bonus +50XP<\/strong> Drive a BMW.\n  <\/li>\n<\/ul>\n<h3>Other Random Thoughts<\/h3>\n<p>\n  Since everyone is talking about us moving into a new decade, here are a few of my thoughts and reflections. 10 years ago I was in my 10th grade, preparing for that big SSC exam every adult had scared us students about. That was the last thing we had to work hard for before we soar high in the comforts of adulthood, we were told.\n<\/p>\n<p>\n  Alas, like many things we&#8217;re told as kids, that wasn&#8217;t true. What was true, however, was that I stopped taking academics seriously from that point on. I remember learning how to &#8216;hack&#8217; into Windows registry and change random config options to impress my friends in our computers lab. The list of embarrassing stuff I did back in the day is longer than I&#8217;m willing to admit publicly.\n<\/p>\n<p>\n  Interestingly, 10 years ago at this stage I still wanted to pursue science and not computers as a career. Computers were kind of new, science was the long term interest. Fascinating how things turned out, and how they could have if I had gone along the other path. Could be an article for another day. This is it for now.\n<\/p>\n<p>\n  Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We entered a new year couple of weeks ago. I was a bit occupied with stuff around the new year&#8217;s time, but finally I can sit down and reflect upon how the last year went by for me. I&#8217;ll try to follow the same format as last year by writing what was good, what wasn&#8217;t, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5],"class_list":["post-1034","post","type-post","status-publish","format-standard","hentry","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1034","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1034"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1034\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1034"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1034"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1034"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}