{"id":1043,"date":"2019-08-02T22:00:00","date_gmt":"2019-08-02T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2019\/08\/02\/experiences-with-mac-and-moving-back\/"},"modified":"2019-08-02T22:00:00","modified_gmt":"2019-08-02T22:00:00","slug":"experiences-with-mac-and-moving-back","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2019\/08\/experiences-with-mac-and-moving-back.html","title":{"rendered":"Experiences With Macbook And MacOS &#8211; Part 2"},"content":{"rendered":"<p>\n  In the <a href=\"\/2019\/03\/experiences-with-macbook-and-macos.html\">part 1 of this post<\/a>, I wrote about getting a new laptop from\/for work. I also dug into the similarities and differences between my old Thinkpad T440 and my work computer, a Macbook Pro.\n<\/p>\n<p>\n  Now, after more than 6 months of using the Macbook as my primary computer, I switched back to my Thinkpad. In this article, I&#8217;ll get into what I missed from the Thinkpad (which was slightly different from what I thought I&#8217;d miss) and what the tipping point for the switch was. This is a personal account, and as such, is shaped by the way I perceive things. Probably it would have been very different if I&#8217;d used a Macbook from an early age and made my first shift to a GNU\/Linux distro 6 months ago.\n<\/p>\n<h3>Control<\/h3>\n<p>\n  You lose a lot of control from over your system when you run a proprietary operating system (and most software on it). That feels obvious when I write it that way, but we often forget or take things for granted when using a GNU based operating system that we realize only when we switch to something like MacOS. There are ways of <a href=\"https:\/\/www.makeuseof.com\/tag\/top-7-ways-personalize-mac-os-x-desktop\/\">customing MacOS<\/a>, no doubt, but they aren&#8217;t nearly as powerful (or simple) as the ones available on most distros on Linux.\n<\/p>\n<p>\n  It is worth noting that control isn&#8217;t strictly needed, and is a preference. But if you do prefer to be able to tinker with the way your system looks, feels and works, then you&#8217;ll find that preference better respected on this side of the fence.\n<\/p>\n<h3>UI<\/h3>\n<p>\n  No matter how hard I try, I just couldn&#8217;t get myself to like the gestures and animations in MacOS. My brain is kind of stuck in the old school menus of Windows XP\/7 (and hence, xfce). Also, having spent a lot of time customizing my status bar in xfce, I couldn&#8217;t help but feel under-equipped trying to do the same on MacOS. Not a huge fan of the bubbly semi-transparent UI scheme either.\n<\/p>\n<h3>New learnings<\/h3>\n<p>\n  Depending on how you see it, it can be regarded as both good and bad. Most things just work out of the box in MacOS. It is like buying a fully furnished house. That frees you from having to think about things like setting up Wifi, Bluetooth, screen brightness and so on. All keys on the keyboard do what they say they do, sound works out of the box, and even if you break something, you can always take it to someone to get it fixed (Not very sure if\/how the last one works, but guessing there&#8217;s some kind of support available to Macbook customers).\n<\/p>\n<p>\n  While all this sounds perfect (and it is, if that&#8217;s what you need), most of what I have learnt about computers is through fixing stuff that I broke while tinkering with it. A couple of months of MacOS usage made me realize that I&#8217;m not learning even a fraction of what I&#8217;d have otherwise did if I was using a broken system, full of shortcomings. I&#8217;ll let a quote from Moxie Marlinspike&#8217;s <a href=\"https:\/\/moxie.org\/blog\/the-worst\/\">The Worst<\/a> to summarize my thoughts.\n<\/p>\n<blockquote><p>\n  &#8230;no matter how much research they do, a partisan of the best might not ever know as much about motorcycles as the partisan of the worst who takes a series of hare-brained cross-country motorcycle trips on a bike that barely runs, and ends up learning a ton about how to fix their constantly breaking bike along the way. The partisan of the best will likely never know as much about sailing as the partisan of the worst who gets the shitty boat without a working engine that they can immediately afford, and has no choice but to learn how to enter tight spaces and maneuver under sail.\n<\/p><\/blockquote>\n<h3>Speed disappointments<\/h3>\n<p>\n  So, in exchange of all of that, I assumed, I&#8217;ll be using a system that&#8217;s super smooth and faster than anything I&#8217;d ever used. Nop. Not even that. It was just as fast as my old computer. I think newer CPUs and hardware in general are quite overrated for most people&#8217;s use cases. If you know even a tiny bit of what you&#8217;re doing (and aren&#8217;t part of that minority of computer users that <em>actually<\/em> needs powerful hardware), you can make a 5-10 year old computer work more or less the same way as any modern computer.\n<\/p>\n<h3>Community<\/h3>\n<p>\n  While I moved away from my Thinkpad, and by extension, the *nix community, it didn&#8217;t move away from me. I was constantly reminded of how customizable my desktop could&#8217;ve been at <a href=\"https:\/\/old.reddit.com\/r\/unixporn\/\">r\/unixporn<\/a>, how over 10 year old laptops are still daily drivers of many at <a href=\"https:\/\/old.reddit.com\/r\/thinkpad\/\">r\/thinkpad<\/a>, how easy getting your operating to do something for you used to be at StackOverflow and what good documentation should look like at <a href=\"https:\/\/wiki.archlinux.org\/\">ArchWiki<\/a>. All in all, I missed the community.\n<\/p>\n<h3>Tipping point<\/h3>\n<p>\n  While all of this was coming to my notice slowly, a major turning point was hearing Hakun Lie and Bruce Lawson at DevBreak two months ago. There, I got to know about web standards and where things are heading. It was fun to get reminded of the things that excited me about web in the first place. Then, Bruno walked me through a project of his that used some of the newer web apis. I was blown away, and honestly a little embarrassed to have forgotten the passion with with people talk about the web and engineering things on it. I just wanted to get back to my old world.\n<\/p>\n<h3>Final thoughts<\/h3>\n<p>\n  So I got back on my Thinkpad running a fresh installation of Arch and i3, and writing this on the same. Trying to get the function keys working never gets old for me, and the joy of having found the solution on the internet, implementing it and getting it to work and in the process actually understanding what happens when you press a function key is something you learn by actually doing it. This, and countless such experiences are what make it so much fun to be in the GNU\/Linux ecosystem.\n<\/p>\n<p>\n  Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the part 1 of this post, I wrote about getting a new laptop from\/for work. I also dug into the similarities and differences between my old Thinkpad T440 and my work computer, a Macbook Pro. Now, after more than 6 months of using the Macbook as my primary computer, I switched back to my [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[2],"class_list":["post-1043","post","type-post","status-publish","format-standard","hentry","tag-linux"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1043","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1043"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1043\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1043"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1043"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}