{"id":1052,"date":"2019-03-07T23:00:00","date_gmt":"2019-03-07T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2019\/03\/07\/experiences-with-macbook-and-macos\/"},"modified":"2019-03-07T23:00:00","modified_gmt":"2019-03-07T23:00:00","slug":"experiences-with-macbook-and-macos","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2019\/03\/experiences-with-macbook-and-macos.html","title":{"rendered":"Experiences With Macbook And MacOS"},"content":{"rendered":"<p>\n  It has been quite some time since I had last used a computer that would connect to the Wifi and Bluetooth out of the box without having me to scream at my computer screen and rip some hair. But that changed when I got my work laptop. It is a Macbook Pro. I was very excited to unbox my first ever Apple product, even though I was never keen on buying one myself (or could afford one, for that matter).\n<\/p>\n<figure>\n  <img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/macbook-thinkpad-scaled.jpg\"\/><figcaption>The two devices<\/figcaption><\/figure>\n<p>\n  There were some surprises, both pleasant and otherwise. This post is going to be about those, about how I felt switching from GNU\/Linux based distros to the MacOS, from a Thinkpad to Macbook. Note that one is a four year old second hand laptop, while the other is more recent and hence, not an entirely fair comparison for absolute things like specs. Also the Macbook costs about five times of what I paid for the Thinkpad. These are very personal experiences and hence, biased opinions. YMMV.\n<\/p>\n<h3>Similarities<\/h3>\n<p>\n  Both are excellent machines running excellent operating systems. If you want to get some work done, you couldn&#8217;t go wrong with either (and mostly depends on how familiar you are with each). Both are faster than anything I have used in the past. Software support is good on either. Both feel very durable (I can only vouch for the Thinkpad, but I&#8217;ve seen people use Macbooks for years too). And finally, both are considered &#8216;work&#8217; laptops marketed towards professionals.\n<\/p>\n<h3>Where The Macbook Shines<\/h3>\n<h4>1. Display<\/h4>\n<figure>\n  <img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/macbook-dell-resolution.png\"\/><figcaption>Compare the resolutions<\/figcaption><\/figure>\n<p>\n  The display is easily the best part of using a Macbook on a daily basis. Text is crisp, colors pop out of the screen and the resolution is out of this world. For comparison, the 27in monitor that I have as a secondary display has fewer pixels. Working on it is a joy, especially as a frontend developer.\n<\/p>\n<h4>2. Build Quality &#038; Bulk<\/h4>\n<p>\n  I used to think my Thinkpad was sleek and light, but the Mac is on another level. I can casually hold it in one hand and walk. There&#8217;s no flex anywhere, and the whole thing feels very solid and well built.\n<\/p>\n<h4>3. Trackpad<\/h4>\n<p>\n  It is nice to get gesture-support out of the box for once. I tried doing it for the Thinkpad on Xfce, but that attempt failed miserably. The trackpad on the Macbook is huge. It has two levels of clicking for added functionality (I use the dictionary\/reference look-up often). It supports many phone-touchscreen-like functions like pinch-to-zoom and is very refined.\n<\/p>\n<h4>4. Battery Life<\/h4>\n<p>\n  Again something that I had never experienced before, a super long battery life. I have all the battery optimizations disabled and never stop the dev servers and IDEs, but I still easily get through half the day without having to connect the charger.\n<\/p>\n<h4>5. Speakers<\/h4>\n<p>\n  In terms of absolute quality, I don&#8217;t know where the speakers on the Macbook Pro stand. For me, they&#8217;re hands down the best laptop speakers I have ever experienced. Loud and clear.\n<\/p>\n<h3>What I Miss From The Thinkpad<\/h3>\n<h4>1. Ruggedness<\/h4>\n<p>\n  While the Macbook is premium and rich, if I had to pick a more durable laptop, I&#8217;d pick the Thinkpad. I&#8217;d never use the Macbook as carelessly as I do my Thinkpad, especially considering the economic consequences.\n<\/p>\n<h4>2. Keyboard<\/h4>\n<p>\n  I tried to get used to the new keyboard, and I did. But whenever I go back and use my Thinkpad, I immediately realize why it is called the best in the business. Perfect click-iness, key travel and key shape. Typing is a joy on the Thinkpad.\n<\/p>\n<h4>3. I\/O<\/h4>\n<p>\n  Nothing new here, but it sucks to need a dongle just to be able to connect a USB drive or read an SD card (yes, I still use those regularly). HDMI for secondary display? Need a fancy cable for that. VGA? You from the past, bro?\n<\/p>\n<p>\n  All I&#8217;m trying to say is, I&#8217;d rather have too many options at the cost of elegance than too few at the cost of functionality.\n<\/p>\n<h4>4. Operating System<\/h4>\n<p>\n  It is hard to make a non-biased pick, but I&#8217;d still choose Arch and Xfce over MacOS. Many little things from years of using Linux distros have spoilt me; OS updates made me happy, but not anymore with Mac. Constant bugging to reboot just to update the OS? Don&#8217;t remember that from Arch. Aur (Arch User Repository) had everything in terms of software that you&#8217;d (almost) ever need, and I miss that.\n<\/p>\n<p>\n  It is also just the customizability an OS offers. The community that surrounds the laptop and the operating system (Have you checked out <a href=\"https:\/\/wiki.archlinux.org\/\">ArchWiki<\/a> yet?).\n<\/p>\n<h4>5. Repair Costs<\/h4>\n<p>\n  Thankfully, I&#8217;ve never had to repair either of them (I&#8217;d not have to do that for the Macbook anyway since it is a company device), but I felt the need to add this point here for fairness. Thinkpad parts are available in abundance on the internet, and you can do most repair on your own if you know how to use a screwdriver. A quick search for <a href=\"https:\/\/www.ebay.com\/sch\/i.html?_from=R40&#038;_trksid=p2380057.m570.l1313.TR1.TRC0.A0.H0.Xt440+motherboard.TRS0&#038;_nkw=t440+motherboard&#038;_sacat=0\">Thinkpad T440&#8217;s motherboard<\/a> on ebay pops up results in the 50$ &#8211; 150$ range depending on the configuration. An equivalent for Macbook goes around 600$ &#8211; 800$.\n<\/p>\n<h3>In closing<\/h3>\n<p>\n  As you can tell, there&#8217;s no clear winner here, even for me personally. I genuinely think the hardware of Apple is top notch and now kind of understand why many developers use Macbooks.\n<\/p>\n<p>\n  On the other hand, my heart still lies in the simplistic plains of Xfce, the ease of everyday operations, confidence to open the back cover and do minor repairs and the joy of just understanding what&#8217;s on the system. Of course, as things progress, maybe the Mac ways will become second nature to me and I&#8217;ll have a better understanding of this new system, which is nice.\n<\/p>\n<p>\n  It will be interesting to see how my thoughts shape from here. Cheers and thanks for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It has been quite some time since I had last used a computer that would connect to the Wifi and Bluetooth out of the box without having me to scream at my computer screen and rip some hair. But that changed when I got my work laptop. It is a Macbook Pro. I was very [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":382,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[2],"class_list":["post-1052","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-linux"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1052","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1052"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1052\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/382"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1052"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1052"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1052"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}