{"id":1055,"date":"2019-01-18T23:00:00","date_gmt":"2019-01-18T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2019\/01\/18\/mumbai-to-berlin\/"},"modified":"2023-09-15T21:59:35","modified_gmt":"2023-09-15T19:59:35","slug":"mumbai-to-berlin","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2019\/01\/mumbai-to-berlin.html","title":{"rendered":"Mumbai To Berlin"},"content":{"rendered":"<figure><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/arriving_berlin.png\" \/><\/figure>\n<p>Not many nice things can be said about the lack of planning things out. But if I had to, one of them would be that it really makes up for some uncertainty in life. Not necessarily good or bad, but makes things interesting from time to time. One such interesting phase that I&#8217;m living through is my time in Berlin. Do you know when you&#8217;re living through something, knowing that it is going to be memorable when you look back at it from the future? I&#8217;m kind of in that moment.<\/p>\n<figure><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/berlin-tv-tower-scaled.jpg\" \/><figcaption>The iconic Fernsehturm (TV tower) in Alexanderplatz<\/figcaption><\/figure>\n<figure><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/delhi-workdesk-scaled.jpeg\" \/><\/figure>\n<p>My humble workdesk in Delhi. Second day of work. Naively wishing I was home enjoying vacations.<\/p>\n<p>I couldn&#8217;t help but draw parallels between my arrival here in Berlin and some two and a half years ago in New Delhi. It felt similar to me in many ways. An unknown place, a completely different set of people I was going to spend time with, interact with. Back then, I was scared because I didn&#8217;t know the people, I didn&#8217;t know what I was going to work on, and I didn&#8217;t know if I&#8217;d fit in. This time around, with some experience from the past, I was excited for the very same reasons. The <i>&#8216;what is the worst that can happen?&#8217;<\/i> questioning philosophy kicks in and makes things interesting (and once you watch <a href=\"https:\/\/www.youtube.com\/watch?v=MBRqu0YOH14\">this amazing video on Optimistic Nihilism by Kurzesagt<\/a>, that mindset only strengthens). It also keeps you relatively safe while giving you much wider set of options than what would normally be available. (is this a <a href=\"https:\/\/en.wikipedia.org\/wiki\/Greedy_algorithm\">greedy approach<\/a>?)<\/p>\n<h3>Being An Expat<\/h3>\n<p>(Note and 2023 edit: For various reasons, I am no longer particularly fond of the word &#8220;expat&#8221;. I exclusively refer to myself as an immigrant. I wouldn&#8217;t edit the text to reflect that, but this note should suffice to reflect my newer thoughts)<\/p>\n<p>So I&#8217;m an expat now. What&#8217;s the big deal? I think the big deal is the added responsibilities that comes with moving out. You are your own boss, and while that sounds all sunshine and rainbows, it really isn&#8217;t. From making your own tea, washing your own cloths to deciding how much money needs to go for rent and if the bread you&#8217;re buying at the supermarket strikes the right balance between cost and nutrition. Trust me, you don&#8217;t want to jump straight into it without some training-wheel exercise first.<\/p>\n<p>The next thing is the experience. Moving to Berlin is something new, something I&#8217;d never experienced before and probably never would have if I hadn&#8217;t put some work into it. Experiencing something new is beneficial in many ways, and when that something new is a culture altogether, it teaches you a lot. And culture is not all there is. There&#8217;s the work style, interacting with colleagues, making friends, commuting and many such things. Now, I&#8217;m getting to experience how little things work out in not one, but two countries. And then that will lead to a lot more parallel-drawings which eventually end up widening my horizon. I feel that&#8217;s a good thing.<\/p>\n<p>I intend to do good work whilst I&#8217;m here, make a positive impact on the people around me and my company and in doing so, learn invaluable lessons in life, tech and else. I&#8217;ll keep this blog updated on more interesting experiences from Germany, but in case you have any specific questions, my email address is on the about page.<\/p>\n<h3>On People Living In Their Home Cities<\/h3>\n<p>Before closing this essay, I&#8217;d list down one important thought.<\/p>\n<p>I had never understood people; friends, seniors and industry veterans alike, when they said they wish to live close to their hometown with their families and commute from home everyday. I mean, why would you have restrictions for yourself, right? Aren&#8217;t you excited to live in this shinny new city and make money?<\/p>\n<p>I feel my thoughts have changed, and changed for the good. Now I think I can empathize with them. It is a very valid reason and goal and while I may or may not make such a decision, I&#8217;ll have huge respect for anyone who does. It must take a lot of courage to go that way.<\/p>\n<h3>In Closing<\/h3>\n<p>Berlin is a beautiful city. The people are amazing, you have all sorts of food options. The streets are great for casual walking, like they&#8217;ve stood there still in history. Occasional posters and banners remind you of the history of this place. The way history is preserved in the architecture here, yet staying on top of the globalization game, is commendable. And sometimes, I just pause and think, how on earth did I make it here!<\/p>\n<figure><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/berlin-intersection-snowing-scaled.jpg\" \/><figcaption>A snowy evening in Friedrichshain<\/figcaption><\/figure>\n<p>So here&#8217;s to my new journey. I hope, with the usual ups and downs, things work out well. I hope to learn more and share my learnings with you. Embedding the video mentioned above, if you&#8217;d like to give it a watch. Thank you for reading!<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube-nocookie.com\/embed\/MBRqu0YOH14\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Not many nice things can be said about the lack of planning things out. But if I had to, one of them would be that it really makes up for some uncertainty in life. Not necessarily good or bad, but makes things interesting from time to time. One such interesting phase that I&#8217;m living through [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":435,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-1055","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1055","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1055"}],"version-history":[{"count":2,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1055\/revisions"}],"predecessor-version":[{"id":2017,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1055\/revisions\/2017"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/435"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1055"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1055"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1055"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}