{"id":1060,"date":"2018-10-15T22:00:00","date_gmt":"2018-10-15T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/10\/15\/the-pragmatic-programmer-quotes\/"},"modified":"2018-10-15T22:00:00","modified_gmt":"2018-10-15T22:00:00","slug":"the-pragmatic-programmer-quotes","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/10\/the-pragmatic-programmer-quotes.html","title":{"rendered":"The Pragmatic Programmer Notable Quotes"},"content":{"rendered":"<p>\n  I completed reading &#8216;The Pragmatic Programmer&#8217;, probably one of the most recommended pieces of literature on software engineering. I&#8217;ll try to put down some of the quotes and my interpretation of them in the following paragraphs. I&#8217;ll be coming back to this from time to time. Hope they help you in your next software project.\n<\/p>\n<h3>The Cat Ate My Source Code<\/h3>\n<blockquote><p>\n  The greatest of all weaknesses is the fear of appearing weak.\n<\/p><\/blockquote>\n<p>\n  Take responsibility for the code that you write and the decisions that you make, and when things go south, present options to recover from the mess instead of pointing fingers.\n<\/p>\n<h3>Software Entropy<\/h3>\n<blockquote><p>\n  When disorder increases in software, programmers call it &#8220;software rot.&#8221;\n<\/p><\/blockquote>\n<p>\n  Active efforts have to be made to keep the disorder low and go against the nature&#8217;s law (of ever-increasing entropy) to keep away from software rot.\n<\/p>\n<blockquote><p>\n  Don&#8217;t Live with Broken Windows\n<\/p><\/blockquote>\n<p>\n  Once there is a broken window in a building, there will be more broken windows. This is the <a href=\"https:\/\/en.wikipedia.org\/wiki\/Broken_windows_theory\">broken windows theory<\/a>. Similarly, once a piece of sloppy code enters a codebase, it will attract more sloppiness. Don&#8217;t be the one to introduce a broken window into your codebase and fix existing ones as soon as feasible.\n<\/p>\n<h3>Stone Soup and Boiled Frogs<\/h3>\n<blockquote><p>\n  The frog just doesn&#8217;t notice the change. Don&#8217;t be like the frog. Keep an eye on the big picture. Constantly review what&#8217;s happening around you, not just what you personally are doing.\n<\/p><\/blockquote>\n<p>\n  If you throw a frog into boiling water, it will jump out at your face. But if you put the frog in cold water and boil it, it won&#8217;t notice and get cooked to death. Good software projects die just like that, slowly, without anyone noticing.\n<\/p>\n<h3>Good-Enough Software<\/h3>\n<blockquote><p>\n  But artists will tell you that all the hard work is ruined if you don&#8217;t know when to stop. If you add layer upon layer, detail over detail, the painting becomes lost in the paint. Don&#8217;t spoil a perfectly good program by overembellishment and over-refinement.\n<\/p><\/blockquote>\n<p>\n  Know when to stop refining a piece of software. Make tradeoffs if they improve the overall quality of your software.\n<\/p>\n<h3>Your Knowledge Portfolio<\/h3>\n<ul>\n<li>Serious investors invest regularly—as a habit. <\/li>\n<li>Diversification is the key to long-term success. <\/li>\n<li>Smart investors balance their portfolios between conservative and high-risk, high-reward investments. <\/li>\n<li>Investors try to buy low and sell high for maximum return. <\/li>\n<li>Portfolios should be reviewed and rebalanced periodically. <\/li>\n<\/ul>\n<p>\n  Think about your knowledge portfolio as investors think about their investment portfolio.\n<\/p>\n<h3>Communicate!<\/h3>\n<blockquote><p>\n  It&#8217;s not just what you&#8217;ve got, but also how you package it. Having the best ideas, the finest code, or the most pragmatic thinking is ultimately sterile unless you can communicate with other people. A good idea is an orphan without effective communication.\n<\/p><\/blockquote>\n<p>\n  Learn to communicate with different kinds of people, technical and non-technical alike.\n<\/p>\n<h3>The Evils of Duplication<\/h3>\n<blockquote><p>\n  DRY (Don&#8217;t Repeat Yourself) principle: EVERY PIECE OF KNOWLEDGE MUST HAVE A SINGLE, UNAMBIGUOUS, AUTHORITATIVE REPRESENTATION WITHIN A SYSTEM.\n<\/p><\/blockquote>\n<p>\n  Documents are no exception. Don&#8217;t duplicate business logic in code AND documentation. There should be one true source of knowledge (model) and the others should simply be views of that source.\n<\/p>\n<h3>Orthogonality<\/h3>\n<blockquote><p>\n  In computing, the term has come to signify a kind of independence or decoupling. Two or more things are orthogonal if changes in one do not affect any of the others.\n<\/p><\/blockquote>\n<p>\n  The code you write has to be as decoupled from the rest of the project as possible. It makes bugs easier to find. There should never be overlapping functionality or duplicate code (also a violation of the DRY principle).\n<\/p>\n<h3>The Basic Tools<\/h3>\n<blockquote><p>\n  Every craftsman starts his or her journey with a basic set of good-quality tools.\n<\/p><\/blockquote>\n<p>\n  Selecting a good set of tools can greatly improve your productivity and skills.\n<\/p>\n<h3>Source Code Control<\/h3>\n<blockquote><p>\n  Always Use Source Code Control\n<\/p><\/blockquote>\n<p>\n  Even on single person projects that&#8217;s never going to see the light of the sun.\n<\/p>\n<h3>Debugging<\/h3>\n<blockquote><p>\n  Embrace the fact that debugging is just problem solving, and attack it as such.\n<\/p><\/blockquote>\n<blockquote><p>\n  The best way to start fixing a bug is to make it reproducible. After all, if you can&#8217;t reproduce it, how will you know if it is ever fixed?\n<\/p><\/blockquote>\n<blockquote><p>\n  &#8220;select&#8221; Isn&#8217;t Broken\n<\/p><\/blockquote>\n<p>\n  If you encounter a bug, always be suspicious of your own code. No, the compiler isn&#8217;t broken and nor is the CPU. It is your code, fix it.\n<\/p>\n<h3>Pragmatic Paranoia<\/h3>\n<blockquote><p>\n  You Can&#8217;t Write Perfect Software\n<\/p><\/blockquote>\n<blockquote><p>\n  But Pragmatic Programmers take this a step further. They don&#8217;t trust themselves, either.\n<\/p><\/blockquote>\n<blockquote><p>\n  When everybody actually is out to get you, paranoia is just good thinking.\n<\/p><\/blockquote>\n<p>\n  We overestimate our capabilities often. Most people think they&#8217;re the best drivers out there. Pragmatic programmers understand that everyone, including themselves, make mistakes, and hence keep an eye out for bugs before they creep in.\n<\/p>\n<h3>Dead Programs Tell No Lies<\/h3>\n<blockquote><p>\n  When your code discovers that something that was supposed to be impossible just happened, your program is no longer viable. Anything it does from this point forward becomes suspect, so terminate it as soon as possible. A dead program normally does a lot less damage than a crippled one.\n<\/p><\/blockquote>\n<h3>Assertive Programming<\/h3>\n<blockquote><p>\n  If It Can&#8217;t Happen, Use Assertions to Ensure That It Won&#8217;t\n<\/p><\/blockquote>\n<blockquote><p>\n  Turning off assertions when you deliver a program to production is like crossing a high wire without a net because you once made it across in practice. There&#8217;s dramatic value, but it&#8217;s hard to get life insurance.\n<\/p><\/blockquote>\n<p>\n  Always use assertions to make sure things are working well, even in situations when you&#8217;re sure or things are &#8216;obviously simple&#8217;. Detect early and abort.\n<\/p>\n<h3>When to Use Exceptions<\/h3>\n<blockquote><p>\n  &#8220;Will this code still run if I remove all the exception handlers?&#8221; If the answer is &#8220;no,&#8221; then maybe exceptions are being used in nonexceptional circumstances.\n<\/p><\/blockquote>\n<p>\n  Don&#8217;t use exception for normal code flow control. Exceptions need to be reserved for &#8216;exceptional&#8217; situations.\n<\/p>\n<h3>Decoupling and the Law of Demeter<\/h3>\n<blockquote><p>\n    Organize your code into cells (modules) and limit the interaction between them. If one module then gets compromised and has to be replaced, the other modules should be able to carry on.\n<\/p><\/blockquote>\n<h3>Metaprogramming<\/h3>\n<blockquote><p>Configure, Don&#8217;t Integrate<\/p><\/blockquote>\n<blockquote><p>Our goal is to think declaratively (specifying what is to be done, not how) and create highly dynamic and adaptable programs.<\/p><\/blockquote>\n<blockquote><p>Program for the general case, and put the specifics somewhere else—outside the compiled code base.<\/p><\/blockquote>\n<blockquote><p>Put Abstractions in Code, Details in Metadata<\/p><\/blockquote>\n<blockquote><p>Because business policy and rules are more likely to change than any other aspect of the project, it makes sense to maintain them in a very flexible format.<\/p><\/blockquote>\n<h3>It&#8217;s Just a View<\/h3>\n<blockquote><p>The view is an interpretation of the model (perhaps a subset)—it doesn&#8217;t need to be graphical.<\/p><\/blockquote>\n<blockquote><p>The controller is more of a coordination mechanism, and doesn&#8217;t have to be related to any sort of input device.<\/p><\/blockquote>\n<p>\n  Understand what a view really is. Everything revolves around the models, and views are just different ways in which you can represent those models.\n<\/p>\n<h3>While You Are Coding<\/h3>\n<blockquote><p>However, good, safe drivers are constantly reviewing the situation, checking for potential problems, and putting themselves into good positions in case the unexpected happens. The same is true of coding—it may be largely routine, but keeping your wits about you could well prevent a disaster.<\/p><\/blockquote>\n<h3>Programming by Coincidence<\/h3>\n<blockquote><p>Fred doesn&#8217;t know why the code is failing because he didn&#8217;t know why it worked in the first place. <\/p><\/blockquote>\n<blockquote><p>If you don&#8217;t have fundamentals or infrastructure correct, brilliant bells and whistles will be irrelevant. <\/p><\/blockquote>\n<p>\n  Program consciously. Write code thinking of it as an autonomous task once you have the business requirements and architecture clear is a mistake. There has to be equal involvement during programming.\n<\/p>\n<h3>Refactoring<\/h3>\n<blockquote><p>\n  Rather than construction, software is more like gardening—it is more organic than concrete. You plant many things in a garden according to an initial plan and conditions. Some thrive, others are destined to end up as compost. You may move plantings relative to each other to take advantage of the interplay of light and shadow, wind and rain. Overgrown plants get split or pruned, and colors that clash may get moved to more aesthetically pleasing locations. You pull weeds, and you fertilize plantings that are in need of some extra help. You constantly monitor the health of the garden, and make adjustments (to the soil, the plants, the layout) as needed.\n<\/p><\/blockquote>\n<blockquote><p>\n  If it hurts now, but is going to hurt even more later, you might as well get it over with.\n<\/p><\/blockquote>\n<h3>Code That&#8217;s Easy to Test<\/h3>\n<blockquote><p>\n  All software you write will be tested—if not by you and your team, then by the eventual users—so you might as well plan on testing\n<\/p><\/blockquote>\n<h3>The Requirements Pit<\/h3>\n<blockquote><p>Don&#8217;t Gather Requirements—Dig for Them<\/p><\/blockquote>\n<blockquote><p>Work with a User to Think Like a User<\/p><\/blockquote>\n<blockquote><p>The key to managing growth of requirements is to point out each new feature&#8217;s impact on the schedule to the project sponsors.<\/p><\/blockquote>\n<h3>Ubiquitous Automation<\/h3>\n<blockquote><p>Civilization advances by extending the number of important operations we can perform without thinking.<\/p><\/blockquote>\n<p>\n  Automate as much as you can.\n<\/p>\n<h3>Ruthless Testing<\/h3>\n<blockquote><p>\n  Most developers hate testing. They tend to test gently, subconsciously knowing where the code will break and avoiding the weak spots. Pragmatic Programmers are different. We are driven to find our bugs now, so we don&#8217;t have to endure the shame of others finding our bugs later.\n<\/p><\/blockquote>\n<blockquote><p>\n  Test State Coverage, Not Code Coverage\n<\/p><\/blockquote>\n<h3>It&#8217;s All Writing<\/h3>\n<blockquote><p>\n  One of the most important pieces of information that should appear in the source file is the author&#8217;s name—not necessarily who edited the file last, but the owner.\n<\/p><\/blockquote>\n<h3>Pride and Prejudice<\/h3>\n<blockquote><p>\n  We want to see pride of ownership. &#8220;I wrote this, and I stand behind my work.&#8221; Your signature should come to be recognized as an indicator of quality. People should see your name on a piece of code and expect it to be solid, well written, tested, and documented. A really professional job. Written by a real professional. A Pragmatic Programmer.\n<\/p><\/blockquote>\n<p>\n  Take pride in your work. Don&#8217;t just assume it will be a small cog in the big wheel and use that as an excuse to write sloppy code.\n<\/p>\n<h3>In Closing<\/h3>\n<p>\n  That&#8217;s all. There&#8217;s a lot more in the book, the stories and the experiences. I highly recommend you give it a try if your day job involves writing computer code. Thanks for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I completed reading &#8216;The Pragmatic Programmer&#8217;, probably one of the most recommended pieces of literature on software engineering. I&#8217;ll try to put down some of the quotes and my interpretation of them in the following paragraphs. I&#8217;ll be coming back to this from time to time. Hope they help you in your next software project. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[15,16],"class_list":["post-1060","post","type-post","status-publish","format-standard","hentry","tag-books","tag-programming"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1060","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1060"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1060\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1060"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1060"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1060"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}