{"id":1063,"date":"2018-09-18T22:00:00","date_gmt":"2018-09-18T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/09\/18\/accessibility-first-web-development\/"},"modified":"2018-09-18T22:00:00","modified_gmt":"2018-09-18T22:00:00","slug":"accessibility-first-web-development","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/09\/accessibility-first-web-development.html","title":{"rendered":"Accessibility-First Web Development"},"content":{"rendered":"<p>\n  When you zoom out a bit and think fundamentally, the web is just an input\/output device for the end user. One can send and receive data and&#8230;umm? and that&#8217;s basically all you can do over the internet. When you think about it this way, the web seems like a lab experiment that got out of hand.\n<\/p>\n<p>\n  Now when I, as a web engineer, think of what the web is, I find myself in midst of complex jargon, standards, protocols, incompatibility and all the bloat surrounding web development these days. But for the end user, it is simply an IO device and that is something we mustn&#8217;t forget.\n<\/p>\n<figure>\n  <img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/ipad-stock.jpg\"\/><figcaption>https:\/\/www.pexels.com\/photo\/laptop-technology-ipad-tablet-35550\/<\/figcaption><\/figure>\n<p>\n  So if the web is fundamentally an IO device, shouldn&#8217;t we spend some time figuring out how to engineer things on top of it such that they are accessible to as many people as possible. I think so, and that is what I&#8217;ve been learning about these days. Without a doubt, the entire software ecosystem is getting more and more complex by the second, the merits and demerits of which are arguable. It gives me immense joy to work on SPAs and PWAs as an engineer. But not every website has to be an SPA. Heck, not every website has to have AJAX or even jQuery. Using plain old <code>&lt;form action=\"\"&gt;<\/code> does not make you ancient. It makes you more accessible to people who have Javascript disabled.\n<\/p>\n<p>\n  But don&#8217;t stop there. Implement AJAX. Think about your use case and if it makes your or your visitors&#8217; life easy, go ahead and drop React or any other modern web framework. But do so progressively, making sure your webapp is &#8216;functional&#8217; for someone on a 320px wide browser on a slow internet connection as well as for any visitor on the latest iPad and 4G.\n<\/p>\n<p>\n  Let&#8217;s try to list down some tools and tricks we can keep in mind while developing our next web application to ensure that our web stays the medium it was meant to be; a library open to all, and not a shopping mall for the rich.\n<\/p>\n<h3>Progressive Enhancement<\/h3>\n<p>\n  <a href=\"https:\/\/en.wikipedia.org\/wiki\/Progressive_enhancement\">Progressive Enhancement<\/a> is when you start developing a website with focus on core functionality and content accessible to as many users as possible, and then progressively keep on adding features for the modern browsers. That way, you satisfy the requirements <i>and<\/i> keep your site accessible. I suppose the only downside to this is that it will take more time to develop and build a web app this way, and I agree that time is usually the only commodity that startups and mid-sized companies don&#8217;t have these days. But most websites are not startup products, they&#8217;re information portals, personal blogs and wikis. No, I&#8217;m not discouraging startups from attempting progressive enhancement, but having worked at a lean-ish startup, I understand that this approach is not for everyone.\n<\/p>\n<h3>Speed<\/h3>\n<figure>\n  <img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/performance-nagekar.com_.png\"\/><figcaption>Shameless self-promotion<\/figcaption><\/figure>\n<p>\n  Your website has to be fast. It has been repeated by <a href=\"https:\/\/blog.codinghorror.com\/performance-is-a-feature\/\">many<\/a> <a href=\"https:\/\/tonsky.me\/blog\/speed\/\">industry veterans<\/a> so you don&#8217;t have to believe me. We need to take pride not just in the way our websites look, but how quickly it loads. After all, we&#8217;re engineers.\n<\/p>\n<p>\n  One approach to this is to understand exactly what is being made. A personal blog does not need analytics code. Static social buttons with hardcoded links are much faster (and better from your user&#8217;s privacy perspective) than those dynamic ones. Use a CDN and <a href=\"\/2018\/08\/https-by-default.html\">HTTPS certificate<\/a>, both of which are free.\n<\/p>\n<h3>Mobile Responsiveness<\/h3>\n<p>\n  It really does not take much effort to make a website mobile responsive these days. Native CSS gives you enough tools to create nice grid layouts which respond to the different browser widths. I like to test my websites to a minimum of 320px, and have fixed max-width viewport (purely personal preference). Given the vastness of screen sizes these days, it helps me have a reasonable window for deciding how to collapse sections based on different widths. Responsive web design isn&#8217;t easy, but not very difficult either. Recommended reading: <a href=\"https:\/\/abookapart.com\/products\/responsive-web-design\">Responsive Web Design &#8211; Ethan Marcotte<\/a>\n<\/p>\n<h3>Content<\/h3>\n<figure>\n  <img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/news-website.png\"\/><figcaption>A major news outlet&#8217;s homepage &#8211; how not to do it<\/figcaption><\/figure>\n<p>\n  The content is the heart of your website, and it needs to be treated as such. Check out any popular Indian news website for guidelines on how <i>not<\/i> to place ads and prioritize content. If your website doesn&#8217;t resemble that level of junk overload for the user, you&#8217;re doing better than most.\n<\/p>\n<h3>Text &amp; Colors<\/h3>\n<p>\n  Text in lighter shades of gray on even lighter gray background look softer to eyes, but care must be taken not to overdo it. Remember that not everyone has a Retina or IPS display that you&#8217;re using to develop your beautiful webapp. It happened with my in LaughGuru. At some places, the text on the design mockups was so contrast-less, I had to change the angle of my monitor just to be able to read it (I had an old 1024&#215;1280 square TFT LCD display on my desk).\n<\/p>\n<h3>In Closing<\/h3>\n<p>\n  It is always nice to learn something new. I hope this learning continues, and I also hope you found some value in this article. Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you zoom out a bit and think fundamentally, the web is just an input\/output device for the end user. One can send and receive data and&#8230;umm? and that&#8217;s basically all you can do over the internet. When you think about it this way, the web seems like a lab experiment that got out of [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":461,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[29],"class_list":["post-1063","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-web"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1063","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1063"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1063\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/461"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1063"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1063"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1063"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}