{"id":1064,"date":"2018-08-25T22:00:00","date_gmt":"2018-08-25T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/08\/25\/on-the-importance-of-iteration\/"},"modified":"2018-08-25T22:00:00","modified_gmt":"2018-08-25T22:00:00","slug":"on-the-importance-of-iteration","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/08\/on-the-importance-of-iteration.html","title":{"rendered":"On The Importance Of Iterations In (Product) Development"},"content":{"rendered":"<p>\n  In LaughGuru, we received designs from the UI designers on <a href=\"https:\/\/zeplin.io\/\">Zeplin<\/a>, a nice tool that bridges the gap between designers and developers. While I wouldn&#8217;t know about designers, it definitely made my life (as a developer) easy. My previous experience with frontend was with designers who gave me Photoshop PSDs and that was it. A Photoshop noob was expected to extract layers among other things and think about mobile responsiveness and all of that. I&#8217;ll leave you here saying it didn&#8217;t end well. But I digress.\n<\/p>\n<p>\n  Recently, I read the all-time classic <a href=\"\/2018\/03\/book-review-the-mythical-man-month.html\">&#8216;The Mythical Man Month&#8217;<\/a>. It had an interesting line that I even wrote in my <a href=\"http:\/\/nagekar.com\/quotes.txt\">nice quotes file<\/a>. It goes like this: <i>&#8220;Plan to throw one away; you will, anyhow.&#8221;<\/i>. It says something about planning to throw away the initial iteration of any product that you&#8217;re developing, because even if you don&#8217;t, you&#8217;ll throw it regardless. While that isn&#8217;t very agile and might not apply in its entirety to most of the software development happening today (to be fair, it was initially written in 1975), it had an interesting idea about how the first version of the product needs major reforms (or rewrite) to end up as something usable and\/or beautiful. You can&#8217;t avoid that. You can only prepare for that.\n<\/p>\n<p>\n  Coming back to why I mentioned LaughGuru because I just remembered that. The first version that we received from the designers wasn&#8217;t very impressive. It lacked colors and looked bland to my &#8216;taste&#8217;, whatever it was at that time. But my manager had something else on his mind. He seemed to focus on the data flow and UX parts of things rather than the colors, unlike me. We went ahead and implemented it anyway, but since there was no design-design, most of the focus was on functionality, routing and data flow. It became the beta of our product&#8217;s latest iteration.\n<\/p>\n<p>\n  Later, we received newer designs which had colors. We discussed and later implemented them. This time, I could fully focus on the designs part as functionality was already done and tested. We did decently well and a couple of iterations later the end result was nothing short of beautiful. I used to tell my manager <i>Look! it has started to look even better now<\/i>, and he usually replied, unimpressed and with the typical attitude of a badass that he was, <i>Yes, that&#8217;s kinda the idea<\/i>. Of course, separation of concerns works. I was proud, and an important lesson got reinforced within me. The first iteration is usually ugly and sometimes embarrassingly silly. But it tells nothing about the practicality or viability of the underlying idea. It tells even less about if the idea will ever be successful. So why abandon it or feel dejected if the initial iteration draws negative feedback. Instead, learn from the criticisms and stick to the larger goal of why you started it in the first place.\n<\/p>\n<p>\n  I was recently working on my portfolio site because, to be honest, having this blog as a site to represent me and the kind of work that I do doesn&#8217;t really work with anyone expect developers and engineers, and that isn&#8217;t a very nice (read: accessible) thing to say about a website or yourself. I wanted something fancy and shiny, so I made that. Following are some don&#8217;t dos in any software project. I tried to focus on too many at once (content, UX, UI). I tried to get everything straight in one iteration, or roughly a day. I had no plan for the development, or any vision about what the end result should look like. I had little idea about what audience I&#8217;m targeting. The end result was something I wasn&#8217;t very proud, but I still asked my friends for feedback.\n<\/p>\n<p>\n  While the feedback was in general useful, a friend who was particularly into UX and UIs decided to guide me a bit (I&#8217;m sure he must&#8217;ve had taken a deep breath on seeing my work). He completed a course on product design on Udacity which mentioned that UI designing is never complete. You will always find ways to improve, and at a point, you&#8217;ll have to stop yourself once the design requirements are settled. But the room for improvements is always there. Another useful lesson. We went on to make small changes in the page, and with each little change, such as making a heading bold or adding some padding below an element, the page looked better than it looked previously. Within a day or two, the page was something that I&#8217;d proudly associate with myself.\n<\/p>\n<p>\n  So to close this one, let&#8217;s review the lessons we learnt:<\/p>\n<ul>\n<li>\n      Your product&#8217;s first iteration is going to look like shit unless you decide to launch it too late. Don&#8217;t get saddened by its lack of &#8216;perfection&#8217;, for you&#8217;ll have plenty of time to do it down the line. Focus on the basics like why you started it all and what purpose it is supposed to serve.\n    <\/li>\n<li>\n      Separation of concerns is important. It is easy to get overwhelmed by the things to do, so have a plan and don&#8217;t put too many things on your plate at once.\n    <\/li>\n<li>\n      It takes time to create anything worthwhile. You cannot get something right in the first iteration itself. It is against the laws of nature. Evolution required some four billion years to create the beautiful individual that you are. Don&#8217;t rush it beyond what is possible and practical.\n    <\/li>\n<li>\n      In UI development, things are never done to a 100%. You try to improve as much as possible through iterations, meeting business requirements and personal standards and then going well beyond that. At a point, you call it a day and move on to the next challenge.\n    <\/li>\n<\/ul>\n<p>\n  I hope you enjoyed this little article. Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In LaughGuru, we received designs from the UI designers on Zeplin, a nice tool that bridges the gap between designers and developers. While I wouldn&#8217;t know about designers, it definitely made my life (as a developer) easy. My previous experience with frontend was with designers who gave me Photoshop PSDs and that was it. A [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[16],"class_list":["post-1064","post","type-post","status-publish","format-standard","hentry","tag-programming"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1064","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1064"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1064\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1064"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1064"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1064"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}