{"id":1068,"date":"2018-08-04T22:00:00","date_gmt":"2018-08-04T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/08\/04\/system-stability-moving-back-to-xfce\/"},"modified":"2018-08-04T22:00:00","modified_gmt":"2018-08-04T22:00:00","slug":"system-stability-moving-back-to-xfce","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/08\/system-stability-moving-back-to-xfce.html","title":{"rendered":"System Stability &amp; Moving Back To XFCE"},"content":{"rendered":"<p>\n  One thing that I really <i>hate<\/i>, and I don&#8217;t use that word very often while describing my computer preferences, is system crashes. It&#8217;s one of those things; just unacceptable to me. You&#8217;re working on something important, and all of a sudden, the DE (Desktop Environment) decides that it needs to restart itself, and you lose all of your windows, terminals and most importantly, context. Coming back from there is a 15-minute process in itself; logging back again, starting the browser, IDE, terminals, entering virtual environments, running test servers and so on. As you can tell, it can escalate from slight inconvenience to very frustrating in little time.\n<\/p>\n<p>\n  When I got my <a href=\"\/2018\/05\/lenovo-thinkpad-t440-ebay-refurbished-laptop-review.html\">new laptop<\/a> back in May, I decided to switch away from XFCE. To be honest, I did try installing XFCE but couldn&#8217;t due to some issue starting the DE. Since this was a fancier laptop with better hardware, I assumed I can afford running a somewhat heavier DE for a better user experience (and my colleagues&#8217; Macbooks constantly reminded me that I&#8217;m using an ancient (looking) DE). I did some research and was split between KDE and GNOME 3.\n<\/p>\n<p>\n  So the initial impressions of GNOME 3 were not very convincing (not that this was the first time I tried GNOME 3 anyway). I never liked the gesture-like way of accessing windows and quick menu. I&#8217;m more of a click-click person. But I decided to stick with it and see how it goes, customizing whatever that I can. So after that, things went uphill for a while. The more I used GNOME, the more I started to appreciate it. I brought back the &#8216;conventional&#8217; application menu, quick access bar on the left side with an extension called <a href=\"https:\/\/extensions.gnome.org\/extension\/307\/dash-to-dock\/\">Dash to Dock<\/a>, Pomodoro and a bunch of widgets for the top bar (which by default is mostly empty).\n<\/p>\n<p>\n  A few issues persisted from the beginning. The most important one was memory and CPU usage. I looked up and concluded that it is a <a href=\"https:\/\/duckduckgo.com\/?q=gnome+shell+high+memory+usage&#038;t=ffab&#038;ia=web\">general problem<\/a> and not just my laptop. The problem is not just the high usage of system resources (which is even a good thing if you <a href=\"https:\/\/linux-mm.org\/Low_On_Memory\">trust the kernel<\/a>). Problem is when you see <code>gnome-shell<\/code> constantly use one CPU even while idling and 500MB-1GB of data just after startup. Now, due to this, I was constantly facing situations when the RAM would go over 90% and the system would start to lag. This was serious, but this wasn&#8217;t the worst part.\n<\/p>\n<p>\n  I could&#8217;ve lived with a (little) laggy system, a system that lags while opening the app drawer, for example (tip: create shortcuts to all the apps that you frequently use to avoid GNOME 3&#8217;s app drawer altogether), but the DE would also crash all of a sudden, wasting my time re-spawning everything. And it was especially bad when it happened during my work hours. That was a deal breaker. I tried to debug it, but couldn&#8217;t convince myself to spend more time on it as it wasn&#8217;t making a lot of sense. I installed XFCE, made it work and it felt like I&#8217;m back home to my countryside house from a vacation in the city. Felt good.\n<\/p>\n<p>\n  In conclusion, I think I&#8217;m biased here. I had a preconceived notion about GNOME 3, and I might have fallen for that. Maybe GNOME 3 is objectively better at many things that my bias didn&#8217;t let me see. Don&#8217;t get me wrong. GNOME 3 is a wonderful DE, and for someone who values the bells and whistles that come with GNOME (I had three finger and four finger gesture support for once in my life. Thanks, GNOME) I think it is a perfect choice. For me, however, system stability is way too important than any secondary convenience feature.\n<\/p>\n<p>\n  An interesting thing I saw Mac OS users do was that they used to always suspend their machines, not shutting them down often. I wanted to do that since forever, just close the lid and be done with it. I never could do that on my old laptop because new issues would creep in after resuming from suspended state (failure to connect to wifi, display staying all black, USB ports not working etc to name a few). No such issue is present on my Thinkpad, and as a result, I suspend it in between use and at night. The system is rock solid, even at heavy loads. As an enthusiast, it gives me a lot of pride in mentioning my last shutdown was nearly ten days ago.\n<\/p>\n<p><code> 22:00:09 up 9 days, 11:17,  1 user,  load average: 0.84, 0.58, 0.59 <\/code><\/p>\n<p>\n  I&#8217;m sure a lot of you reading this can relate to the pride of showing off uptimes and talking about system stability, or the joy of keeping your car running in top notch condition after years with proper service and care! This is similar. Hope you found this interesting. Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One thing that I really hate, and I don&#8217;t use that word very often while describing my computer preferences, is system crashes. It&#8217;s one of those things; just unacceptable to me. You&#8217;re working on something important, and all of a sudden, the DE (Desktop Environment) decides that it needs to restart itself, and you lose [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[2],"class_list":["post-1068","post","type-post","status-publish","format-standard","hentry","tag-linux"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1068","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1068"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1068\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1068"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1068"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1068"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}