{"id":1069,"date":"2018-07-31T22:00:00","date_gmt":"2018-07-31T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/07\/31\/backend-development\/"},"modified":"2018-07-31T22:00:00","modified_gmt":"2018-07-31T22:00:00","slug":"backend-development","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/07\/backend-development.html","title":{"rendered":"Backend Development With Flask"},"content":{"rendered":"<h3>Context<\/h3>\n<p>\n    I distinctly remember how much I liked writing backends (well, <a href=\"https:\/\/github.com\/abhn\/turnouts\">I tried<\/a>). I also remember thinking, <i>I will never become a frontend engineer. Ever.<\/i> Like many software developers in my circle, I hated writing CSS, and JS hadn&#8217;t clicked until then. And these were the days before I knew anything about automated deployments. Deployment, for me, was spinning up a Digital Ocean droplet, installing everything manually, setting up the database (and copy pasting the db creds into code), and then running the development server and keeping it running. Stop laughing, please.\n<\/p>\n<h3>Motivations<\/h3>\n<p>\n    So I decided to pick up some backend skills again. The main reasons for this were that I&#8217;ll need a full-time job soon, and it would be much better if I get to write the full stack of the web instead of just the frontend. Secondly, knowing full stack is a superpower that I&#8217;d not want to not know. It comes in incredibly handy when working on some personal projects that require the web as an enabler. Thirdly, I wanted to refresh my Python skills. I liked python a lot <a href=\"\/2014\/07\/starting-with-python.html\">back in the day<\/a>, but I had lost touch since the last couple of years. So with those goals, I started with Python and Flask.\n<\/p>\n<h3>Python &amp; Flask<\/h3>\n<p>\n    I liked flask, but I&#8217;m still struggling with some basics, especially working with app instances for writing tests. Yes, there are a few differences working with the backend this time versus like three years ago. I&#8217;m following (or trying to follow) the best practices, writing tests for the code, I have a nice CI pipeline which starts with testing of the code and ends with deploying the app on Heroku. Most importantly, I have an excellent mentor for my backend adventures who&#8217;s a badass python programmer.\n<\/p>\n<p>\n    Flask is fun to work with. The framework is minimal, kinda like React. There&#8217;s a lot of support online, and there are great plugins already available for most common functionality. Databases are one of my weakest points in web engineering, and I&#8217;m trying to experiment a lot of things on the model layer with SQLAlchemy and Postgres backend. One more novelty for me was asynchronous programming. In Javascript, you had to beg for things to be synchronous. But here you face a different problem; If something is slow, then the entire thread is blocked. For taking care of things that are slow, say sending an email, one could use Celery with RabbitMQ&#8217;s backend. All of this is given to us ready-made by Heroku. So no more manual DevOps work, and fewer variables to worry about.\n<\/p>\n<p>\n    The other motive was to learn quality Python 3. In python, you have a pythonic and many non-pythonic ways of doing things. There&#8217;s no point in writing Python like C. I wish to learn the philosophy of the language so that I can make the right choices when deciding how to solve a problem. There&#8217;s nothing like writing clean and elegant code that others can appreciate. In the last week, I also got exposed to a lot of different data structures that the python library provides for specific use cases. In the right scenario, using an appropriate data structure can be the best optimization you can do to your code. I am looking forward to getting a hold of this as well.\n<\/p>\n<p>\n    Lastly, one thing that I never thought I&#8217;d so, but I&#8217;m doing, is trying to learn object-oriented programming. I had done some OO python <a href=\"\/2014\/07\/object-oriented-programming-concepts.html\">in the past<\/a>, but it never clicked. Laster, with JS, it was all about functional programming. Now, I&#8217;ve rediscovered OO programming and wish to relearn it, apply it and try to make it click. I like the contrasts in both paradigms of programming, and it could not be better explained than <a href=\"https:\/\/stackoverflow.com\/a\/2079678\/3549785\">this StackOverflow answer<\/a>.\n<\/p>\n<ul>\n<li>\n            <b>Object-oriented languages<\/b> are good when you have a fixed set of operations on things, and as your code evolves, you primarily add new things. This can be accomplished by adding new classes which implement existing methods, and the existing classes are left alone.\n        <\/li>\n<li>\n            <b>Functional languages<\/b> are good when you have a fixed set of things, and as your code evolves, you primarily add new operations to existing things. This can be accomplished by adding new functions which compute with existing data types, and the existing functions are left alone.\n        <\/li>\n<\/ul>\n<p>\n    Overall, I feel I&#8217;m becoming a little (very little indeed) mature with programming. Instead of sticking to paradigms and trying to defend the one that <i>I&#8217;m<\/i> most comfortable, I&#8217;m trying to see why those paradigms exist and what problems are they helping me solve. And since python supports both object-oriented as well as functional programming, it will be fun to work on any such problems.\n<\/p>\n<p>\n    I would write some technical articles on the subject when I feel confident enough in the near future. Just wanted to give you an update on what&#8217;s happening on my front in this one. Hope you found it useful. I&#8217;ll leave you with an interesting video about &#8216;Duck typing and asking forgiveness, not permission&#8217; which is a design pattern in Python. Thank you for reading.\n<\/p>\n<div class=\"videoWrapper\">\n    <iframe loading=\"lazy\" width=\"560\" height=\"349\" src=\"https:\/\/www.youtube.com\/embed\/x3v9zMX1s4s\" frameborder=\"0\" allowfullscreen><\/iframe>\n<\/div>\n<style>\n.videoWrapper {\n\tposition: relative;\n\tpadding-bottom: 56.25%; \/* 16:9 *\/\n\tpadding-top: 25px;\n\theight: 0;\n}\n.videoWrapper iframe {\n\tposition: absolute;\n\ttop: 0;\n\tleft: 0;\n\twidth: 100%;\n\theight: 100%;\n}\n<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Context I distinctly remember how much I liked writing backends (well, I tried). I also remember thinking, I will never become a frontend engineer. Ever. Like many software developers in my circle, I hated writing CSS, and JS hadn&#8217;t clicked until then. And these were the days before I knew anything about automated deployments. Deployment, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[33,4],"class_list":["post-1069","post","type-post","status-publish","format-standard","hentry","tag-flask","tag-python"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1069","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1069"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1069\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1069"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1069"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1069"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}