{"id":1071,"date":"2018-07-05T22:00:00","date_gmt":"2018-07-05T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/07\/05\/eli5-message-authentication-code\/"},"modified":"2018-07-05T22:00:00","modified_gmt":"2018-07-05T22:00:00","slug":"eli5-message-authentication-code","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/07\/eli5-message-authentication-code.html","title":{"rendered":"ELI5 &#8211; Message Authentication Code"},"content":{"rendered":"<p>\n  You need some urgent cash to buy today&#8217;s lunch. You throw a paper chit at your colleague, &#8220;Hey, I need you to transfer 100 bucks in my account number 10022, urgent&#8221;. Eve, a bad actor in your office, intercepts the chit, changes the 10022 to 10033, which is her account number, and forwards it to your friend. Your friend, intending to help you, transfers the amount and you both get duped!\n<\/p>\n<h3>The Problem<\/h3>\n<p>\n\tThe above is not a overly rare event, far from it. Such attacks happen all the time on the internet, and the reason is the lack of (cryptographic) authenticity built into core internet protocols. We learned in <a href=\"\/2018\/07\/eli5-authenticated-encryption.html\">Authenticated Encryption<\/a> that <b>confidentiality alone doesn&#8217;t mean anything if the attacker can perform active attacks<\/b> on your communication channel (just like Eve could). We need something better. We need MACs.\n<\/p>\n<h3>Message Authentication Code<\/h3>\n<p>\n\tAs the name gives away, a MAC is an authentication code associated with a message which verifies the integrity of the message and, assuming that the key is only known to you and the message&#8217;s sender, its authenticity. Just like with encryption, you give a MAC algorithm a message and a key, and it gives you a tag. This tag is unique to your message and the key pair, and an attacker shouldn&#8217;t be able to forge a valid tag for any random message of his choice even if he&#8217;s given an infinite number of ciphertext-tag pairs to analyze.\n<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/mac-wiki.png\"\/><br \/>\n<small><i>From Wikipedia&#8217;s MAC page<\/i><\/small><\/p>\n<p>\n\tIn concept, a MAC is similar to a hash function, such that given an arbitrary sized input, you get a fixed-sized output (digest) and this can be reproduced (&#8216;verified&#8217;) on other machines as long as one can find the same hash function&#8217;s implementation. This is how your download manager ensures that the file it has downloaded from the internet is not broken, by calculating the hash digest and comparing it with the one the website claims. A MAC differs from a traditional hash function in that <b>along with a message input, it also takes a key<\/b> and as such, knowledge of the key as well as the underlying MAC algorithm is needed to verify (or create a new) a tag.\n<\/p>\n<p>\n\tIn fact, one of the most popular MAC algorithms is based on hash functions. The algorithm is called <a href=\"https:\/\/en.wikipedia.org\/wiki\/HMAC\">HMAC for Hash-based Message Authentication Code<\/a>. It works by hashing key material with the message while taking preventive measures for popular attacks on hash functions such as length extension attacks. Any reasonable hash function can be used for the purpose of MAC&#8217;ing, including SHA-1 and SHA-256, (MD5 isn&#8217;t recommended).\n<\/p>\n<p>\n\tEncryption of the underlying data is not a prerequisite for using MAC, and they can be used irrespective of whether the data being MAC&#8217;d needs confidentiality or not. Use MACs whenever data integrity is needed. One caveat to look out for; MAC algorithms by themselves do not prevent <a href=\"https:\/\/en.wikipedia.org\/wiki\/Replay_attack\">replay attacks<\/a>.\n<\/p>\n<p>\n\t<b>Aside on Replay attacks:<\/b> A replay attack may happen when, say, you owe Eve some money. You send a note with Eve for your bank saying, &#8220;Please give Eve Rs.100 from my account, Signed: Bob&#8221;. Now there&#8217;s nothing preventing Eve from being greedy and using that same note again some days later.  This is prevented in the real world by making cheques unique and one-time use only. Similarly, ciphertexts must embed information (such as packet number, timestamp, session counter etc) that will expire once received and not let Eve re-send it at a later time.\n<\/p>\n<p>\n  Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You need some urgent cash to buy today&#8217;s lunch. You throw a paper chit at your colleague, &#8220;Hey, I need you to transfer 100 bucks in my account number 10022, urgent&#8221;. Eve, a bad actor in your office, intercepts the chit, changes the 10022 to 10033, which is her account number, and forwards it to [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":486,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[7,6],"class_list":["post-1071","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-cryptography","tag-eli5"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1071","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1071"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1071\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/486"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1071"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}