{"id":1076,"date":"2018-06-10T22:00:00","date_gmt":"2018-06-10T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/06\/10\/advice-from-an-old-programmer-zed-shaw\/"},"modified":"2018-06-10T22:00:00","modified_gmt":"2018-06-10T22:00:00","slug":"advice-from-an-old-programmer-zed-shaw","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/06\/advice-from-an-old-programmer-zed-shaw.html","title":{"rendered":"Advice From An Old Programmer &#8211; Zed Shaw"},"content":{"rendered":"<p>\n  The first article on my site is about me <a href=\"https:\/\/www.nagekar.com\/2014\/07\/starting-with-python.html\">starting with Python<\/a>. That was four years ago and around that time I had read this book called &#8216;Learn Python The Hard Way&#8217;. I really, <i>really<\/i> liked it. It was amongst one of those earlier pieces of memories that I&#8217;d probably never forget for my entire life, similar to the kind of impact reading <a href=\"https:\/\/www.catb.org\/esr\/faqs\/hacker-howto.html\">The Hacker Manifesto<\/a> and <a href=\"https:\/\/www.catb.org\/esr\/faqs\/hacker-howto.html\">Sir Eric Raymond&#8217;s &#8216;How To Become A Hacker&#8217;<\/a> had on me.\n<\/p>\n<p>\n  I decided to give the <a href=\"https:\/\/learnpythonthehardway.org\/python3\/\">Python 3 edition of Learn Python The Hard Way<\/a> a read. The last section of the book is titled <b>&#8216;Advice from an old programmer&#8217;<\/b> and in that, Zed Shaw shares with us some of his zoomed-out thoughts on programming and the career one makes out of it. Although it is very subjective and very blunt, just like the rest of the book (and I really like the rawness in his writing), for me personally it refreshed the old memories associated with the book.\n<\/p>\n<p>\n  I had read this exact chapter in the previous edition, but this time it made so much more sense. And not just this chapter, but in the entire book, the subtle pieces of well targeted humor and strong opinions held by the author were something of a delight to read even if you didn&#8217;t believe in the exact same thing.\n<\/p>\n<p>\n  I&#8217;m copy pasting the section of that book that I think I&#8217;ll come back to read re-read again and again. I think many of you will appreciate it as well.\n<\/p>\n<blockquote>\n<h3>Advice From An Old Programmer<\/h3>\n<p>\n    You’ve finished this book and have decided to continue with programming. Maybe it will be a career for you, or maybe it will be a hobby. You’ll need some advice to make sure you continue on the right path and get the most enjoyment out of your newly chosen activity.\n  <\/p>\n<p>\n    I’ve been programming for a very long time. So long that it’s incredibly boring to me. At the time that I wrote this book, I knew about 20 programming languages and could learn new ones in about a day to a week depending on how weird they were. Eventually, though, this just became boring and couldn’t hold my interest anymore. This doesn’t mean I think programming <i>is<\/i> boring, or that <i>you<\/i> will think it’s boring, only that <i>I<\/i> find it uninteresting at this point in my journey.\n  <\/p>\n<p>\n    What I discovered after this journey of learning is that it’s not the languages that matter but what you do<br \/>\n    with them. Actually, I always knew that, but I’d get distracted by the languages and forget it periodically.<br \/>\n    Now I never forget it, and neither should you.\n  <\/p>\n<p>\n    Which programming language you learn and use doesn’t matter. Do <i>not<\/i> get sucked into the religion<br \/>\n    surrounding programming languages as that will only blind you to their true purpose of being your tool<br \/>\n    for doing interesting things.\n  <\/p>\n<p>\n    Programming as an intellectual activity is the <i>only<\/i> art form that allows you to create interactive art. You<br \/>\n    can create projects that other people can play with, and you can talk to them indirectly. No other art form<br \/>\n    is quite this interactive. Movies flow to the audience in one direction. Paintings do not move. Code goes<br \/>\n    both ways.\n  <\/p>\n<p>\n    Programming as a profession is only moderately interesting. It can be a good job, but you could make<br \/>\n    about the same money and be happier running a fast food joint. You’re much better off using code as<br \/>\n    your secret weapon in another profession.\n  <\/p>\n<p>\n    People who can code in the world of technology companies are a dime a dozen and get no respect.<br \/>\n    People who can code in biology, medicine, government, sociology, physics, history, and mathematics<br \/>\n    are respected and can do amazing things to advance those disciplines.\n  <\/p>\n<p>\n    Of course, all of this advice is pointless. If you liked learning to write software with this book, you should try<br \/>\n    to use it to improve your life any way you can. Go out and explore this weird, wonderful, new intellectual<br \/>\n    pursuit that barely anyone in the last 50 years has been able to explore. Might as well enjoy it while you<br \/>\n    can.\n  <\/p>\n<p>\n    Finally, I’ll say that learning to create software changes you and makes you different. Not better or<br \/>\n    worse, just different. You may find that people treat you harshly because you can create software, maybe<br \/>\n    using words like “nerd.” Maybe you’ll find that because you can dissect their logic they hate arguing<br \/>\n    with you. You may even find that simply knowing how a computer works makes you annoying and weird<br \/>\n    to them.\n  <\/p>\n<p>\n    To this I have just one piece of advice: they can go to hell. The world needs more weird people who know<br \/>\n    how things work and who love to figure it all out. When they treat you like this, just remember that this is<br \/>\n    your journey, not theirs. Being different is not a crime, and people who tell you it is are just jealous that<br \/>\n    you’ve picked up a skill they never in their wildest dreams could acquire.<br \/>\n    You can code.\n  <\/p>\n<p>\n    They cannot. That is pretty damn cool.\n  <\/p>\n<\/blockquote>\n<p>\n  Beautiful, isn&#8217;t it? Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The first article on my site is about me starting with Python. That was four years ago and around that time I had read this book called &#8216;Learn Python The Hard Way&#8217;. I really, really liked it. It was amongst one of those earlier pieces of memories that I&#8217;d probably never forget for my entire [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[16,4],"class_list":["post-1076","post","type-post","status-publish","format-standard","hentry","tag-programming","tag-python"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1076","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1076"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1076\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1076"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1076"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1076"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}