{"id":1084,"date":"2018-04-30T22:00:00","date_gmt":"2018-04-30T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/04\/30\/lenovo-thinkpad-t440-ebay-refurbished-laptop-review\/"},"modified":"2018-04-30T22:00:00","modified_gmt":"2018-04-30T22:00:00","slug":"lenovo-thinkpad-t440-ebay-refurbished-laptop-review","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/04\/lenovo-thinkpad-t440-ebay-refurbished-laptop-review.html","title":{"rendered":"Lenovo Thinkpad T440 &#8211; Ebay Refurbished Laptop Review"},"content":{"rendered":"<p>\n   <i>Refurbishment is the distribution of products usually electronics and electricals that have been previously returned to a manufacturer or vendor for various reasons. Refurbished products are normally tested for functionality and defects before they are sold. &#8211; Wikipedia<\/i>\n<\/p>\n<p>\n    I&#8217;ve not bought anything refurbished ever before, but then, I&#8217;d never needed to. It was after deciding to get myself a new laptop, given Misty&#8217;s faulty hinge, that I made a list of things to prioritize for in this upcoming purchase, and had to decide between a new machine and something used. That was when I learned refurbished was an option.\n<\/p>\n<h3>The Requirements<\/h3>\n<p>\n    My modest requirements for the new machine were a result of the learnings from my previous computer buying experience. After using Misty for about 30 months, I&#8217;ve learnt a few things about my own behavior regarding laptops, and I decided to make use of that experience while listing down my own requirements, in order of priority.<\/p>\n<ul>\n<li>Required: Sturdy built quality, something better than a flexing plastic body (Main problem with misty was the broken hinge that was plasticy)<\/li>\n<li>Required: 8GB RAM &#8211; anything more is overkill<\/li>\n<li>Required: SSD, SATA III or better, 128GB or more<\/li>\n<li>Required: i3, Good to have: i5, 4th gen or better<\/li>\n<li>Good to have: Total cost less than INR 25,000<\/li>\n<li>Dream: Something better than a TFT 1366&#215;768 display<\/li>\n<li>Dream: Backlight keyboard<\/li>\n<\/ul>\n<h3>The Search<\/h3>\n<p>\n    A quick search on Flipkart and Amazon made it clear that if I&#8217;m going to go for a new laptop, I&#8217;ll be paying at least INR 30,000 for something like a Dell or HP. Processor was the easiest to get, could squeeze in the 8GB ram part, SSD was out of sight for anything below 40k, and good quality display and backlight keyboard, I&#8217;m asking for a bit too much at the price point. That was that, and the search moved to Ebay, Olx and Quickr\n<\/p>\n<p>\n    Ebay was very welcoming for my requirements. There were a lot of sellers selling what they call &#8216;seller refurbished&#8217; laptops. Theses machines supposedly came from the big corporations which gave away their old laptops in bulk. My friends working for a few MNCs here made it clear that they weren&#8217;t bluffing. My friends said that their companies used these same laptops but newer models. That made sense.\n<\/p>\n<p>\n    Giving up on Olx and Quickr (most laptops looked quite old and still expensive, and it was difficult to differentiate the quality listings from the shit ones), I concentrated my search on Ebay, chatting with all the sellers that had good reviews and ratings. That helped me separate the big sellers from the ones with just a few laptops to sell. Shortlisting a couple of sellers (<a href=\"https:\/\/www.ebay.in\/usr\/infotechdivya?_trksid=p2047675.l2559\">Infotech Divya<\/a> and <a href=\"https:\/\/www.ebay.in\/usr\/rentopc?_trksid=p2047675.l2559\">Rent-O-PC<\/a> were both top rated sellers and good with communication and had laptops in my budget, recommended) and making sure they had multiple models and versions of a given laptop series, I asked the sellers about the condition of the machines, learned about a metric called &#8216;grade&#8217; of these laptops and that they were priced depending on the specs AND the grade, &#8216;A&#8217; being the best, almost new, to &#8216;C&#8217; with physical damage and major cracks.\n<\/p>\n<p>\n    Finally, talking to these sellers about my requirements also helped gather their opinion on what laptop was, in their opinion, the best for my needs. This process lasted for about a month (yes, I spent a good deal of time talking to these sellers, and then taking second opinions from my hardware nerd friends). The final list consisted of these following laptops with their major specs and approx price, all A grade.<\/p>\n<ol>\n<li>Lenovo T440 &#8211; i5, 8GB, 128GB, 14&#8243; TFT 768p &#8211; INR 24.5k<\/li>\n<li>Lenovo T440 &#8211; i5, 8GB, 256GB, 14&#8243; IPS HD+ Touch with backlight keyboard &#8211; INR 27.6k<\/li>\n<li>Lenovo X240 &#8211; i5, 8GB, 128GB, 12.5&#8243; TFT 768p with backlight keyboard &#8211; INR 23.5k<\/li>\n<li>HP Elitebook 820 &#8211; i7, 16GB, 512GB SSD, 14&#8243; Full HD Touch IPS with Backlight keyboard &#8211; INR 34.5k<\/li>\n<li>Lenovo X1 Carbon 2nd Gen &#8211; i7, 8GB, 240GB, 14&#8243; 1440p IPS touch with backlight keyboard &#8211; INR 33.5k<\/li>\n<\/ol>\n<p>    Except for the HP, all are 4th gen Intel Haswell processors. The HP is a 5th gen i7. Too good to be true at 34.5k, right? But that would&#8217;ve been the definition of overkill right there. Hence HP was out. X1 carbon was very close to my heart, but it being a proper 1.3kg Macbook Air like profiled ultrabook, I feared that I wouldn&#8217;t be able to afford the repairs, nor will I be able to find spares for it, plus at that price, I had stretched my budget by almost 8k. Hence I ditched it. I did consider the X240 strongly for its smaller profile, but then feared it would be a bit too small. Some 10 youtube videos later, I decided it was a bit too small for almost the same price, plus it wasn&#8217;t as much upgradable. Finally left with the two Thinkpad T440s. The cheaper one would&#8217;ve been fine, but the delta and the difference in the features (larger SSD, touch screen, HD display and backlight keyboard vs INR 3k saving) was too small.\n<\/p>\n<p>\n    All things considered, I ordered the T440 with a touchscreen.\n<\/p>\n<h3>The Laptop<\/h3>\n<ul>\n<li>i5 4th Gen, 1.9 Ghz with turbo boost upto 2.9 Ghz<\/li>\n<li>8GB DDR3 memory<\/li>\n<li>240GB SSD<\/li>\n<li>14&#8243; HD+ 1600&#215;900 IPS touch screen<\/li>\n<li>Backlight keyboard<\/li>\n<li>2 USB 3.0, VGA, mini Display, gigabit ethernet<\/li>\n<li>HD webcam, a weird trackpad that can be pressed and has nice multi finger gesture support, mini keyboard<\/li>\n<li>1.8 Kgs, around 2&#8243; thick<\/li>\n<\/ul>\n<style>\n.image-grid {\n    display: grid;\n    grid-template-columns: repeat(auto-fill, minmax(360px, 1fr));\n    grid-column-gap: 10px;\n    grid-row-gap: 10px;\n}\n<\/style>\n<div class=\"image-grid\">\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_172944.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_172944.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173204.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173204.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173342.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173342.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173343.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173343.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173406.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173406.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173518.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173518.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173615.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173615.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173707.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173707.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173748.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173748.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173926.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_173926.jpg\" \/><\/a><br \/>\n    <a href=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_174902.jpg\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/IMG_20180423_174902.jpg\" \/><\/a><\/p>\n<\/div>\n<p>\n    The laptop came two days after ordering in a properly packed box, much smaller than what I had expected, with Ebay branding and all that. Removing all the tape, inside there was my laptop in 3 layers of bubble wrap and an unwrapped Lenovo charger. The laptop looked flawless, not a single scratch or color fade. If it&#8217;d came out of a branded box, I wouldn&#8217;t have been able to tell it from brand new. It was that new. My excitements knew no bounds, for the build quality was nothing I had ever seen on a laptop. It felt hard and stiff, like a sheet of metal, better than the Macbook Air of my manager that I had always adored. It was amazing.\n<\/p>\n<p>\n    Upon opening it, I tried the keyboard. It was good. Nice key travel, click click sounds, nice touchpad and that red mouse-like functioning button. Overall, I was extremely happy with the initial impressions. I looked at the screen, and could see some decoloration, but decided to ignore it. Turned it on, there was a licensed Windows 8.1 or something (does it make a difference?). The touch was good, responsive, screen brightness was good and text was crisper than what I was used to, thanks to the bump in resolution from my previous laptop. Text felt a bit too small to my liking though.\n<\/p>\n<p>\n    Here&#8217;s a discovery. I had never planned on using the touch feature, and just got it as something that came for free with the other benefits. But to my surprise, I found myself surfing the web with the touch screen, clicking on links, scrolling, pinching and all those gestures that we&#8217;re used to doing on our phones. It was amazing. The laptop was snappy, quiet and overall near perfection.\n<\/p>\n<p>\n    I switched off the laptop, and again noticed the white tint (see image 9). What is it, I wondered. I connected the charger and that made things clear. It was some white light leaking from the LCD panel from the bottom that was causing the problem. My heart sank. This thing was almost perfect, almost. I whatsapp&#8217;d the seller who asked for a video of the problem. Upon submitting, he concluded that it was an actual issue, and gave me two options; 1. Ignore the issue and get a compensation for the damaged component, or 2. Get a replacement. I took replacement.\n<\/p>\n<p>\n    The replacement came 36 hours later in a similar but branding less box. There was 2 layers of bubble wrap and the laptop was in a similar but more worn condition. It was very identical to the first laptop but on a closer inspection, you could tell it was used (which, while obvious, wasn&#8217;t the case with the first laptop). I had my Arch linux usb stick ready, so I flashed the computer with Arch and XFCE but XFCE refused to work. I settled for GNOME and discovered that using GNOME was a much better, much pleasant experience with high res display and touch. Nice!\n<\/p>\n<p>\n    Everything after this point was a positive experience. I missed my full sized numeric keypad at times, but got used to this mini sized keyboard layout. And man, typing on this keyboard is an experience in itself. The webcam is HD, which I&#8217;m not sure if it will ever help but a good to have anyway. The backlight of the keyboard has brightness levels (I&#8217;m sorry if that&#8217;s a standard feature, just new to it) which is useful, and this laptop has two batteries, one external and one internal. Combined, they offer a usage time of around 6 hours (used laptops usually have less than half of the original battery life) which is adequate. Overall, if nothing else breaks in the next few days and there are no new issues, I&#8217;m extremely happy with this purchase, and would definitely opt for a refurbished laptop over a new one again.\n<\/p>\n<h3>Conclusion<\/h3>\n<p>\n    I planned to make this more than a laptop review. This was a refurbished laptop review, which for many of you, like it was for me, is a very new thing. It was something I was very scared of, after all, 27,000 is a lot of money for anyone, and giving it to someone who has just promised you things is a risk to say the least. I hope to have given you some clarity regarding refurbished electronics, at least laptops. I&#8217;ve read some quite scary (to the extent of misleading) posts on Reddit about how sellers con people. While I&#8217;m sure there must&#8217;ve been cases of that, it is important to do your research and use some common sense. A seller who&#8217;s listing seems too good to be true is probably a lie. A seller who takes 24 hours to reply to your messages about enquiries will probably not bother replying at all after selling you the thing. A seller with just 10 review, all 5 stars and robotic feedback messages is probably a scam. Yes, it takes time to find the right sellers and the right product, but it is much better than buying the wrong or defective product. Spend that additional week researching your needs, talking to sellers and formally stating your requirements. You&#8217;ll save yourself a lot of money and time in the long run.\n<\/p>\n<p>\n    If all this seems too daunting, or if you think your time is worth more than the time spent on this (which is what I&#8217;m expecting half of you to be wondering at this point) then prefer buying the product new. It is perfectly reasonable to make that tradeoff plus you get a real warranty, absolutely new product, a branded box and peace of mind. In a parallel universe where I would&#8217;ve had a lot of money, a new laptop is what I&#8217;d have bought. On this one, I think refurbished is just fine. Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Refurbishment is the distribution of products usually electronics and electricals that have been previously returned to a manufacturer or vendor for various reasons. Refurbished products are normally tested for functionality and defects before they are sold. &#8211; Wikipedia I&#8217;ve not bought anything refurbished ever before, but then, I&#8217;d never needed to. It was after deciding [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":520,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[3],"class_list":["post-1084","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-electronics"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1084","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1084"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1084\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/520"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1084"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1084"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1084"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}