{"id":1091,"date":"2018-02-24T23:00:00","date_gmt":"2018-02-24T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/02\/24\/home\/"},"modified":"2018-02-24T23:00:00","modified_gmt":"2018-02-24T23:00:00","slug":"home","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/02\/home.html","title":{"rendered":"Home"},"content":{"rendered":"<p>\n    I&#8217;ve not stayed away from home during college to experience the hostel life, so I never learnt what it was like to go back home after a long time, the <i>&#8216;ghar ja raha hu&#8217;<\/i> feeling. What makes one house our home and the other just a place we live in. Why do we get attached to some walls and a roof more than the others that we stay in. What makes some immaterial things more dear to us than others. I was randomly wondering about these little things in the past couple of weeks. Why?\n<\/p>\n<p>\n    Around 3 months ago, I moved away from home, to this new place. It eased my commute to work. But it was still just a place away from home where I was residing, paying rent in return, not really home. How does one turn such a shelter into something we call home? What makes a home? From my experience so far at this place, the memories are what gives everything a personal touch. Four walls and a roof don&#8217;t make a place home. The people visiting you, the moments lived in it, both good and bad, are what creates memories out of nothing. These memories get tied to these four walls. The way data gets tied to a unique entity via a foreign key, our memories get tied to a place, time, to people, to emotions. That&#8217;s why college is special. Not for what you gain there, but it is a place for many of our most memorable events.\n<\/p>\n<p>\n    I had my college friends come over yesterday. There was a lot of chaos as one would expect with a bunch of loud people packed into my little apartment. There were jokes, laughter, swearing, music, planning, silence and lots of other things that we associate with life. Similarly, I have my parents over today. My life becomes very comfortable when Mom and Dad come over as I get good food and snacks right in my hands all day long. Not something I&#8217;m very proud of, before you point it out.\n<\/p>\n<p>\n    Once you have regular visitors to your place, you try to keep it decently clean, organized and keep essential food handy. It isn&#8217;t just a place you reside any more, it is your home. You take care of it the same way you care for your real home. You wear a smile when you leave the house, you greet the neighbours and the security guard. Slowly, the brain starts to think of it as <i>that comfy place you go to after a tiring day, home.<\/i>\n<\/p>\n<p>\n    I miss my real home, but not as much as I would have if I had not accepted this as my second home. Mom asked me yesterday, &#8216;What will you do after the contract for this house expires?&#8217;, and I didn&#8217;t have an answer. Sometimes, things feel so permanent that we don&#8217;t think about being without them, and then suddenly, just at the thought of having to let something go, you realize the amount of love you have for it. That finally brings me to this thing of getting attached to non living things. <i>&#8216;How could you name your things?&#8217;<\/i> I get asked for personifying my laptop, my car and many other things that are dear to me. I haven&#8217;t got the slightest regret for my affection towards these &#8216;things&#8217;, after all, they&#8217;ve made me, just like the real people have.\n<\/p>\n<p>\n    Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I&#8217;ve not stayed away from home during college to experience the hostel life, so I never learnt what it was like to go back home after a long time, the &#8216;ghar ja raha hu&#8217; feeling. What makes one house our home and the other just a place we live in. Why do we get attached [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5],"class_list":["post-1091","post","type-post","status-publish","format-standard","hentry","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1091","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1091"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1091\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}