{"id":1093,"date":"2018-01-14T23:00:00","date_gmt":"2018-01-14T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2018\/01\/14\/jagriti-yatra\/"},"modified":"2018-01-14T23:00:00","modified_gmt":"2018-01-14T23:00:00","slug":"jagriti-yatra","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2018\/01\/jagriti-yatra.html","title":{"rendered":"Jagriti Yatra 2017"},"content":{"rendered":"<blockquote><p>\n    Jagriti Yatra is a 15-day long, national train journey that will take you 8000 kilometers across the length and breadth of India, to understand and build the India of smaller towns and villages through enterprise. &#8211; https:\/\/www.jagritiyatra.com\/about\n<\/p><\/blockquote>\n<p><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/z6DCiD3AW5U?rel=0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen><\/iframe><\/p>\n<p>\n    Jagriti means <i>awakening<\/i>, and Yatra means <i>journey<\/i>. This yatra has been the most tangent I&#8217;ve been in my life, the longest I&#8217;ve travelled in a train, the longest I&#8217;ve been away from keyboard since mom and dad bought me my first computer back when I was 16, the most diverse group of people I&#8217;ve met, the best conversations I had that were not about technology and an event that I&#8217;d not forget for the rest of my life.\n<\/p>\n<p>\n    This yatra is described by many as a spiritual experience, a starting place for a lifelong entrepreneurial journey, a place where you get exposed to the problems that exist in the country that you can solve with enterprise, a place to find your co-founders. That was true for many people around me, so it must apply to others as well. For me personally, jagriti yatra was simply a yatra, a journey through some remote parts of the country, getting out of the routine and doing something new, making new friends with no added motivations. That was all I had wished the yatra to be, and it turned out to be mostly true.\n<\/p>\n<p>\n    I cannot write about the entire Yatra. That would be too long and tedious (and very boring to read). Instead, I&#8217;ve chosen a few aspects of the Yatra that I felt were important to write about. These need not be things that I liked or disliked, just things that stayed on the back of my mind\n<\/p>\n<h3>Train<\/h3>\n<p>\n    The train was our home for 15 days. The boogies were divided into various parts; 2 for bathrooms, 4 for male and 4 for female participants, 2 for chair cars where we had group sessions\/talks, 2 were for staff and a pantry. Each participant boogie had 9 compartment, each compartment had 7 people forming a <b>cohort<\/b>. These 7 people were supposed to be from diverse backgrounds except for their vertical of interest (Education, healthcare, agriculture etc). Two such cohorts, one male and one female formed a group for discussions and presentations.\n<\/p>\n<p>\n    While theoretically we were supposed to be from diverse backgrounds, 6 out of the 7 members of my cohorts were engineers, 3 CS majors, 2 Civil and one mechanical. How&#8217;s that for some diversity? Although engineers that we were, we were quite diverse from individual interest perspective. That made things nice, for there were people who liked to doodle, someone who was into cryptocurrency, someone who worked with startups and mentored them, someone who worked with the government, someone who worked for school children and taught them practical science. From the inside, we were very diverse, with lots of stories that we could tell each other about our own professions and personalities.\n<\/p>\n<p>\n    The train was entirely branded with Jagriti Yatra posters, but not to the extent that it would grab eye-balls (it was still the same blue express train that you see running on tracks). Most of the times, people would mistake it for a regular train and bang on the locked doors and the guards would explain them that this is a special train. Except for the first day, the train reached on time at all our destinations, which is a nice feat for the railways, especially considering this to be a special train (read: low priority train).\n<\/p>\n<p>\n    Not that we didn&#8217;t have problems. A spring broke here, a bathroom boogie replacement there, toilets clogging up, no water for entire days and many such problems, but hey, this was part of the experience and most people took it in the spirit of the Yatra. The feeling was that if you cannot adjust to little things like these, then don&#8217;t even bother thinking about improving education and healthcare in rural India.\n<\/p>\n<h3>People<\/h3>\n<p>\n    Imagine being thrown in a room filled with 500 strangers for 15 days. It is uncomfortable to think, but then imagine that most of those 500 people are there to make new friends, to listen to your stories and share their own. That&#8217;s how the Yatra felt. Everyone was unassuming, open minded and honest. It was like everyone was given a mask to start afresh in a virtual society and they made good use of that chance by being all that they had learnt from their 20-25 years of experience dealing with people. It was great to see everyone being nice; honest yet at the same time caring and sensitive.\n<\/p>\n<p>\n    All of us opened up a lot during these 15 days. My personal goal was to talk to people with whom I don&#8217;t share a lot of opinions, and understand the same from their point of view. It was a good exercise, and in spite of all the differences that we had, when it was time for fun, we enjoyed together.\n<\/p>\n<p>\n    The staff was nice as well. It didn&#8217;t feel very commercial, and people seemed to do what they did because they loved it, and not for the paycheck (we were told that a huge chunk of the staff was working for free as volunteers). Even they were open to having random conversations, laughing together and guiding when needed. It all felt like a mobile family for those 15 days.\n<\/p>\n<h3>Food<\/h3>\n<p>\n    This was a surprise. Although the food was cooked in the train&#8217;s pantry, it was really very good. The food was served in nice white dishes, bowls with steel spoons. The food came in abundance, and honestly, I didn&#8217;t spend a single rupee on food for the entire 15 days on the train (except for when we wanted to try some local food out of enthusiasm), and all of the very little expenditure that happened was on the gifts that I bought for family.\n<\/p>\n<p>\n    To give you an idea about how much food and how many times it was served, here&#8217;s a quick timeline.<\/p>\n<ul>\n<li>Just after the wakeup call, around 6:30-7:30, tea\/coffee would come<\/li>\n<li>After some time, around 8:00-9:00 breakfast would be served, either on train or on the platform. Breakfast would include bread, butter, jam, namkeens and a unique dish everyday like upma, sheera, poha, uttappa, idli etc, tea and coffee.<\/li>\n<li>Lunch time was around 13:00-14:00, either at the role model place (the place that we were visiting on that particular day) or on train, and it used to be a proper mean with roti\/puri, bhaji, salad, rice, dal\/kadhi, pickle, papad, a sweet dish etc.<\/li>\n<li>Snacks used to be served anytime between 16:30-19, and it used to typically include things like chivda, namkeens, gathiyas, kachoris, samosa and tea\/coffee.<\/li>\n<li>Dinner time used to be around 21:00-23:00, and it used to be similar to the lunch.<\/li>\n<li>haldi milk used to be served after dinner, post 23:00, and it used to come along with warm water (almost all of us were suffering from cold and cough).<\/li>\n<\/ul>\n<p>\n    I honestly believe this was the best food I&#8217;ll ever have on an Indian express train. It was tasty, served warm and had dry fruits in it. Damn.\n<\/p>\n<h3>Formal Activities &#8211; BGT &amp; Role Model Presentation<\/h3>\n<p>\n    It wasn&#8217;t just a joy ride around the country (although I would&#8217;ve liked it even then). Right from day 1, we were made to think towards establishing a virtual enterprise in the rural India that would solve a problem in the domain of our choosing. This was the BGT (Biz Gyaan Tree) exercise. Although it didn&#8217;t help us form a nice startup or establish an idea that would win the first prize, it did help the team to come close, become good friends and have some great moments amongst ourselves.\n<\/p>\n<p>\n    The second was a role model presentation (role model is a name of the person\/organization at the location we visit; for example, in Delhi we visited Goonj (Goonj.org). So Goonj was the role model in Delhi). We had to present about the role model that we were assigned in a creative way. That involved some team work, creative thinking, drawing and paining on the chart papers and some public speaking. Like BGT, we didn&#8217;t do it to win, but used it as an opportunity to spend more time with group members.\n<\/p>\n<p>\n    At the time, one wishes all of this was optional, but then one must remember that the premise of this yatra was building India through enterprise. So that was that, and in hindsight, it was all fun.\n<\/p>\n<h3>Locations and Role Models<\/h3>\n<p>\n    The role models visits were the essence of the Yatra. Remove that and the yatra is literally just a group tour around the country. Role models were either people or organizations who did something substantial in the social sector, provided employment, did charity or anything that helps build the nation. Here&#8217;s a list of locations and their corresponding role models for this year.<\/p>\n<ul>\n<li>Mumbai [Maharashtra] &#8211; Dabbawala<\/li>\n<li>Kanyakumari [Tamil Nadu] &#8211; Vivekanand Memorial<\/li>\n<li>Madurai [Tamil Nadu] &#8211; Arvind Eye Care Hospital<\/li>\n<li>Banglore [Karnataka] &#8211; IISc and Jagriti Enterprise Mela<\/li>\n<li>Sri City [Andra Pradesh] &#8211; Industrial zone<\/li>\n<li>Vizag [Andra Pradesh] &#8211; Akshaypatra Foundation<\/li>\n<li>Ganjam [Orissa] &#8211; Gram Vikas<\/li>\n<li>Nalanda [Bihar] &#8211; Nalanda University<\/li>\n<li>Deoria [Uttar Pradesh] &#8211; Biz Gyaan Tree exercise<\/li>\n<li>Delhi [Delhi] &#8211; Rashtrapati Bhavan and Goonj<\/li>\n<li>Tilonia [Rajasthan] &#8211; Barefoot College<\/li>\n<li>Ahmedabad [Gujrat] &#8211; Sabarmati Ashram<\/li>\n<\/ul>\n<p>    Pretty interesting list, right? Now that I get to reflect upon it, it was a long journey, but on the train it felt like a few days. The joy was similar to that of going back to school.\n<\/p>\n<p>\n    To be honest, I was excited for only a couple of those as I didn&#8217;t even know what most of the organizations did or where they were located geographically. But once you visit them, they get imprinted on the back of your minds. And all of them had a unique way of working and sustaining which was worth noting. The common denominator was that they weren&#8217;t profit first organizations, rather they were all people first. I believe that was the reason that they were on this list. They weren&#8217;t all NGOs. The change makers are bringing a change whilst generating good revenue, which is encouraging.\n<\/p>\n<h3>Personal Learnings<\/h3>\n<p>\n    And finally we&#8217;re down to what really matters: What did I learn from the Yatra.\n<\/p>\n<p>\n    On the first day at Mumbai, I was really surprised to find so many nice people around. I became friends with around 15 odd people even before getting on the train. None of them were from my cohort. When I met the people of my cohort, I was a little dejected. They weren&#8217;t like the people I&#8217;d met the entire day. They were silent, spoke little and the atmosphere wasn&#8217;t exactly friendly. The facilitator sounded like a serious person. I tried to keep an open mind and reminded myself that this is the kind of adjusting exercise that I was looking forward to. Like it or hate it, this was my everything for the next 15 days.\n<\/p>\n<p>\n    I wont get into what happened in between, but by the latter half of the journey, that cohort turned out to be very nice, very different from what I&#8217;d envisioned on the first day; honest, caring and friendly. Each one of them had a story, they had something that made them tick, they had dreams and they were in many ways just like me. I remember the last day on train, I was happy that I was returning back to my comfy home, but in many ways I was sad to let these people go. The kind of bonding you develop when you&#8217;re &#8216;struggling&#8217; together is very different from the other kinds of bonding. I learned that if you try and keep an open mind, you can adjust with just about everyone and understand them. That people are very different from what they appear on the surface and you can never tell about the book by its cover.\n<\/p>\n<p>\n    Another key learning has been that you cannot solve a problem without knowing the problem itself. It seems obvious when I put it up that way, but how many of us just get our daily &#8216;national problem report&#8217; from the mainstream news and think about the things that need to be done to solve those problems and wonder why no one is doing it? Almost all of us. But the problems don&#8217;t become clear until one moves to their origin. I heard and spoke to numerous people who left their comfortable city life at the peak of their careers and settled in villages. These people asked the villagers what their problems were and what the solution to those problems were. Often, the person facing the problem knows the solution to it as well, but isn&#8217;t in a position to implement it.\n<\/p>\n<p>\n    I learned that it is very easy to sit in a restaurant and talk about the magic bullet that will solve the problem of education in the country for 20 minutes and feel good about being a up-to-date citizen, but the people who&#8217;re actually trying to improve it never really stop thinking about it. It becomes their life, and it is a really unglamorous job, not something you do and land on the cover of TIME. We tend to get bored by a job in a couple of months and question ourselves, &#8216;Am I making a difference?&#8217; while these people have been working on the same thing for past four to five decades. The dedication is real, and I learned what the word passion towards your profession meant from these people.\n<\/p>\n<p>\n    That illiteracy doesn&#8217;t mean lack of knowledge and wisdom. I&#8217;ve heard it enough times during the yatra from numerous influential people that I&#8217;ll have to believe it. Often times, educated people are sent to villages to solve the problems there, only to end up not understanding the problem or implementing a wrong solution. Classic case of what happens with many government policies. This happens because we&#8217;re not used to listening to people who&#8217;re less educated than us. We try to give them our solution for their own problem. As Anshu Gupta, founder of Goonj.org exclaimed, <i>kya aukaad hai tumhari?<\/i>\n<\/p>\n<h3>In closing<\/h3>\n<p>\n    I think the yatra is a wonderful experience. I didn&#8217;t plan to learn a lot there, just make friends and have a good time, but I did learn. I learned what cannot be taught in textbooks and communicated via blog posts. And you can have equivalent experience if you go travel places, talk to villagers and spark a conversation with random people on the bus, but if that doesn&#8217;t sound like your strongest game, give this Yatra a try!\n<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/jagriti.png\"\/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jagriti Yatra is a 15-day long, national train journey that will take you 8000 kilometers across the length and breadth of India, to understand and build the India of smaller towns and villages through enterprise. &#8211; https:\/\/www.jagritiyatra.com\/about Jagriti means awakening, and Yatra means journey. This yatra has been the most tangent I&#8217;ve been in my [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":547,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5,13],"class_list":["post-1093","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-life","tag-travel"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1093","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1093"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1093\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/547"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1093"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1093"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1093"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}