{"id":1096,"date":"2017-11-18T23:00:00","date_gmt":"2017-11-18T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2017\/11\/18\/book-review-responsive-web-design-ethan-marcotte\/"},"modified":"2017-11-18T23:00:00","modified_gmt":"2017-11-18T23:00:00","slug":"book-review-responsive-web-design-ethan-marcotte","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2017\/11\/book-review-responsive-web-design-ethan-marcotte.html","title":{"rendered":"Book Review &#8211; Responsive Web Design By Ethan Marcotte"},"content":{"rendered":"<p>\n    It has been a while since my last book review post here. Not that I stopped reading, but I kinda stopped reading non-tech things lately, and hence, there were no new posts. But today, it hit me that I can (and should, given this is a personal diary) write about pretty much anything that I read and find interesting. So here it is, a book by Ethan Marcotte, which I first read about a year and a half ago and then re-read it before a month or so. Responsive web design wasn&#8217;t (and still isn&#8217;t) my piece of cake. Heck, web <i>design<\/i> was something totally alien to me in the first place.\n<\/p>\n<p>\n    The happy realization that being able to set up websites (read: wordpress\/joomla blogs on a nix server) doesn&#8217;t make one a web developer, much less a designer, came about two years ago, when Dhananjay, a college senior of mine, was contacted by one of his contacts who was looking for a frontend developer. The task was supposed to take <i>a couple of hours<\/i> at max. Knowing that I did things around the web, Dhananjay outsourced that opportunity to me.\n<\/p>\n<p>\n    That was one incident that still gives me chills, <a href=\"https:\/\/www.nagekar.com\/2015\/12\/The-October-Dance-With-Cool-Indians.html\">and I wrote a bit on that earlier<\/a>. Not only because I realized how horrible I was with frontend and design, but also because I didn&#8217;t have the slightest clue about deadlines, how to and how much to work, and how to deal with things that are out of my control. It was a design heavy page, and I had a depth first approach of dealing with things. The end result was that a few pieces took up 80% of my 5 days of work (<i>easily<\/i> worked for over 70 hours), and the end result was nothing short of a design disaster. That one incident has taught me a lot, especially about how real work happens.\n<\/p>\n<p>\n    I guess it was then when I had read Ethan&#8217;s book for the first time. I believe it wasn&#8217;t as much for learning as it was to put on some burnol on my bruised ego. But nevertheless, even then the book had given me much insights about what web designing actually is, and why it isn&#8217;t very different from what I had been doing all along, it just requires thinking in a different mindset.\n<\/p>\n<p>\n    Fast forward to June this year, I interviewed at a couple of places for the role of a web developer. I was expecting a role on the backend, maybe a nodejs or python based job, but instead, I got a job as a ReactJS engineer. Yeah, a frontend engineer. As difficult as it was for me to digest it, I had to accept the fact that I will be dealing with a lot of CSS now. I had to up my design game, or it was game over, and I seriously didn&#8217;t want to screw as bad as I did two year ago. My friend Kunal was kind enough to lend me his Head First HTML &amp; CSS book which I am currently reading. But apart from the raw knowledge, it was the mindset that I required immediately, the mindset of a frontend developer, and for that, I picked up Responsive Web Design once again.\n<\/p>\n<h3>Shall we start with the review, Plis?<\/h3>\n<p>\n    Sure. The author starts by talking about architecture, responsive architecture in particular, about artists and their canvases. Responsive architecture is all around us, from window panes that allow variable amounts of light depending upon the time of the day, to modern home equipments. The author then talks about the usual restrictions in print media, and how web designers are fighting hard to recreate those restrictions on our browsers. We do not have to do that. The canvas of a web designer is inherently responsive. It isn&#8217;t a flaw, it is a freedom.\n<\/p>\n<p>\n    The author makes sure that reading this book won&#8217;t feel like the usual wall-of-text-hitting-your-face-with-technical-jargon experience. The book feels like a spiritual exercise, as if web designing is an art waiting to be discovered by an engineer who always saw it like a soul dead practice of giving random attributes to random elements and praying to the Gods of DOM that it looks just decent enough to pass the QA. I was really immersed into the book as I was reading it, and hoping that it lasts forever, which it obviously didn&#8217;t. The book is not long, and is divided into three sections; <i>The responsive grid<\/i>, <i>Responsive images<\/i> and <i>Media queries<\/i>. After reading this book, you&#8217;ll look at hardcoded &#8216;px&#8217; values as if they were taboo in your (code) culture. The author shows how simple calculations can turn all the zombie pixel measurements into the more lively &#8217;em&#8217;s and &#8216;rem&#8217;s, which are, of course, responsive.\n<\/p>\n<p>\n    A good article that the author strongly recommends is a blog post that was written some 17 years ago from now, but still is as relevant today as it was then. The post is called <a href=\"https:\/\/alistapart.com\/article\/dao\">A Dao of Web Design<\/a>, and it falls into the must-reads category for me. To give you a taste of the article, read the following quote.<\/p>\n<blockquote><p>\n        The control which designers know in the print medium, and often desire in the web medium, is simply a function of the limitation of the printed page. We should embrace the fact that the web doesn’t have the same constraints, and design for this flexibility. But first, we must “accept the ebb and flow of things.“\n    <\/p><\/blockquote>\n<p>\n    Beautiful, isn&#8217;t it? Suddenly, web design isn&#8217;t something that you do when you&#8217;ve done everything you could do to avoid it in the first place. True, writing CSS by hand is time consuming, working and supporting multiple browsers and display sizes is stressful to say the least, and most of the time, you&#8217;re better off using a ready-made solution like Bootstrap or Semantic, but once in a while, it is good to think about web as your canvas and think of yourself as an artist trying to fill in beautiful colors into the canvas. Now whenever I think about the different ways in which my web application is supposed to look on different screens, I remind myself that it isn&#8217;t a &#8216;restriction&#8217; that the app needs to look <i>that<\/i> way on <i>that<\/i> screen. Rather, it is a freedom that the app can look the way it needs to look in order to be the most comfortable version of itself for that particular reader. Ever seen a person struggling with folding a newspaper on a busy bus stop, or a cautious women carrying a large piece of art in her arms, making sure she doesn&#8217;t bend it, yes, that is exactly what a restriction, a limitation looks like. Thankfully, our dearest web doesn&#8217;t have that one. Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It has been a while since my last book review post here. Not that I stopped reading, but I kinda stopped reading non-tech things lately, and hence, there were no new posts. But today, it hit me that I can (and should, given this is a personal diary) write about pretty much anything that I [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[15,14],"class_list":["post-1096","post","type-post","status-publish","format-standard","hentry","tag-books","tag-javascript"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1096","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1096"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1096\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1096"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1096"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1096"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}