{"id":1098,"date":"2017-10-07T22:00:00","date_gmt":"2017-10-07T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2017\/10\/07\/better-browsing\/"},"modified":"2017-10-07T22:00:00","modified_gmt":"2017-10-07T22:00:00","slug":"better-browsing","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2017\/10\/better-browsing.html","title":{"rendered":"Better Web Browsing"},"content":{"rendered":"<p>\n  My web browser is by far the most threat-exposed application that I use on my laptop and mobile phone. Not only does it have to trust web developers and run the scripts they wrote, which probably aren&#8217;t all that great with respect to user security and privacy, it also has to deal with literally thousands of ad networks and other third party scripts that are <em>specifically<\/em> designed to invade your privacy by tracking you online.\n<\/p>\n<p>\n  The people behind these nasty things are not crooks or cyber criminals working from a shady basement, but are very smart people, working for the top Internet companies and making themselves and their employers more money than what you and I can imagine in our humble minds.\n<\/p>\n<p>\n  Given that billions of dollars are at stake, you and me as common Internet users don&#8217;t have much of a say in this. They will track you, trade your data, make money while you enjoy their &#8216;free&#8217; services, and kick you out the moment you don&#8217;t comply with their policies or stop agreeing to their rules.\n<\/p>\n<p>\n  The only thing that we control is what data are we giving to these Internet giants. While not many people realize or even care about it, there are ways in which we can limit our data leaking to the Internet, and the first step in doing that is hardening your browser. This article is an attempt to cover a number of steps everyday Internet users can take to protect their identity online and improve their information security. I was inspired to take up this topic for writing after a detailed explanation on the same in <a href=\"https:\/\/www.udemy.com\/network-security-course\/\">Nathan House&#8217;s Network Security course on Udemy<\/a>. Do check it out.\n<\/p>\n<h3>Know thy browser<\/h3>\n<p>\n  Your browser is a very powerful piece of software. The level to which it can be fine tuned to serve you the content that you wish to see is huge. The <code><a href=\"about:config\">about:config<\/a><\/code> page has some very useful options for both privacy and security. While almost anybody might have a hard time configuring Firefox via the this menu, there&#8217;s a helpful website called <a href=\"https:\/\/ffprofile.com\">ffprofile.com<\/a> that does a great job at making sense of some of those options and exporting a <code>pref.js<\/code> file.\n<\/p>\n<p>\n  Make sure you read the options and select the ones that you need depending on your privacy and security needs. For example, I deselected the <i>disable auto updates<\/i> option because the privacy gain from doing it is minimal (for me), while the security trade-off is huge, potentially leaving me unarmed at times. If you, like me and most others, can&#8217;t go full Stallman-mode anytime soon, make sure you set up an alternate profile in Firefox (<code>firefox -no-remote -ProfileManager<\/code>) and set up non-secure browsing preferences there, selecting it via <code>firefox -no-remote -P username<\/code>, or using an addon. Learn more about Firefox profiling <a href=\"https:\/\/developer.mozilla.org\/en-US\/Firefox\/Multiple_profiles\">here<\/a>.\n<\/p>\n<p>\n  Apart from that, try to use a non-tracking search engine like <a href=\"https:\/\/duckduckgo.com\">DuckDuckGo<\/a>, <a href=\"https:\/\/startpage.com\/\">StartPage<\/a> etc, use incognito mode by default (in Preferences > Privacy and Security), and use history saving only when required and on trusted sites. Use HTTPS whenever possible (Check out <a href=\"https:\/\/www.eff.org\/https-everywhere\">EFF&#8217;s HTTPS Everywhere<\/a> addon). There are addons available to notify you of certificate change in HTTPS enabled sites (which can hint a MITM attack), but they are of little practical value as sites update their certificates all the time. There are a bunch of useful addons that will come bundled with ffprofile, but you can also download them manually from Mozilla&#8217;s addon store.\n<\/p>\n<p><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/addons.png\"\/><\/p>\n<h3>Disable 3rd party cookies<\/h3>\n<p>\n  3rd party cookies are used for tracking users on third party sites. It is usually harmless to disable them. What might not work after disabling them are your social like\/share buttons and commenting platforms like Disqus, but that&#8217;s what we want in many cases. You can also consider setting up delete all cookies when you close the Firefox window.\n<\/p>\n<h3>Use a VPN<\/h3>\n<p>\n  VPNs are not really part of browser hardening checklist, but they offer good privacy over any insecure network. A lot of middle men in your Internet packet&#8217;s journey can potentially know what sites you visit, especially on insecure HTTP connections. Even on HTTPS, your browser&#8217;s DNS lookup might give away some information about your browsing habits. On insecure HTTP website and a shared Wifi access point, you can assume at all times that the other users connected to that Wifi, the access point and the ISP can literally see each and every request that you make. VPN takes away this data leak by creating a virtual tunnel between your computer or mobile device and the VPN&#8217;s server. The connection is encrypted and hence sniffing cannot happen in between. All requests, even DNS can be (and should be) configured to use the VPN.\n<\/p>\n<p>\n  It is important to understand that sniffing can occur on the VPN&#8217;s end on an insecure connection, and hence you need to select a VPN provider with utmost care. Even after this, there&#8217;s a bit of trust involved when choosing a provider. Our best bet is to try to opt for a provider that maintains a zero knowledge service.\n<\/p>\n<h3>Use a password manager<\/h3>\n<p>\n  Although it is an extremely bad practice to write passwords down, another very common mistake we as Internet users do is reuse passwords on many sites (I&#8217;m guilty as well), which in some cases is worse than writing down passwords for each individual online account. We know that at least some of the sites store your password in plaintext, while a lot more use weak hashing algorithms. Since we can never be sure, always assume that the password you submit to any site can be accessed by an adversary, and used against you. If you&#8217;ve reused your email provider&#8217;s password on any other site, the website&#8217;s admins or any attacker who has\/gets access to the website&#8217;s database might be able to take over your email account and other services connected to that account. It is for this reason that using separate passwords become important.\n<\/p>\n<p><a href=\"https:\/\/www.xkcd.com\/792\/\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/password_reuse.png\"\/><\/a><\/p>\n<p>\n  However, as human beings, we have more important things to remember than random alphanumeric strings. This is where a password manager comes in. It takes away your responsibility of having to remember 15 different passwords by making you remember one master password. Sweet, huh? This might look like an extra point for failure, but in the broad scheme of things where an attacker might get one of your password and literally own your digital life, this is a much safer option. What&#8217;s more, the passwords are either never stored on the disk (generated on the fly based on the master password and website&#8217;s name) or stored in encrypted form on the disk (or in the cloud). On the downside, this also means that if you lose your master key, you lose all your accounts.\n<\/p>\n<h3>Use 2 factor authentication. Always.<\/h3>\n<p>\n  Whenever it is an option, use a second factor of authentication. It can be anything; a phone call, SMS, email, authenticator app (like <a href=\"https:\/\/freeotp.github.io\/\">freeOTP<\/a>) or whatever. The increased effort is totally worth it considering the alternative is to risk an asset, possibly an important one. Remember that defense in depth is an effective concept in security, both in the real and digital world, and we must make use of it wherever possible.\n<\/p>\n<h3>For the paranoids amongst us: Use a live operating system<\/h3>\n<p>\n  A live operating system does not store any data in between sessions. Every time you log into the system, it is like logging into a freshly installed operating system. Naturally, there&#8217;s not much tracking that can be done, and as nothing is ever written to the disk, this method offers best privacy if done properly.\n<\/p>\n<p>\n  Using applications in virtual machines also protect users against sandbox escape vulnerabilities. Since we&#8217;re here, check out <a href=\"https:\/\/tails.boum.org\/\">Tails<\/a> Linux, a gnu+linux distribution that is designed to be used live and offers great tools to aid privacy. Another great live operating system is <a href=\"https:\/\/www.whonix.org\/\">Whonix<\/a>, which comes in form of a &#8216;gateway&#8217; (connects to the tor network) and a &#8216;workstation&#8217; (connects to the gateway). Then depending on your hardware, <a href=\"https:\/\/www.qubes-os.org\/\">Qubes OS<\/a> might be a good choice, something that I look forward to trying when I have compatible hardware.\n<\/p>\n<p>\n  Lastly, remember what Bruce Schneier told us<\/p>\n<blockquote><p>&#8220;The question to ask when you look at security is not whether this makes us safer, but whether it&#8217;s worth the trade-off.&#8221;<\/p><\/blockquote>\n<p>\n  I&#8217;ll leave you with that TED talk here. Thank you for reading.\n<\/p>\n<div style=\"max-width:854px\">\n<div style=\"position:relative;height:0;padding-bottom:56.25%\"><iframe loading=\"lazy\" src=\"https:\/\/embed.ted.com\/talks\/lang\/en\/bruce_schneier\" width=\"854\" height=\"480\" style=\"position:absolute;left:0;top:0;width:100%;height:100%\" frameborder=\"0\" scrolling=\"no\" allowfullscreen><\/iframe><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>My web browser is by far the most threat-exposed application that I use on my laptop and mobile phone. Not only does it have to trust web developers and run the scripts they wrote, which probably aren&#8217;t all that great with respect to user security and privacy, it also has to deal with literally thousands [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":560,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[9,8],"class_list":["post-1098","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-browsers","tag-mozilla"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1098","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1098"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1098\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/560"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1098"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1098"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1098"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}