{"id":1104,"date":"2017-06-11T22:00:00","date_gmt":"2017-06-11T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2017\/06\/11\/guide-driving-on-indian-roads\/"},"modified":"2017-06-11T22:00:00","modified_gmt":"2017-06-11T22:00:00","slug":"guide-driving-on-indian-roads","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2017\/06\/guide-driving-on-indian-roads.html","title":{"rendered":"Guide To Driving On Indian roads"},"content":{"rendered":"<p>\n\tI&#8217;m a newbie at driving. In fact, I didn&#8217;t know how to drive until November 2016, when my dad got us <a href=\"https:\/\/www.nagekar.comhttps:\/\/www.nagekar.com\/assets\/images\/zacky.jpg\">Zacky<\/a>, a Tata Zest petrol sedan. In the last 6 months, I drove her around 7000 kms total, 2400 of which were in the last 10 days, during my <a href=\"\/2017\/05\/8-8th-engineer.html\">post engineering<\/a> vacation trip where we took Zacky to my native place, Karnataka.\n\t<\/p>\n<p>\t<img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/assets\/images\/zacky_trip.jpg\"\/><\/p>\n<p>\n\tSo I returned home yesterday, after driving the last 740-ish km stretch from Karwar > Ankola > Hubballi > Belagavi > Kolhapur > Satara > Pune > Panvel and joyful it was as was the entire journey.\n\t<\/p>\n<p>\n\tYesterday, while driving, I thought of writing a mini guide\/mythbuster on the practical aspects of driving on Indian roads, highways and mudways alike, from a rookie&#8217;s perspective and this is it. Needless to say, in case you have any suggestions or corrections, feel free to use the comments section below.\n\t<\/p>\n<p><h3>1. People will overtake you from left. And you do the same.<\/h3>\n<p>\tIf you are learning how to drive from the Internet, chances are, you might be tempted to follow this overtake-only-from-right rule. 3 minutes on any Indian highway are enough to tell you otherwise. Heavy vehicles will hog the rightmost lanes leaving you with no choice but to overtake from the left. Rest assured, after a while, it feels normal.\n\t<\/p>\n<p><h3>2. Speedlimit is like the Unicorn<\/h3>\n<p>\tEveryone knows about it but no one actually believes in it. Hence even if you follow the speedlimit, people will come honking from behind. Make sure you don&#8217;t overspeed beyond what you can control and slow down appropriately during night\/rains. Large vehicles\/SUVs\/tourist vehicles are usually not very considerate of other vehicles and their safety on the road (Stereotyping = probably. Personal observation = yes). Maintain safe distance and let them pass.\n\t<\/p>\n<p><h3>3. Horn is your best friend<\/h3>\n<p>\tDogs, cows, donkeys, people with ear phones on, people chatting on phones, people who are too cool to look before crossing the roads, people who are drunk are just some categories of obstacles you&#8217;ll encounter on roads. Honking, while not peaceful, might just prevent a mishap.\n\t<\/p>\n<p><h3>4. The vehicle in front of you <b>WILL<\/b> cut into your lane<\/h3>\n<p>\tThere&#8217;s no one in front. Just a pickup truck in the middle lane at some distance. No reason for it to switch lanes. You approach it from the right crusing at over 100kmph. Just 30 meters to go and it starts to slide into your lane. He doesn&#8217;t have a rear view mirror, so not even his fault, right? You hit the brakes hard and send everything in your car flying.<br \/>\n\t<br \/>\n\tDon&#8217;t let that happen. Honk. Blink. Do whatever it takes but make sure the person you&#8217;re about to pass realizes you&#8217;re coming.\n\t<\/p>\n<p><h3>5. Heavy vehicle drivers are the best and the worst people on roads<\/h3>\n<p>\tYou&#8217;ll be terrified by how rough these heavy vehicle drivers drive. A small touch by a bus is good enough to send you rolling down the ghat. Most don&#8217;t have proper indicators, tail lamps or even rear view mirrors. ST bus drivers rally on the roads. Patience? LOL.\n\t<\/p>\n<p>\n\tThose are one half. The other half of these heavy vehicles are driven by some of the best drivers you&#8217;ll see. They indicate every time. They will let you pass if possible, or warn you when not. And the most important trait. They&#8217;re patient. They would not cut into your lane at random. They&#8217;re proper drivers who understand what it is like to be at the receiving end of road rage.\n\t<\/p>\n<p><h3>6. Low beams?<\/h3>\n<p>\tI read that one should use low beam when driving slow and high beam when fast and when there&#8217;s no one in front of you or in the opposite lane. You might know that as well. Do people actually do that? Yes, half of them do. But the other half don&#8217;t resulting in times when you&#8217;re totally blinded by oncoming traffic. Literally. Try to blink to get their attention. Some might heed. Others might not. While there&#8217;s not much you can do about it, go slow, keep an eye on the lane boundaries and vehicles in front and behind you, so that you don&#8217;t bump into anybody.\n\t<\/p>\n<p><h3>7. Red means stop. Orange means slow down. Green means look and go.<\/h3>\n<p>\tJust because the signal shows green does not mean you can close your eyes and pass. Look out for that late guru trying to sneak out, rickshaw and taxi walas for whom signals don&#8217;t apply, ST buses and simply ignorant pedestrians. Whatever happens, do the right thing here. The car 20 meters behind you might remind you 10 seconds before the light turns green that you should start crawling, by continuously honking. Don&#8217;t get intimidated by it, and of course, don&#8217;t do it yourself.\n\t<\/p>\n<p><h3>8. Allow pedestrians to cross<\/h3>\n<p>\tIt is very easy to forget pedestrians when one is driving, not letting them pass over zebra crossings, dangerously cutting them in traffic etc. A little bump of your one plus tonne car is all it takes to seriously injure them. What&#8217;s more? To save a couple of seconds, you might actually cause a lot of harm to both people and machine, causing longer delay, unnecessary fights, even loss of life. Show patience to people on foot\/bicycles.\n\t<\/p>\n<p>\n\tAlso, several villages and towns (and their people) are notorious for being lawless and getting violent if you are involved in a mishap regardless of wrong doer. Your best policy is to drive cautiously in rural places.\n\t<\/p>\n<p><h3>9. Be extra careful on empty\/low traffic two way roads and blind corners<\/h3>\n<p>\tIt is possible that a heavy vehicle just down the curve is merrily driving in between the road, overtaking another heavy vehicle or a joyous motorcyclist cornering at high speeds drifting in the wrong lane. Low traffic can retard your reaction time and it is very easy to misjudge the safe speed for a corner. A lot of these factors make blind corners an usual spot for unfortunate events. Have that on the back of your mind and slow down on unsuspecting blind corners.\n\t<\/p>\n<p><h3>10. Concrete vs Asphalt roads<\/h3>\n<p>\tOur highways are a mix of asphalt and concrete roads. The grip levels change a lot as you move from asphalt to concrete, so does the noise and your overall confidence in turns. Get used to of the concrete roads before going into a high speed corner as the tires are more likely to lose traction on concrete roads, especially in rains.\n\t<\/p>\n<p><h3>11. Check your tires and tire pressure before hitting the road<\/h3>\n<p>\tNo matter what you drive and how many safety check boxes your ride ticks. In the end, it is how the rubber mates with the road that makes the most difference. Unsurprisingly, mishaps involving tire burst are mostly due to worn out or under or over inflated tires. Make sure you check the recommended pressure for your particular tires (on driver side door panel) and check the pressure of each tire. It hardly takes 5 minutes, but can be the difference between a safe ride home and a blowout in the middle of the road, possible loss of control. Not to mention the better fuel economy you get by running on recommended pressure figures. The <a href=\"https:\/\/www.bridgestonetire.com\/tread-and-trend\/drivers-ed\/how-to-check-your-tire-tread-penny-test\">thread depth<\/a> is an important factor for safe grip levels in rainy driving conditions.\n\t<\/p>\n<p><h3>12. Most motorists are nice<\/h3>\n<p>\tJust another (arguable) subjective observation; most people on roads, just like you and me, are good people who simply want to get to their destination safely, without worries. Most are willing to help if they spot anybody in trouble. Most follow the traffic rules, drive safely and won&#8217;t even come to your notice. But it is for the few outlaws due to whom you have to assume everyone on the road is crazy. That way, you can keep yourself safe. Not only that, knowing that most people are good citizens, just like you, will make it easier for you to ask for help or even help someone in need on the roads.\n\t<\/p>\n<p><h3>13. Music is nice, but loud music can exhaust you faster and retard your reaction time<\/h3>\n<p>\tThe title says it all. It is <a href=\"https:\/\/www.google.co.in\/search?q=loud+music+reaction+time\">proven<\/a> that loud music retards your reaction time, which is critical when dealing with an emergency. At 120kmph, a delay of 1 second in reaction time can mean traveling 100 extra feet down the road, which can be the difference between stopping at a safe distance from an emergency and becoming part of one. Also, the calmer and quieter the music, the longer you can stay fresh and continue driving, as opposed to taking frequent brakes every 50 kilometers or so due to exhaustion of your mental resources.\n\t<\/p>\n<p><h3>14. Finally, in midst of all this, don&#8217;t forget to enjoy the journey<\/h3>\n<p>\tWhile crossing the ghats, it was raining heavily in some places. Once I even had to slow down to almost crawling speed due to the heavy rains and water saturating on the sides of the road. Although it was a pretty tensed situation, I think I was pretty lucky to have witnessed that cloudburst there, which made all vehicles turn on their hazard lights and look like fireflies on the streets, surrounding mountains covered with thick clouds and cool breeze all around.\n\t<\/p>\n<p>\n\tWhat I really want to say is, the roads will never be without surprises, but keep an open mind and you and your passengers will be greeted with the best vibes that mother nature has to offer. Safety first, but make sure not to miss out on the beautiful journey because of the few negatives. I have already fallen in love with the roads of India, and man! they&#8217;re addictive. Once you get the taste of long driving your beautiful ride through the various terrains this country has to offer, there&#8217;s no going back. Here&#8217;s our Zacky in all her glory.\n\t<\/p>\n<p>\t<img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/assets\/images\/zacky_side.jpg\"\/><\/p>\n<p>\n\t\tThat&#8217;s all for this little <i>guide<\/i>. Thank you for reading!\n\t<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I&#8217;m a newbie at driving. In fact, I didn&#8217;t know how to drive until November 2016, when my dad got us Zacky, a Tata Zest petrol sedan. In the last 6 months, I drove her around 7000 kms total, 2400 of which were in the last 10 days, during my post engineering vacation trip where [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5,13],"class_list":["post-1104","post","type-post","status-publish","format-standard","hentry","tag-life","tag-travel"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1104","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1104"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1104\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1104"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1104"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1104"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}