{"id":1105,"date":"2017-06-06T22:00:00","date_gmt":"2017-06-06T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2017\/06\/06\/book-review-siddhartha-hermann-hesse\/"},"modified":"2017-06-06T22:00:00","modified_gmt":"2017-06-06T22:00:00","slug":"book-review-siddhartha-hermann-hesse","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2017\/06\/book-review-siddhartha-hermann-hesse.html","title":{"rendered":"Book Review &#8211; Siddhartha By Hermann Hesse"},"content":{"rendered":"<p>\n\tA little late with May&#8217;s book review, but here it is. This month&#8217;s book was a little unconventional (for me), and the first of its kind that I&#8217;ve read. The book is called Siddhartha and it describes the spiritual quest of a young Brahmin boy named Siddhartha and his friend Govinda.\n<\/p>\n<p><b><br \/>\n\tIf you&#8217;re planning to read the novel to the fullest, stop reading here and pick that book up. The next section is my summary, for personal documentation purposes, and not recommended to the reader as it would spoil the flow for you.<br \/>\n<\/b><\/p>\n<p>\n\tThe book starts with Siddhartha and Govinda leaving their homes and families to seek the knowledge of Self, living their lives as &#8216;Samanas&#8217; and embracing asceticism. Both friends separate when Govinda wishes to join Buddha and his disciples as a monk, while Siddhartha differs and believes that true wisdom, unlike knowledge, cannot be communicated by one person to another. Thus, Siddhartha parts ways, crosses a river with the help of a Ferryman and reaches the town, where the author describes his life with &#8216;Kamala&#8217; as an ordinary person, amidst wealth, pleasures of life and &#8216;Sansara&#8217;. He soon realizes that this is not what he would wanted, and leaves it all only to end by the side of the same river he had crossed earlier, on the verge of committing suicide.\n<\/p>\n<p>\n\tBut then, just as he wakes up from an enlightening dream, he meets his friend Govinda again, who is surprised to find Siddhartha in rich cloths and nice shoes. Siddhartha decides to approach the ferryman and work with him for he wanted to learn from the river. He lives a modest life with the ferryman, who is a good friend and an excellent listener. Later he meets Kamala again, this time with &#8216;Little Siddhartha&#8217;, his son. Kamala, who&#8217;s bitten by a poisonous snake, dies in the Vasudeva&#8217;s (ferryman&#8217;s) hut. Siddhartha has a tough time with his son, who finally leaves him and runs away in the town, the same way Siddhartha had run away from his father when he was young. Siddhartha realizes the cycle in life, the river communicates extensively with him the wisdom that he had been seeking. Finally he is at peace. He tells everything to Govinda, who after realizing his friend has attained what he had always looked for, decides to leave Siddhartha and disappears in the forest.\n<\/p>\n<p>\n\tYears pass by and Siddhartha turns old. He meets Govinda one day, and they exchange their past stories. Govinda, who turned into a Buddha follower, is still searching, and Siddhartha tells him that Govinda would never find what he&#8217;s looking for as long as he&#8217;s searching for it with a goal in his mind, as opposed to finding that thing with an open mind. Govinda has a hard time understanding Siddhartha&#8217;s mind. He is asked by Siddhartha to kiss his forehead. Govinda, on doing so, learns what he was seeking all along. He then tearfully bows to Siddhartha, and leaves. Here the novel ends.\n<\/p>\n<p>\n\tThis was the first spiritual novel that I&#8217;ve read, and it had a lot of thought provoking text in it. The author does poetry in his way and it is a delight to read the chapters, visualizing the parts and &#8216;seeing&#8217; everything through Siddhartha&#8217;s eyes. If you are, like me, not much into fiction, give this book a try. The emotions it generates, the quest, the simplicity in the stories yet the depth in the message is simply amazing. Totally recommended.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A little late with May&#8217;s book review, but here it is. This month&#8217;s book was a little unconventional (for me), and the first of its kind that I&#8217;ve read. The book is called Siddhartha and it describes the spiritual quest of a young Brahmin boy named Siddhartha and his friend Govinda. If you&#8217;re planning to [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[15],"class_list":["post-1105","post","type-post","status-publish","format-standard","hentry","tag-books"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1105","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1105"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1105\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1105"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1105"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1105"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}