{"id":1108,"date":"2017-04-28T22:00:00","date_gmt":"2017-04-28T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2017\/04\/28\/book-review-the-third-wave-steve-case\/"},"modified":"2017-04-28T22:00:00","modified_gmt":"2017-04-28T22:00:00","slug":"book-review-the-third-wave-steve-case","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2017\/04\/book-review-the-third-wave-steve-case.html","title":{"rendered":"Book Review &#8211; The Third Wave By Steve Case"},"content":{"rendered":"<p>\n\tSo from the past month onwards, I and Abhishek had decided to read a (non technical) book every month and write a post about it at the end of the month. A good exercise to widen perspective and improve vocabulary.\n<\/p>\n<p>\n\tSo Steve Case is the then CEO of America Online, and a very successful entrepreneur. The book&#8217;s entire plot is based on dividing the Internet based industries into three major phases, or &#8220;waves&#8221;. There was the first wave, when people had started to realize the power of the Internet. In this wave, the task was to convince major players to take risk in the Internet to build infrastructure that would then be used to provide products and services to end users in a way unimaginable before. It was upon this infrastructure of hardware and software, of browsers and portals, or network providers and content providers, that the next wave of the Internet was to surf on.\n<\/p>\n<p>\n\tThe second wave was all about &#8220;Internet startups&#8221;. Companies that were Internet only. Some of the largest of them, like Uber and Airbnb, which disrupted their entire respective industry, didn&#8217;t own a single car or home, and companies like these became common. But just like the first wave, many industries started and only a few survived to see the light at the end. The second wave was about who came to the party first, and who perceived till the end. But, as one can tell, we&#8217;re on the flat region of the S curve of the second wave.\n<\/p>\n<p>\n\tThis is when the third wave comes into picture. A wave that is going to be much similar to the first than it will be to the second wav for a simple reason. The startups of the third wave would need partnerships with people and governments alike, to solve problems and build empires. Elon Musk is a great example of a third wave entrepreneur. More Musks will come into picture as we move more and more into the third wave. Author talks about the 3 P&#8217;s that would be critical for any third wave startup; Partnership, Policy and Perseverance.\n<\/p>\n<p>\n\tThe author talks about how, with the rise of third world startups, geographical concentration of companies in Silicon Valley would decrease with new entrepreneurial ecosystems budding where most economic and political benefits exist. He calls this &#8220;Rise of the rest&#8221;.\n<\/p>\n<p>\n\tFinally the author talks a bit more about America&#8217;s leadership in the tech industry and how it is losing it&#8217;s grip as the leading nation in terms of tech innovation due to a number of reasons, and how to solve those problems on the government as well as organizational level.\n<\/p>\n<p>\n\tFinally, I would highly recommend this book to anyone who&#8217;s interested in having a perspective on the future of the Internet industry. It comes from a person who has seen it all from the beginning, and everything in this book is a first hand experience and not those sugar coated motivational success stories that you can find on Youtube in about 15 seconds. The book has huge failures explained in ways that you find yourself in that time and see each decision in the making, and the rise and fall of the most valuable Internet company of it&#8217;s time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So from the past month onwards, I and Abhishek had decided to read a (non technical) book every month and write a post about it at the end of the month. A good exercise to widen perspective and improve vocabulary. So Steve Case is the then CEO of America Online, and a very successful entrepreneur. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[15],"class_list":["post-1108","post","type-post","status-publish","format-standard","hentry","tag-books"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1108","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1108"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1108\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1108"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1108"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1108"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}