{"id":1110,"date":"2017-01-08T23:00:00","date_gmt":"2017-01-08T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2017\/01\/08\/7th-sem-and-then\/"},"modified":"2017-01-08T23:00:00","modified_gmt":"2017-01-08T23:00:00","slug":"7th-sem-and-then","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2017\/01\/7th-sem-and-then.html","title":{"rendered":"7th Semester And Then"},"content":{"rendered":"<p><b>Important News!<\/b><\/p>\n<p>\n\tToday is probably one of the best days of my life. I got myself a new Internet connection and got rid of that old <a href=\"https:\/\/www.nagekar.com\/2016\/12\/BSNL-3g-broadband-rant.html\">BSNL broadband<\/a>.\n<\/p>\n<p>\n\tThis one is from a private service provider called &#8216;Speednet&#8217;, and the connection is actually very <i>speedy<\/i>. I am getting a latency of &lt;10ms to most of my regularly visited sites (thank you, CDNs) which is nice, because BSNL used to do around 80-100. The transfer rates, which for me are more important than latency alone, hover around 20-25Mb\/s which is at least 30 times of what BSNL gave at 3 times of the price, with no connection drops. And of course, no FUP. So finally, my connectivity crises come to an end, at least for now.<br \/>\n\t<center><a href=\"https:\/\/beta.speedtest.net\/result\/5950264247\"><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/5950264247.png\"\/><\/a><\/center>\n<\/p>\n<hr\/>\n<p>\n\tLet&#8217;s get back to the topic. A very happy new year to all of you. 2016 was a great year. It made us smarter than what we were before, and hopefully 2017 would do the same. I remember updating the status <i>&#8216;1\/8th engineer already&#8217;<\/i> sometime three years back. Well today, I&#8217;m 7\/8th an engineer. If I clear all the subjects, of course.\n<\/p>\n<p>\n\tThis semester was less busy. I think too much work is bad for oneself, because in my case, it made me do nothing. That is the most important thing I&#8217;ve learnt this semester. You cannot focus on 3 different things at a time, and expect your brain to switch contexts the moment you switch for Webstorm to Pycharm. Series always works better than Parallel for the mind, and although I had read it before, I got a first hand experience of the line. The takeaway here is, keep in mind there is a fine line between pushing your limits and overburdening yourself, where one brings out the best in you, the other takes away everything. Thanks, Dj.\n<\/p>\n<p>\n\tI have also decided to travel more. The trip to Delhi and Agra made one thing really clear, traveling does make one rich. It adds to the one&#8217;s experience store and the benefits are not something you can completely describe in text. It is a feeling. The other thing is meeting new people and talking to them. Different people can give you different perspectives to a thing, and you can use it all the time to challenge your own beliefs. Expressing yourself is great, and the regrets that arise from it are far less troubling than those you get by not doing it. Definitely an important lesson I&#8217;ve learnt in 2016.\n<\/p>\n<p>\n\tAlso, this pretty girl became part of the family in October. We call her &#8216;Zacky&#8217; and I&#8217;ll write about her in detail in another post.<br \/>\n\t<center><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/assets\/images\/zacky.jpg\"><\/center>\n<\/p>\n<p>\n\tSo 2016 was filled with learnings, but of a different kind for nerds such as myself. I think this has come with age plus the amazing people I have around me. I hope you liked this post. As always, thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Important News! Today is probably one of the best days of my life. I got myself a new Internet connection and got rid of that old BSNL broadband. This one is from a private service provider called &#8216;Speednet&#8217;, and the connection is actually very speedy. I am getting a latency of &lt;10ms to most of [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":763,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5],"class_list":["post-1110","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1110","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1110"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1110\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/763"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1110"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1110"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1110"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}