{"id":1112,"date":"2016-11-19T23:00:00","date_gmt":"2016-11-19T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2016\/11\/19\/a-visit-to-the-taj-mahal\/"},"modified":"2016-11-19T23:00:00","modified_gmt":"2016-11-19T23:00:00","slug":"a-visit-to-the-taj-mahal","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2016\/11\/a-visit-to-the-taj-mahal.html","title":{"rendered":"A Visit To The Taj Mahal"},"content":{"rendered":"<p>\n\t<img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/assets\/images\/tajmahal.jpg\" alt=\"Taj Mahal\">\n<\/p>\n<p>\n\tSo in the last week of July, 23rd, on a Saturday, I was wondering what should be done tomorrow, Sunday that is. It was going to be my last weekend in Delhi, and I wanted to make it memorable. I had the option to spend the evening with my colleague, but I also had the option to visit Taj Mahal. I had always admired Taj Mahal, I mean, who doesn&#8217;t. This was my chance to visit it. It somehow felt like I&#8217;ve earned it.\n<\/p>\n<p>\n\tAnd visiting Taj Mahal was not just important because I really wanted to see it, but because I was scared to go all alone to Agra to see it. I was really scared to go there, and the entire Saturday afternoon I was thinking, Taj Mahal can be visited anytime, let me just spend some time with my colleagues, for they might not be there always. But deep within, I knew that the only reason I didn&#8217;t want to go was because I was scared. I was scared of going all alone to Agra, a foreign city which I knew nothing more than the name itself. <i>Let&#8217;s see. If I manage to wake up early, I&#8217;ll think of going<\/i> I said, and slept.\n<\/p>\n<p style=\"text-align:center;\">\n\tSunday, 24th July, here is a page from my diary.<br \/>\n\t<i style=\"color: olive\"><br \/>\n\t\tWoke up at 6. Plan was to go to Taj Mahal but knew nothing above it, how to go, where to take train (from). Nothing.<br \/>\n\t\tThought &#8216;let&#8217;s go to sleep, will call Sukhpreet and make a plan later. Taj Mahal can be visited anytime.&#8217; But something kept telling me this opportunity won&#8217;t knock twice, and years later, you&#8217;ll remember this decision. Or you won&#8217;t.<br \/>\n\t\tAnyway, got ready, (had) bread sandwiches (the cheese ones) and got going. Took metro to Rajiv Chawk and then changed to blue line for Indraprasta. Rickshaw to H. Nizamuddin station and then Mangala express.<br \/>\n\t\tRight now sitting in the sleeper boogie with general ticket with earphones in my ears and writing this piece.<br \/>\n\t\tAll of a sudden, I feel so courageous, so different. This day is going to be awesome, I can already feel it.<br \/>\n\t<\/i><br \/>\n\t<center><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/assets\/images\/tajmahal2.jpg\" width=\"50%\" height=\"auto\" align=\"middle\"><br \/>\n\t<i>Awkward selfie.<\/i><\/center>\n<\/p>\n<p>\n\tBy the way, I randomly saw the train standing on the platform ready for departure. I went and sat in a reserved coach with IInd class tickets.\n<\/p>\n<p>\n\tAnd you can bet it was an awesome day. A great weather in Agra welcomed me, and quickly got along with a great person there. He was the rickshaw driver, whom I paid Rs. 500 for a day&#8217;s rent which included <b><\/p>\n<p>Station -> Hotel (for lunch)<br \/>Hotel -> Taj Mahal<br \/>Taj Mahal -> Agra Fort<br \/>Agra Fort -> Shopping center<br \/>Shopping center -> local Hanuman temple<br \/>Temple -> another-shopping place<br \/>Shopping place -> Agra station<\/p>\n<p><\/b>Amazing. Bought a Saree for mom, which was handmade with bamboo threads by the prison workers! Also some <i>petha<\/i>.\n<\/p>\n<p>\n\tOn my way back, did the same thing. Went and sat in the first train I could spot going towards Delhi; in the reserved compartment; with a second class ticket. But not so lucky this time. The TC fined me with Rs. 300, but also gave me the seat, so I guess it went okay. Reached my flat by around 9:30.\n<\/p>\n<p>\n\tAll in all, a great one day trip. I feel it isn&#8217;t necessary to describe Taj Mahal here, but the experience, the people and the difference of cultures was just amazing. That day, I was so proud of myself, can&#8217;t describe it here. Closing this essay with a quote I read somewhere and only believed on that day, <i>Working makes you money, but traveling makes you rich<\/i>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So in the last week of July, 23rd, on a Saturday, I was wondering what should be done tomorrow, Sunday that is. It was going to be my last weekend in Delhi, and I wanted to make it memorable. I had the option to spend the evening with my colleague, but I also had the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5,13],"class_list":["post-1112","post","type-post","status-publish","format-standard","hentry","tag-life","tag-travel"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1112","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1112"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1112\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1112"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1112"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1112"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}