{"id":1150,"date":"2015-06-03T22:00:00","date_gmt":"2015-06-03T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2015\/06\/03\/a-day-of-struggle-with-python-ides\/"},"modified":"2015-06-03T22:00:00","modified_gmt":"2015-06-03T22:00:00","slug":"a-day-of-struggle-with-python-ides","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2015\/06\/a-day-of-struggle-with-python-ides.html","title":{"rendered":"A Day Of Struggle With Python IDEs"},"content":{"rendered":"<p>\n  Yesterday, I gave up on doing my next web application project with QT. I knew C++ was never meant to be a language of the web, but I really had some hopes with QT. It actually is good, and apparently it would have ran faster than any other platform or language for the web. The problem is, it is a lot time consuming to develop anything in it, especially web apps. I really don&#8217;t have all that time. So I decided to do it in Python or Ruby. After reading some articles, it became clear, they are not much different, where python is a more general programming language, ruby is more towards the web, with it&#8217;s rails framework.\n<\/p>\n<p>\n  I choose Python, just because I know how to write code in python, beforehand. It was time to go shopping for some good frameworks to develop this thing. No doubt, finally I had to decide between <a href=\"https:\/\/wakatime.com\/django-vs-flask-worksheet\" target=\"_blank\" rel=\"noopener\">Django and Flask<\/a>. I choose flask. It was damn too simple, or at least it seemed like that. I tried the simple hello.py script which displays <i>&#8220;hello world&#8221;<\/i> on the localhost port 5000.\n<\/p>\n<p>\n  I tried that in emacs, but immediately felt the need for an IDE in this foreign land. I looked in my &#8216;Downloads&#8217; folder, and luckily there was Aptana Studio 3 still sitting there. I used to have it installed when I was into PHP last year. Since then, it got removed and thrown into a corner. I installed it. I really loved Aptana back then, for it&#8217;s usability. But now, it started to act like a stubborn child, refusing to detect Flask. I googled and googled, but alas, no way. Many people seemed to be having the same problem, and the only solution I saw didn&#8217;t work.\n<\/p>\n<p>\n  Seeing no way, I uninstalled Aptana, and <a href=\"https:\/\/stackoverflow.com\/questions\/81584\/what-ide-to-use-for-python\" target=\"_blank\" rel=\"noopener\">googled for other good IDEs<\/a>. PyCharm was what most were recommending. I decided to give it a try. Turned out, it was a memory hogger. Both my CPUs were doing a constant 100% and other windows turned sluggish too. About half a tonne of RAM was what it was utilizing, with a single .py file open with 4 lines of text in it. No way, again. Removed it, and went to eat some food. Damn.\n<\/p>\n<p>\n  I was not ready to go to the sluggish Eclipse again, nor Netbeans for the same reason. Finally I settled for Komodo Edit, free lite version of the commercial Komodo IDE. It lacks many things that you will ask for in an IDE, and it is a little better than using bare emacs or vim. Still, for now, I am using it. Configured it to execute python script right inside the window following this tutorial, <a href=\"https:\/\/stackoverflow.com\/questions\/21686395\/how-to-run-the-first-python-program-in-komodo-edit-8-5\">https:\/\/stackoverflow.com\/questions\/21686395\/how-to-run-the-first-python-program-in-komodo-edit-8-5<\/a>\n<\/p>\n<p>Life&#8217;s good, but just hoping to learn flask for my next project as fast as I can.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Yesterday, I gave up on doing my next web application project with QT. I knew C++ was never meant to be a language of the web, but I really had some hopes with QT. It actually is good, and apparently it would have ran faster than any other platform or language for the web. The [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[17,4],"class_list":["post-1150","post","type-post","status-publish","format-standard","hentry","tag-c","tag-python"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1150","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1150"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1150\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1150"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1150"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1150"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}