{"id":1155,"date":"2015-04-12T22:00:00","date_gmt":"2015-04-12T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2015\/04\/12\/net-neutrality\/"},"modified":"2015-04-12T22:00:00","modified_gmt":"2015-04-12T22:00:00","slug":"net-neutrality","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2015\/04\/net-neutrality.html","title":{"rendered":"Net Neutrality"},"content":{"rendered":"<p>\n  Do you know, here in India, at most of the public places like temples, we have two separate queues. One for the ordinary folks, and the other one for the rich folks. Sometimes the rich folks are charged, sometimes they are just judged from the car they get down from and are treated likewise. On the other hand, the ordinary people are treated like cattles, pulled and pushed by the authority, because we are not really benefiting them much.\n<\/p>\n<p>\n  This is the reason I would almost always choose Internet over any other public institution, at least in India. I know that whatever my social status be, on the Internet, I am equal. I have just as much right to put forth by thoughts as any rich businessman or a politician. I know that I have got people behind me who would not tolerate anyone who curtails my rights on the Internet. Yes, Internet is my home, and I am Internet&#8217;s child.\n<\/p>\n<p>\n  But like always, there are people who cannot stand that the ordinary are getting this extra power. They want to bring all of this under control. They want to turn the Internet into their own playground where they will control the lines as in our temples, giving early and quick access to the one who pays extra and slow to the one who does not. They want to make sure only the ones who can pay get heard, and all the others are suppressed.\n<\/p>\n<h3>Net Neutrality<\/h3>\n<p>\n  You are out with your family, on a nice sunday picnic when on a toll booth, you are told that your Maruti car is no longer allowed on this flyover because Hyundai has paid the construction company to only allow their cars through the shortcut. What would be your reaction?\n<\/p>\n<p><img loading=\"lazy\" decoding=\"async\" border=\"0\" height=\"320\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/Black-Girl-Wat.jpg\" style=\"margin-left: auto; margin-right: auto;\" width=\"306\" \/><\/p>\n<blockquote class=\"tr_bq\"><p><a href=\"https:\/\/en.wikipedia.org\/wiki\/Tim_Berners-Lee\" target=\"_blank\">Tim Berners-Lee<\/a> (&#8216;Inventor&#8217; or the world wide web, or more technically, original implementer of the HTTP protocol) defines &#8216;Net Neutrality&#8217; as the principle that each packet of data should be treated equally, and no discrimination should be made based on economic motivations.<\/p><\/blockquote>\n<p>\n  The exact opposite is what some telecom companies in India are trying to do. It started with Airtel. All of a sudden, it struck Airtel that if websites and applications can make revenue by creating services like messaging (like Whatsapp and Facebook) and calling (like Skype and Viber) which in turn decrease the usage of Airtel&#8217;s own services of SMS and calling, it is their right to start charging these Internet services separately. They even got out with their VOIP pack that a customer had to subscribe in addition to the existing &#8216;base&#8217; data pack, to use this service. <a href=\"https:\/\/in.reuters.com\/article\/2014\/12\/29\/bharti-airtel-rates-idINKBN0K70A920141229\" target=\"_blank\">Eventually it was dropped<\/a> on account of the resistance.\n<\/p>\n<p>\n  Now this time, telecom companies have convinced <a href=\"https:\/\/www.trai.gov.in\/\" target=\"_blank\">TRAI<\/a> that they must be entitled with the authority to intercept the traffic, to decide what websites to let users access, and what not, and if yes, then at what speed. Ridiculous, right? Charging more for extra speed can be justified, but why on earth are those innocent data packets discriminated. TRAI has even released a consultation paper <a href=\"https:\/\/www.trai.gov.in\/Content\/ConDis\/10743_0.aspx\" target=\"_blank\">asking 20 questions here<\/a>. If you take a look, you would immediately see that the paper is made extra complicated to not make sense to you, yes you, the customer. The <a href=\"https:\/\/isocpp.org\/std\/the-standard\" target=\"_blank\">C++ standard<\/a> looks simpler. LOL.\n<\/p>\n<h3>So what does it change for you, for me?<\/h3>\n<p>\n  <i>As a customer<\/i>, it will change almost everything for us that has any connection with the Internet. Firstly, we will have to pay for the usual data plan we currently do. So far so good. Now, you can&#8217;t use any messenger services from this pack, so no Whatsapp, Facebook, WeChat and all. Similarly, no Internet calling services would work, like Skype and Viber. Well, they would work if you pay an extra Rs100 or so a month for the &#8216;Special-messenger-pack&#8217; and the &#8216;Special-VOIP-pack&#8217;. Now who the heck are these telecom companies to tell me how and what sites and services should I use.\n<\/p>\n<p>\n  Plus, it also gives the companies the power to control the speed of your connection on particular sites. For example, maybe Flipkart.com will load up instantly, but Amazon.in would take forever to load up just because Flipkart is affiliated with your service provider, and you are forced to buy from Flipkart. Disgusting, right?\n<\/p>\n<p>\n  So, if you don&#8217;t want to pay Rs250 for data, Rs50 for Whatsapp, Rs70 for Facebook and Rs80 for Youtube seperately, then you should instantly head to<\/p>\n<blockquote class=\"tr_bq\"><p><b><a href=\"https:\/\/www.savetheinternet.in\/\" target=\"_blank\">https:\/\/www.savetheinternet.in\/ <\/a><\/b><\/p><\/blockquote>\n<p>\n  and send an email to TRAI, which can be done with 2 clicks, yes literally.\n<\/p>\n<p>\n  <i>As a publisher<\/i>, you might own a startup or maybe a modest blog like the one you are reading this article on. Now, large sites and enterprises with deep pockets can just call up these telecom companies and be like &#8220;Make my site free on your network, I&#8217;ll pay you the incentive.&#8221; This will make all the traffic go on that particular site or use that particular service and not yours, which was equally good, or maybe better.\n<\/p>\n<p>\n  The Internet is the only place guys, where everyone is still equal. We need to keep it this way, otherwise, we would be helpless. We know exactly how strong our law is, and how well behaved our politicians are. We know exactly how seriously we are taken by the mainstream media and the police. We, Indians, are like puppets for the rich filthy and greedy companies that rule here. And now, they are trying to close the only open source of information for us. Don&#8217;t let that happen.\n<\/p>\n<p>\n  A humble request to all my fellow netizens. Log on to the site and send an email to TRAI. Educate your fellow netizens. Together we can stop this.\n<\/p>\n<blockquote class=\"tr_bq\"><p><b><a href=\"https:\/\/www.savetheinternet.in\/\" target=\"_blank\">https:\/\/www.savetheinternet.in\/<\/a><\/b><\/p><\/blockquote>\n<p class=\"tr_bq\"><b>For further reading, here is a short list.<\/b><\/p>\n<ul>\n<li><a href=\"https:\/\/www.netneutrality.in\/\">https:\/\/www.netneutrality.in\/<\/a> &#8211; More information and compilation of<br \/>\n    articles.\n  <\/li>\n<li><a href=\"https:\/\/www.facebook.com\/netneutralityin\">https:\/\/www.facebook.com\/netneutralityin<\/a> <a\n    href=\"https:\/\/twitter.com\/neutrality_in\">https:\/\/twitter.com\/neutrality_in<\/a> &#8211; Social handles to follow for latest<br \/>\n    updates.\n  <\/li>\n<\/ul>\n<ul>\n<li>Awesome video by All India Bakchod to put it simply &#8211; <a href=\"https:\/\/www.youtube.com\/watch?v=mfY1NKrzqi0\">https:\/\/www.youtube.com\/watch?v=mfY1NKrzqi0<\/a>\n  <\/li>\n<li><a href=\"https:\/\/www.reddit.com\/r\/india\/comments\/31lyxx\/table_of_companies_which_support_net_neutrality\/\"\n         target=\"_blank\">List of violators and supporters of net neutrality,<\/a> so the next time you have to choose<br \/>\n    between them, you know whose side to take and whose product to use.\n  <\/li>\n<li><a href=\"https:\/\/medium.com\/@chupchap\/india-s-net-neutrality-debate-explained-in-memes-3a8f6febaccf\"\n         target=\"_blank\">Post on Medium by NT Balanarayan<\/a> explaining the intensity of this situation with memes.\n  <\/li>\n<li><a href=\"https:\/\/www.trai.gov.in\/WriteReaddata\/ConsultationPaper\/Document\/OTT-CP-27032015.pdf\" target=\"_blank\">TRAI<br \/>\n    Consultation paper<\/a> hot-link (PDF)\n  <\/li>\n<li><a\n    href=\"https:\/\/www.change.org\/p\/telecom-regulatory-authority-of-india-call-to-protect-net-neutrality-in-india-and-block-airtel-other-telecoms-from-who-are-trying-to-break-it-for-personal-gains\"\n    target=\"_blank\">Petition on Change.org<\/a> &#8211; You should help here as well. The more you help, the better our<br \/>\n    chances.\n  <\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Do you know, here in India, at most of the public places like temples, we have two separate queues. One for the ordinary folks, and the other one for the rich folks. Sometimes the rich folks are charged, sometimes they are just judged from the car they get down from and are treated likewise. On [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":817,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5],"class_list":["post-1155","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1155","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1155"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1155\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/817"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1155"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1155"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1155"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}