{"id":1156,"date":"2015-04-09T22:00:00","date_gmt":"2015-04-09T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2015\/04\/09\/what-programming-isnt\/"},"modified":"2015-04-09T22:00:00","modified_gmt":"2015-04-09T22:00:00","slug":"what-programming-isnt","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2015\/04\/what-programming-isnt.html","title":{"rendered":"What programming isn&#8217;t"},"content":{"rendered":"<div dir=\"ltr\">There were days when I used to search the web for &#8216;<i>best programming languages<\/i>&#8216; and &#8216;<i>most popular programming languages<\/i>&#8216; in my free time. I was not able to decide myself what language to learn and invest my time upon, such that it would pay me back everything I put into it. This was really a hard task, given the fact that I have interest in a wide range of stuff related to computers, from algorithms to designing beautiful forms with CSS.<\/div>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">Given that I had no guidance from the people around me, since I had no one in my family from the technical field, and the college professors were not of much help either. Now that justifies my amateur-ish googling habits.<\/div>\n<div dir=\"ltr\">Leaving that aside, I have lately been asked a lot of times by my fellow mates, what is the &#8216;<i>best language<\/i>&#8216; to start with and what are the current &#8216;<i>hot languages<\/i>&#8216; in the market. To start with, there is no language that is &#8216;best&#8217; in every sense. If there was, why would anyone bother creating additional languages in the first place, right? Languages are written and implemented with certain goals in mind, which it should satisfies better than what was present before creating that language, that&#8217;s the whole point about it. So stop searching for the best language and start looking for your own needs.<\/div>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">Secondly, I don&#8217;t think anybody should care about the &#8216;hot languages&#8217; in the market, except for the tech magazines&#8217; journalists. Why? Because if you haven&#8217;t heard of it yet, then you probably don&#8217;t actually need it yet. It is much better to know a single language as a whole, than to learn 5 languages just for the sake of them being &#8216;hot&#8217;.<\/div>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">If you are new to programming, then most probably you are taught programming using some or the other language (most probably C++ or Python). What most fail to teach is that programming is not equal to learning a language. Programming is the mindset that you develop when you are solving problem for a wide range of sub-problems by writing a common solution to all. Most of the times it means looking for a pattern in the chaos of that problem. You don&#8217;t need to know a language for finding this pattern, do you? You have to realize this thing at the earliest.<\/div>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">Programming language that you choose is the tool you choose for the task you have in hand. Now, depending upon the task, some tool might be better than the others, and help you in doing the task quicker. You can think of an analogy here, like if you want to cut tree trunks, you can use saw blade or maybe even a kitchen knife. But the saw will get the job done much faster. However, any sane human won&#8217;t cut vegetables using a saw. The same goes for programming languages. Different tasks demand different languages, and each has its own pros and cons. But the languages won&#8217;t help a bit if you cannot figure out the problem itself in the first place.<\/div>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">I had start to program in C, jumped to Python because &#8216;Google used it&#8217;. Then I came to PHP because I read somewhere that PHP gets you a job quickly. I started with JS and Node.js later due to their growing popularity. I did a lot of mistakes when I started it all. I wish I knew it then, that instead of wasting my time on learning the syntax of languages to do the exact same thing I did with the previous language, I could have been much better off learning some interesting algorithms that would&#8217;ve helped me in solving some tough hackathon problems.<\/div>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">So is the knowledge of language implementations not useful? Of course, I don&#8217;t mean that. A language is very useful once you know how to use it. You don&#8217;t have to know everything from a language. Just enough to get the problem solved. Nothing more. For example, you might have probably heard of C++. If you have ever tried to learn C++, you might have realized that it is a really large language. Originally designed for low level embedded programming and as a &#8216;C with Classes&#8217;, C++ has evolved to be a language that can be used in almost every domain. The &#8216;Standard Template Library&#8217; is large enough for you to not miss anything in most of the cases, and even if you do, there is <a href=\"https:\/\/www.boost.org\/\" target=\"_blank\" rel=\"noopener\"><i>boost<\/i><\/a> at your rescue. So do you think you most know all of the above to call yourself a C++ programmer? No. Many great programmers who use this language use just a subset of it and they are fine with it. I personally don&#8217;t use the object oriented facilities of the language much, but it doesn&#8217;t matter as long as it does what you want it to do. So don&#8217;t aim to know an entire language unless you want to get into compiler development or it&#8217;s standardization committee. Focus on the thing you are working on, and not the language you are using.<\/div>\n<div dir=\"ltr\"><\/div>\n<blockquote class=\"tr_bq\">\n<div dir=\"ltr\">Have the enthusiasm to solve problems. Take pride in building things from the scratch, all by yourself. The love for programming comes in automatically. But most important of all, learn how to program and not how to write syntax of a particular language.<\/div>\n<\/blockquote>\n<div dir=\"ltr\"><\/div>\n<div dir=\"ltr\">Thank you for reading.<\/div>\n","protected":false},"excerpt":{"rendered":"<p>There were days when I used to search the web for &#8216;best programming languages&#8216; and &#8216;most popular programming languages&#8216; in my free time. I was not able to decide myself what language to learn and invest my time upon, such that it would pay me back everything I put into it. This was really a [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[16],"class_list":["post-1156","post","type-post","status-publish","format-standard","hentry","tag-programming"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1156","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1156"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1156\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1156"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1156"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1156"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}