{"id":1157,"date":"2015-03-06T23:00:00","date_gmt":"2015-03-06T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2015\/03\/06\/engineering\/"},"modified":"2015-03-06T23:00:00","modified_gmt":"2015-03-06T23:00:00","slug":"engineering","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2015\/03\/engineering.html","title":{"rendered":"Engineering"},"content":{"rendered":"<p><i>Engineer<\/i>.<br \/>What comes to your mind when you hear that word? To me, the picture of a hard working individual, who is rational in his way of life, sees every aspect with the touch of technicality, given a job, he will do whatever it takes to get it done, selfless about his own personal pleasures, solving the problems of this world, one by one.<\/p>\n<p>Well, at least that is what comes to my mind. The reality is far from it. We have more <a href=\"https:\/\/dazeinfo.com\/2014\/10\/28\/1-5-million-engineering-pass-outs-india-every-year-fewer-getting-hired-trends\/\" target=\"_blank\" rel=\"noopener\">engineering colleges<\/a> here in India than we have good hospitals. Why? Because you cannot charge Rs.400k from each patient that visits your hospital the way you can from the students that study engineering course. In the particular state that I live in, engineering colleges are a part time income source of the politicians here. See the problem in India is, everybody wants to get rich, before the other one. Now there is nothing wrong with it as long as you don&#8217;t steal people from their rights.<\/p>\n<p>A student, passed out from junior college, is an empty vase eager to absorb knowledge. He is excited about his life ahead, his life in a professional institute where he will be taught the essentials to work in the industry for most of his life later. He has dreams, just like everyone. He has interests, and he tries very hard to get the stream of his choice. He had been working hard since the very day he got admitted in school for this particular moment.<\/p>\n<p>Finally the moment of truth arrives. He is admitted into a good college. He even gets the stream of his choice. There is no bounds to his happiness. His life is all set to rock, in a sense. Isn&#8217;t it? His parents pay their hard earned money to the college, thinking that it will benefit their child to become a better man, an &#8216;educated&#8217; person, a responsible citizen. Now the student&#8217;s joy know no bounds. He is excited as a child is on his first visit to an amusement park. The can&#8217;t sleep the day before his first day at college. Its time.<\/p>\n<p>On the first day of college, he wakes up early. Gets ready and dashes his way to the college. He has 4-5 blank books in his bag, to make notes on what the professor teaches. He trips on the way multiple times due to excitement. On reaching the college, he takes the first bench in the class. &#8220;I would be able to pay more attention from here&#8221;, he whispers. The professor enters the classroom with a set of papers and a fat reference book. He speaks out his name, rather lifelessly, and gives a very brief intro on the topic he would be teaching that semester. The intro was rather too short.&#8221;This is it? Why doesn&#8217;t he speak more on it.&#8221; whispers the student. He was enjoying it. But the professor must hurry, a vast syllabus is waiting to get done.<\/p>\n<p>The rest of the day goes similar. Nothing out of the ordinary. Nobody wants to talk anything out of the textbook. Probably it will waste a lot of time of the professor. Days pass by, and the only thing that changes is the number of books in the student&#8217;s bag. From 6 to 3 and then to one common rough book for all subjects. No, not because he was lazy to carry them all, but the pathetic quality of notes his teachers gave, he simply didn&#8217;t feel like they are worth of writing in separate books.<\/p>\n<p>After a few boring days with no activity, which he later realizes were the best days of the semester, the professor starts to give them assignments as homework. Not the kind of assignments where you can research and write on your own, but the <i>do-it-by-tomorrow-atleast-30-pages-or-get-a-C-grade <\/i>kind of assignments. Alas, there isn&#8217;t enough time to find the solutions. He gets readymade solutions from a friend who had copied it from another friend who might have got the solutions from previous year&#8217;s journal of a senior, and copies all the answers into his assignment.<\/p>\n<p>There is nothing in practicals too. Most of the time he is made to write journals so that he might submit them on time. So basically practicals are library hours where he gets to do nothing &#8216;practical&#8217; but copy from other&#8217;s journals so that at least he can get an A grade, which eventually by the end of the semester gets him 5 additional marks, at the cost of wasting the precious practical hours where he could have maybe learnt how that particular IC works.<\/p>\n<p>Days fly by quickly. Sitting for lectures where you don&#8217;t understand a word of what the professor says, but still have to, for attendance. Yes, the university enforces 75% compulsory attendance but fails to enforce benchmarks for the quality of lectures the professors give. Maybe enforcing the later will automatically make the attendance, not only 75% but also 90%, of most students.<\/p>\n<p>Failing to comply with the attendance policy of the college results the student not being able to attend his exams and parents getting called up to meet the professors in college. What happens when a professor comes to teach a topic he has hardly any idea of, gives the worst lecture you can possibly imagine with all bits of information flying around, and then leaves? Nothing happens. Even if you do complain about it, the replacement is as good as the old one, so most of the student don&#8217;t even bother to do that.<\/p>\n<p>Technical festivals. Yes, the thing our colleges are famous for. Technical festival, or tech fest as we call them, are something I personally waited for the entire semester. I could imagine all the amazing stuff that would be put to display, the workshops, the seminars and the enthusiasm. When it came, it was nothing as I had in my mind. It was all guys and girls hanging out enjoying their accidental holiday. It was foolish games like laser tag, devil_maze where people were made to run through dark corridors created with black curtains and UV lights. It was nothing technical, only games-which-can-attract-most-participants-and-earn-most-ticket-fees festival.<\/p>\n<p>This concludes with the semester exams, or finals. Here all we learn is the questioning pattern of the university so that we can quite accurately guess what is going to be there on the exam the next day and how am I going to fool the paper checker into believing that I know something about the topic, not much but something to earn me passing marks, after which I will spend 15 days doing nothing but hoping the next semester is better than this one.<\/p>\n<p>Finally, a student has covered 1\/8th of his life in the engineering course, spending a fortune as time and money, achieving nothing, and now the only thing differs is that he knows how the rest 7\/8ths of this life of his, which he highly anticipated, are going to be like. Welcome to the reality.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Engineer.What comes to your mind when you hear that word? To me, the picture of a hard working individual, who is rational in his way of life, sees every aspect with the touch of technicality, given a job, he will do whatever it takes to get it done, selfless about his own personal pleasures, solving [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[5],"class_list":["post-1157","post","type-post","status-publish","format-standard","hentry","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1157","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1157"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1157\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1157"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1157"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1157"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}