{"id":1162,"date":"2015-01-08T23:00:00","date_gmt":"2015-01-08T23:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2015\/01\/08\/jumping-over-multiple-programming\/"},"modified":"2015-01-08T23:00:00","modified_gmt":"2015-01-08T23:00:00","slug":"jumping-over-multiple-programming","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2015\/01\/jumping-over-multiple-programming.html","title":{"rendered":"Jumping over multiple programming languages"},"content":{"rendered":"<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">I just happened to take a look at my own blog. Starting with some posts about python, I went to C, then PHP-MySQL and then Javascript. All of this in around 3 months. Now, it is great to know multiple languages, but the thing I feel is, you must &#8216;know&#8217; them. Knowing in the sense, the underlying philosophy, best practices and such. I have started with at least 10 languages this year. I can code little bits in all of them, namely C, Java, Python, PHP, Javascript and some other like database, HTML\/CSS which are not-so-much-programming languages. Problem is, I cannot code fluently in any of the above listed languages. I just tend to get bored by doing a language after some time and then jump to something else. Something needs to be done, right?<\/p>\n<p>Actually, I didn&#8217;t notice this myself. Friends, with whom I hangout, told me that I needed to concentrate on one thing, until I master it, before moving to something else. I couldn&#8217;t agree more, but also couldn&#8217;t decide what needs to be done. So kept trying different things till I get something that would keep me distracted for long enough.<\/p>\n<p>I started with web development. I hate PHP, although I also tend to code in it the most because it is efficient for quick dirty works. Python happens to be one of my favorite languages, because of the neatness and power. But at the same time, coming from C, I don&#8217;t feel the depth in other languages that I got in C.<\/p>\n<p>Web programming is great for some quick compliments. LOL. Just after a week, I could write great pieces of code that would amaze everyone. But deep down somewhere, I didn&#8217;t feel good about myself. Its like, choosing the easy path rather than the challenging one. So I thought again, about some other stream. Yes, software programming is pretty good.<\/p>\n<p>So I started with Java. I did learn all the basics and some intermediate stuff. Java is great, but still, I missed C. I needed something close to the OS. I needed a language that I could use to interact with my Arduino. I needed something like C. So why not C again, perfecting it?<\/p>\n<blockquote class=\"tr_bq\"><p>Yes, I felt, getting back to C seemed to be the best way to go.<\/p><\/blockquote>\n<p>Then, out of nowhere, I got to attend <a href=\"https:\/\/en.wikipedia.org\/wiki\/Bjarne_Stroustrup\">Bjarne Stroustrup<\/a>&#8216;s lecture at IIT-Bombay. Although I never got to get into the actual seminar, his mere presence was enough to push me into C++. I read about it, and even watch some online videos about C++ and opinion from experts about it. Seemed perfect. The control and power of C, the flexibility of Java and the usability of (almost) Python.<\/p>\n<p>I have now been doing C++ for about 2 weeks. Not much really, basic syntax and stuff. Important thing is, I am enjoying it. I really hope I stick to it for some time now till I master it. I don&#8217;t want to be an example of<\/p>\n<blockquote class=\"tr_bq\"><p>jack of all trades and master of none<\/p><\/blockquote>\n<p>Let&#8217;s hope my next post here has some serious C++ in it.&nbsp; <\/p><\/div>\n","protected":false},"excerpt":{"rendered":"<p>I just happened to take a look at my own blog. Starting with some posts about python, I went to C, then PHP-MySQL and then Javascript. All of this in around 3 months. Now, it is great to know multiple languages, but the thing I feel is, you must &#8216;know&#8217; them. Knowing in the sense, [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[17],"class_list":["post-1162","post","type-post","status-publish","format-standard","hentry","tag-c"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1162","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1162"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1162\/revisions"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1162"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1162"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1162"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}