{"id":1175,"date":"2014-07-15T22:00:00","date_gmt":"2014-07-15T22:00:00","guid":{"rendered":"http:\/\/wp.nagekar.com\/2014\/07\/15\/why-you-must-get-raspberrypi\/"},"modified":"2014-07-15T22:00:00","modified_gmt":"2014-07-15T22:00:00","slug":"why-you-must-get-raspberrypi","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2014\/07\/why-you-must-get-raspberrypi.html","title":{"rendered":"Why you must get a RaspberryPi"},"content":{"rendered":"<p><img decoding=\"async\" src=\"https:\/\/www.nagekar.com\/wp-content\/uploads\/2020\/12\/url.jpeg\" \/><\/p>\n<p>Since you are reading this, I can assume you have some sort of  interest in computers and technology, as that is all this blog has. It  is also very likely that you might have heard of this single-board  computer called <a href=\"https:\/\/www.raspberrypi.org\/\">Raspberry-Pi<\/a>  which literally took over the internet back when it was launched. A $35  PC sounds great, and if you ask a tech freak like me, that sounds mouth  watering. So what is it that you can really do with this machine and  well, do you really need it?\n<\/p>\n<h3 id=\"price\">Price<\/h3>\n<p>$35 is what you pay for the board. But keep in mind that the board  comes as it is, without the supporting material (microUSB charger and SD  card) which are a must to boot up the Pi. So it is obligatory  expenditure once you buy the Pi, but that&#8217;s not too much either. In  around $45, you have a &#8216;working&#8217; Pi. Next problem is of the input and  output. Even though the Pi is running, you aren&#8217;t really giving it input  and taking output, right? For that. you have an array of options. I  choose the cheapest; bought a ethernet cable, hooked the Pi to my router  and I was able to work on my Pi via <a href=\"https:\/\/en.wikipedia.org\/wiki\/Secure_Shell\">SSH<\/a>.  Basically, I had a secondary PC (or server as I love to call it) set up  in $50, which is still very cheap, considering the alternatives.\n<\/p>\n<p>Or, if you got some extra money to put, and to make a proper computer  out of it, you can do as one of my friend did. He bought a $30 second  hand monitor, a cheap set of mouse and keyboard and set them up like a  real pc. The benefit of doing this is you don&#8217;t have to depend on your  primary pc to work on your Pi and makes it independent. The disadvantage  of this, apart from the obvious bigger price tag is that it results in  waste of the precious memory, which you should consider when only 512MB  is available at your disposal. This option will cost you around $100, if  you manage to get the components cheap like my friend did.\n<\/p>\n<h3 id=\"use\">Use<\/h3>\n<p>This might be the more important thing to consider for most. If you  are a techie like me, then you might have already guessed the benefits.  Let me just point out a few, that I felt, using it for about 4 months now.Firstly, being a nix fan boy, I tend to troubleshoot more than use  something, anything. It might seem normal to some, but earlier, I had to  format my desktop every other week due to some or the other troublesome  application that I install. Now, since I have a secondary PC to  experiment on, I don&#8217;t fear of destroying the data or anything, because a  new clean OS install just a &#8216;dd&#8217; away. It really helps you to worry  about whats really important, lol.\n<\/p>\n<p>I use my Pi as a web server most of the time. Earlier I had a Linux  VPS with DigitalOcean, the $5\/month one. I had my blog on it, and also I  used to experiment on it. Problem was, since I had that sole server to  experiment on, I would mess it up at times and my blog used to go down.  Another problem was, the connection speed. I own a slow internet  connection at home, so uploading large files to test was a pain. Now,  thanks to my Pi, my web server is just a network hop away. It has really saved my time.\n<\/p>\n<p>It is not that prototype thing that only a few other know, but Pi has  evolved into a very successful computer on the arm platform. Many  popular distros have a specialized R-Pi version, instruction set and its  dedicated community.\n<\/p>\n<p>\n  Pi can be used as a compiler or interpreter for the project you are working on and can act as an excellent emulator.\n<\/p>\n<p>The actual uses of a Pi are only bound by your imagination. You can  check out youtube for some inspiration on what people use their Pis for.  I have seen amazing quad-copters, small time security systems, robots,  model planes and much more, powered by this small device. I didnt do  anything interesting with it, but I sure will, till then, a web server  works too.\n<\/p>\n<h3 id=\"finally\">Finally&#8230;<\/h3>\n<p>\n  So after telling you this, it might be a little more clear as to why  you should get yourself a Pi. It is all about learning something new and  building something with what you learnt. I will add some of my small  time projects on this blog soon.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since you are reading this, I can assume you have some sort of interest in computers and technology, as that is all this blog has. It is also very likely that you might have heard of this single-board computer called Raspberry-Pi which literally took over the internet back when it was launched. A $35 PC [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":853,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[],"tags":[19,3],"class_list":["post-1175","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","tag-diy","tag-electronics"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1175","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1175"}],"version-history":[{"count":0,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1175\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/853"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1175"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1175"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1175"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}