{"id":1368,"date":"2021-09-27T14:47:15","date_gmt":"2021-09-27T12:47:15","guid":{"rendered":"https:\/\/www.nagekar.com\/?p=1368"},"modified":"2021-09-27T14:47:15","modified_gmt":"2021-09-27T12:47:15","slug":"intentional-learning","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2021\/09\/intentional-learning.html","title":{"rendered":"Intentional Learning"},"content":{"rendered":"<p>I was going through my phone&#8217;s gallery when I spotted a photo of Izma from <a href=\"https:\/\/en.wikipedia.org\/wiki\/The_Emperor%27s_New_Groove\">The Emperor&#8217;s New Groove<\/a>. It took me by surprise, because I discovered the movie just this year and was absolutely in love with it, especially the Izma character. But the image in my phone&#8217;s gallery was from 2018 in the form of a meme. Weird internet stuff. Anyway, I digress. So what are we talking about today.<\/p>\n<p>Ah yes, intentional learning.<\/p>\n<p>Growing up, we all have natural interests. Be it art, science, music or dance, or computers (sigh..). We are motivated to learn new things around our interests. And from time to time, we discover new interests. School is interesting in that regard. You&#8217;re thrown in between a bunch of other kids with completely different and random interests, and there&#8217;s osmosis of interests happening when we see that other kid in the class drawing something or reading a book about the solar system or they see us playing a new game or so.<\/p>\n<p>But that diversity of interests decreases once we enter university. The people we&#8217;re with have chosen a similar course and chances are that they had a similar set of interests. There&#8217;s still a fair bit of interesting diversity, and it is still possible to meet people from courses other than ours and see what life outside is like.<\/p>\n<p>But for me the biggest difference was getting out of university and starting full time work. Many small to medium sized workplaces hire people of specific types depending on their culture and\/or domain, understandably so. Many are open to diversity of thoughts and ideas, but of course not too open so as to not destroy the culture that they&#8217;re trying to cultivate in the first place (which, of course, is important but to what extent is a separate discussion in itself). What happens then is that we end up in bubbles of people with similar interests as us.<\/p>\n<p>Of course, like with many things, this isn&#8217;t a black or white, good or bad situation. On the bright side, our spiked growth (say a particular hard skill we&#8217;re trying to hone) in a field can really skyrocket when surrounded by the right people and mentors. That of course has a very positive impact on our careers and professional growth.<\/p>\n<p>But what I found lacking was exposure to experiences, interests and hobbies that were far outside of my bubble. And since I wasn&#8217;t exposing myself to interests and hobbies outside of the ones that already existed, I was also not meeting people who had these drastically different interests or hobbies (or opinions, for that matter).<\/p>\n<p>For this very reason, I am trying intentional learning. The basic premise is very simple. Find a new skill, hobby or interest and just learn to get good enough, what ever that means, but not perfect. So far this year, I&#8217;ve worked on my Chess skills, learned some German, learned a couple of songs on Ukulele, tried my hands on sketching and painting and picking up some photography basics now. Of course, the goal is not to become proficient or professional in any capacity, but just experience the joy of being a complete novice in a new field and seeing how far I can take it.<\/p>\n<p>The side effect is that the curiosity and learning muscles stays in good shape for <a href=\"https:\/\/www.mckinsey.com\/featured-insights\/future-of-work\/the-most-fundamental-skill-intentional-learning-and-the-career-advantage\">when one <em>has<\/em> to learn something new<\/a> (which proved to be useful when studying for a certification exam recently). The other side effect is becoming more conversationally accessible to a wider part of the population, sharing interests with more and more people. Yet another side effect is that it makes one more empathetic and open minded. Playing chess isn&#8217;t any more worthy than making memes or playing guitar or learning programming. Sure, some skills are valued more in the world we live in due to a multitude of reasons, but it takes effort to build any skill and as such nothing can and should be dismissed as unimportant or unworthy of pursuing.<\/p>\n<p>The real joy, however, is in the process of learning; going from not being able to do something to being able to, building muscle memory, watching amateur and pro videos of people doing it on YouTube and being able to talk to someone or join communities with the same interest.<\/p>\n<p>And instead of looking at people who&#8217;ve honed that skill their whole life and getting sad that you&#8217;ll never reach there, find joy in the fact that you can instead get good enough at it and then move on to hundreds of new skills and hobbies, getting a taste of the different ways to be alive, to exist. You&#8217;ll also retain this phase of your interest in your memories, which will feel nostalgic when long time from today you encounter this skill or hobby in some form or the other or meet someone embarking on their journey into it.<\/p>\n<h3>In closing<\/h3>\n<p>I hope that was interesting to read and motivates a few of you to pick up some random new hobbies or learn something totally different, unrelated to your work or life and see how it goes. I am convinced it has some real merits over the demerits. From my perspective, the biggest demerit is that we end up spreading too thin over a bunch of thing, while not mastering anything. Personally, I’m okay with that right now. But depending on where you stand, it may or may not be. But having said that, it isn’t black or white and leaves a lot of room in the middle to play around and see what works best.<\/p>\n<p>Thank you for reading. Following is a personal message unrelated to the article.<\/p>\n<p>I took a long break from writing, but it is good to write something again. If you visited this website in the last four months anticipating a new post, apologies for the delay and thank you for being a super-reader of my blog. Until next time!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I was going through my phone&#8217;s gallery when I spotted a photo of Izma from The Emperor&#8217;s New Groove. It took me by surprise, because I discovered the movie just this year and was absolutely in love with it, especially the Izma character. But the image in my phone&#8217;s gallery was from 2018 in the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-1368","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1368","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1368"}],"version-history":[{"count":2,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1368\/revisions"}],"predecessor-version":[{"id":1380,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1368\/revisions\/1380"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1368"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1368"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1368"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}