{"id":1474,"date":"2022-03-28T21:24:06","date_gmt":"2022-03-28T19:24:06","guid":{"rendered":"https:\/\/www.nagekar.com\/?p=1474"},"modified":"2022-04-18T22:23:23","modified_gmt":"2022-04-18T20:23:23","slug":"slow-thinking","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2022\/03\/slow-thinking.html","title":{"rendered":"A Primer To Slow Thinking"},"content":{"rendered":"<p>I see that I&#8217;ve picked up this habit of keeping half finished articles in the backlog. Need to fix that. Anyway, let&#8217;s hope this article gets to see the light of day on the internet.<\/p>\n<p>I wanted to write some of my current thoughts on the idea of slow thinking. I&#8217;d warn you before we start that none of what you&#8217;ll read in this article is a novel thought of my own. Rather, it is an aggregate of the various different books I read in the past three months, many of which pointed me towards this idea. It is just my interpretation of the idea, but I&#8217;d like to document it nevertheless.<\/p>\n<h2>What is slow thinking?<\/h2>\n<p>The way I understood it, slow thinking is the non-reactive way of thinking and responding to a situation. When presented with a situation that sets off strong emotions &#8212; especially negative ones like anger, fear or jealousy &#8212; the idea is to take a step back and recognize the emotion itself, thereby detaching ourselves from that emotion. It is also handy when dealing with situations that trigger an impulsive reaction, not necessarily a negative one.<\/p>\n<p>From experience, I can vouch for the fact that reacting when in an emotional turmoil isn&#8217;t usually the best idea. I&#8217;d struggle to find an example of a situation in my life when bursting with anger, screaming at someone, getting violent or very negative brought me any net positive.<\/p>\n<p>Similar, impulsively doing something can sometimes be beneficial, but often, and especially in the modern world we live in, impulses are unwarranted and just a reminiscent of the tribal and fight-for-survival past of humans. Being able to recognize when an impulse is justified and when not can come in handy in many life situations, and the ability to do so can be treated like a skill to hone.<\/p>\n<p>Of course, none of this is to suggest we shouldn&#8217;t feel emotions. It is perfectly reasonable to feel sad about some of the world events we&#8217;re constantly made aware of, just as it is nice to feel excited about the thought of having a cake or petting a cat. I think the idea here is to recognize the complexities and different parts of the mind that are responsible for different emotions and reactions instead of abstracting it all under the one &#8220;you&#8221;. The idea is to go from &#8220;I&#8217;m angry&#8221; to &#8220;I&#8217;m feeling anger&#8221; and so on.<\/p>\n<p>The following idea is from <a href=\"https:\/\/www.goodreads.com\/book\/show\/32895535-why-buddhism-is-true\">Robert Wright&#8217;s Why Buddhism Is True<\/a>. Essentially, one can imagine there to be different modules that keep getting activated and deactivated as we go about our lives, and we live through those modules as long as they are active, like experiencing feelings towards the protagonist in a movie or feeling happiness upon hearing a good news. The modules may be triggered by external stimuli, and as such, we&#8217;re not really in control of the orchestration.<\/p>\n<p>Since we&#8217;re not orchestrating how exactly we feel or react to a situation, it implies there&#8217;s no &#8220;you&#8221; but a lot of different parts that become &#8220;you&#8221; depending on the situation and the trigger. Lost a game, the &#8220;dejected&#8221; module activates. Had a nice time at the park with your partner, the &#8220;happiness&#8221; or &#8220;gratitude&#8221; module activates.<\/p>\n<p>Yep, we&#8217;re talking in very abstract terms, but that&#8217;s okay. There&#8217;s no way to comprehend the immense complexities of the inner workings of the mind without spending a lifetime studying the subject like the people whose thoughts I&#8217;m borrowing and interpreting did. And like they say, <a href=\"https:\/\/en.wikipedia.org\/wiki\/All_models_are_wrong\">all models are wrong<\/a>. So as long as this way of thinking helps us better understand why we do what we do, it can be useful.<\/p>\n<h2>So how does one slow think?<\/h2>\n<p>I don&#8217;t think there&#8217;s one way to do it. The book I referred to earlier, Why Buddhism Is True by Robert Wright, suggests meditation techniques that can be put to use to recognize our emotions and detach ourselves from them. <a href=\"https:\/\/en.wikipedia.org\/wiki\/Thinking,_Fast_and_Slow\">Thinking, Fast and Slow by Daniel Kahneman<\/a> educates us about the biases that we might not recognize in our behaviors and that knowledge makes us more aware of our cognitive fallacies. <a href=\"https:\/\/www.goodreads.com\/book\/show\/33299065-relationships\">Relationships by The School of Life<\/a>, speaks about many of the inherent complexities in humans and human emotions and why people behave in certain ways from time to time (of course, with a focus on romantic relationships).<\/p>\n<p>I think it doesn&#8217;t matter which way we choose to learn to slow think; it could be through mindfulness meditation, or educating ourselves on the topic of cognitive biases, or understanding the person we&#8217;re dealing with and recognizing them as humans and their emotions. The end goal is the same: to be less reactive, judgemental and impulsive, and more curious.<\/p>\n<h2>In conclusion<\/h2>\n<p>I hope this was a useful primer on the topic of slow thinking. I&#8217;m looking forward to putting it to use in my life and seeing how it works for me. That&#8217;s it for now. I&#8217;ll go back to getting entertained looking at all sorts of interesting people and the life happening at Catania airport.<\/p>\n<p>Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I see that I&#8217;ve picked up this habit of keeping half finished articles in the backlog. Need to fix that. Anyway, let&#8217;s hope this article gets to see the light of day on the internet. I wanted to write some of my current thoughts on the idea of slow thinking. I&#8217;d warn you before we [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-1474","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1474","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1474"}],"version-history":[{"count":2,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1474\/revisions"}],"predecessor-version":[{"id":1479,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1474\/revisions\/1479"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1474"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1474"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1474"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}