{"id":1565,"date":"2022-07-25T11:29:42","date_gmt":"2022-07-25T09:29:42","guid":{"rendered":"https:\/\/www.nagekar.com\/?p=1565"},"modified":"2022-07-25T11:30:26","modified_gmt":"2022-07-25T09:30:26","slug":"cross-site-scripting-xss-cross-site-request-forgery-csrf-and-server-side-request-forgery-ssrf","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2022\/07\/cross-site-scripting-xss-cross-site-request-forgery-csrf-and-server-side-request-forgery-ssrf.html","title":{"rendered":"Cross Site Scripting (XSS), Cross Site Request Forgery (CSRF) And Server Side Request Forgery (SSRF)"},"content":{"rendered":"\n<p>XSS, CSRF (or XSRF) and SSRF are common vulnerability in modern web applications where an attacker tries to imitates either a legitimate client to an unsuspecting server or a legitimate server to another unsuspecting server. The basic underlying principle behind each of these attack remains the same; performing action on behalf of a legitimate entity. Let&#8217;s look at each of them in a bit more detail and learn about how to protect our web applications against each of them.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">XSS (Cross Site Scripting) <\/h2>\n\n\n\n<p>XSS or Cross Site Scripting occurs when an attacker manages to execute malicious script code in a victim&#8217;s browser as the victim. Browsers store a lot of sensitive information in them. Some of this information is used to identify a user on a website. <\/p>\n\n\n\n<p>A script loaded from a website can access information stored on your browser through that website, which is how sessions work in your browser. That&#8217;s how Facebook or any other website knows to show you your personalized information and not someone else&#8217;s.<\/p>\n\n\n\n<p>XSS occurs if an attacker gets control over the scripts running in your browser. If they can execute code, they can steal your login credentials and trick you into installing malware on your computer.<\/p>\n\n\n\n<p>There are different kinds of XSS attacks and they depend on where the payload is stored.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Reflected XSS<\/h3>\n\n\n\n<p>A reflected XSS vulnerability occurs when a piece of data from a URL is reflected back into the website code unsanitized and can be injected into. This can be a result of a GET or a POST request, and it is especially severe as an unauthenticated GET request as that URL can be shared on social media and anyone clicking on it gets compromised.<\/p>\n\n\n\n<p><strong>Remediation of reflected XSS<\/strong> &#8211; Sanitization of all user inputs before passing it back into the view<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Stored XSS<\/h3>\n\n\n\n<p>A stored XSS vulnerability occurs when a web application stores an XSS attack payload without sanitizing it and then displays it back to the same user or a different user. A notable recent example is <a href=\"https:\/\/blog.hubspot.com\/website\/cross-site-scripting\">British Airways website getting compromised<\/a> and exposing sensitive data including credit card information of 380,000 transactions.<\/p>\n\n\n\n<p><strong>Remediation of stored XSS<\/strong> &#8211; It is the same as with reflected XSS: Sanitization of all user inputs before storing the data in the database.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">DOM based XSS<\/h3>\n\n\n\n<p>Unlike reflected\/stored XSS, a DOM based XSS occurs only on the client&#8217;s side. This can be a result of a user typing in a string into an input field that gets parsed and executed as code. An attacker can trick a user to paste a string into their browser which will execute due to insecure parsing and compromise a user&#8217;s credentials.<\/p>\n\n\n\n<p>Remediation against DOM based XSS &#8211; Display text as text, and nothing else. Instead of <code>element.innerHtml<\/code> use <code>element.innerText<\/code> or <code>element.textContext<\/code> to ensure the data displayed back to a user is purely text.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">CSRF (Cross Side Request Forgery)<\/h2>\n\n\n\n<p>CSRF occurs when a malicious website makes a request to a legitimate server through an unsuspecting victim. <\/p>\n\n\n\n<p>Web applications communicate with clients through HTTP requests. When a request is made, the browser attacks all information that it knows about the website along with the request, including login\/authentication credentials (called cookies).<\/p>\n\n\n\n<p>If the web server doesn&#8217;t have protective measures, a request made through a legitimate website and an attacker&#8217;s website look exactly the same (or they can be forged to look the same). As a result, an attacker can make a request telling the victim&#8217;s bank to transfer $100 to the attacker&#8217;s account, and since the request is made through the attacker&#8217;s browser, the bank&#8217;s server will process it as a legitimate request.<\/p>\n\n\n\n<p><strong>Remediation of CSRF <\/strong>&#8211; CSRF can be easily prevented by requiring any unsafe request to validate itself using a valid CSRF token that can only be found in the website&#8217;s code and changes on every use. Additionally, authentication\/login cookies can be marked as sameSite only, such that any third party website making the request doesn&#8217;t contain the sensitive authentication cookies. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">SSRF (Server Side Request Forgery)<\/h2>\n\n\n\n<p>SSRF is similar to CSRF, but instead of an compromised client making a request to an unsuspecting server, here a compromised server makes a request to itself or another unsuspecting server.<\/p>\n\n\n\n<p>Since a server might be a privileged node in the network, the attacker can make the server access and return sensitive information or perform privileged actions that the attacker&#8217;s account wouldn&#8217;t allow. <\/p>\n\n\n\n<p>SSRF can also be used to trigger code execution in servers where the vulnerability can be exploited using the privileges of the server itself.<\/p>\n\n\n\n<p><strong>Remediation of SSRF<\/strong> &#8211; Any outgoing request needs to be explicitly allowed from the application by maintaining an allowlist of domains and servers a given server can connect to. The scope of these requests should be made as narrow as possible. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">In conclusion<\/h2>\n\n\n\n<p>I hope that was an interesting quick read on one of the most common vulnerabilities in modern web application. Injection and SSRF are two of OWASP&#8217;s top 10 for 2021, so it is definitely worth looking into them and protecting our web applications from potential vulnerabilities.<\/p>\n\n\n\n<p>Read more on OWASP top 10 here: <a href=\"https:\/\/owasp.org\/www-project-top-ten\/\">https:\/\/owasp.org\/www-project-top-ten\/<\/a><\/p>\n\n\n\n<p>Thank you for reading<\/p>\n","protected":false},"excerpt":{"rendered":"<p>XSS, CSRF (or XSRF) and SSRF are common vulnerability in modern web applications where an attacker tries to imitates either a legitimate client to an unsuspecting server or a legitimate server to another unsuspecting server. The basic underlying principle behind each of these attack remains the same; performing action on behalf of a legitimate entity. [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[203,29],"class_list":["post-1565","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-security","tag-web"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1565","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1565"}],"version-history":[{"count":1,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1565\/revisions"}],"predecessor-version":[{"id":1567,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1565\/revisions\/1567"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1565"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1565"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1565"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}