{"id":1603,"date":"2022-11-17T23:54:30","date_gmt":"2022-11-17T22:54:30","guid":{"rendered":"https:\/\/nagekar.com\/?p=1603"},"modified":"2022-11-17T23:54:32","modified_gmt":"2022-11-17T22:54:32","slug":"6-lessons-learned-during-my-time-at-careerfoundry","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2022\/11\/6-lessons-learned-during-my-time-at-careerfoundry.html","title":{"rendered":"6 Lessons learned during my time at CareerFoundry"},"content":{"rendered":"\n<p>I started working at <a href=\"https:\/\/www.linkedin.com\/company\/careerfoundry\/\">CareerFoundry<\/a> (&#8220;CF&#8221;) in January 2019. Ever since then, I&#8217;ve changed in many ways. Change is inevitable and we have very limited control over it. In fact, I think that that only tiny bit of control we have over it is the kind of change we&#8217;d like to see in ourselves.<\/p>\n\n\n\n<p>One way to dictate positive change is by being curious about new environments and people, embracing new and often uncomfortable situations with an open mind.<\/p>\n\n\n\n<p>Getting hired at CF carved a way to some of my most cherished memories, meaningful relationships and enabled me to pursue the hobbies and interests I always wanted to pursue and be the person I always wanted to be.<\/p>\n\n\n\n<p>It also brought me to the beautiful city of Berlin that had space for me and my eccentricities.<\/p>\n\n\n\n<p>I&#8217;ve met some amazing people at CF &#8212; people who&#8217;ve guided me, mentored me, praised me and then schooled me when I needed it. People who&#8217;ve shaped the person you see in me, the person I see in myself.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Inspiration for this article<\/strong><\/h3>\n\n\n\n<p>The inspiration for this article came from a thought I had.<\/p>\n\n\n\n<p>I was visualising our old office at Köpenicker Straße and thinking of my first day. I walked from Heinrich-Heine-Straße U-Bahn all nervous, not sure how I&#8217;ll feel about working in a new country with new people. I was scared.<\/p>\n\n\n\n<p>I started imagining my current self; the one who has worked at CF for nearly 4 years, on my last day walking down the stairway, meeting my younger self walking up the stairway on his first day.<\/p>\n\n\n\n<p>The young me asks if I have any tips for him that’d help his CF journey.<\/p>\n\n\n\n<p>This is the article I&#8217;d send him.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lesson <\/strong>#1 &#8211; Gratitude makes everything better, so does kindness<\/h3>\n\n\n\n<p>I admit that it was strange standing in a circle hearing everyone thank one another in my first week at CF. But I got used to it. Some time later I understood the idea itself.&nbsp;<\/p>\n\n\n\n<p>In a world of ever-increasing needs and wants, gratitude makes us look back at what we already have and feel good about it. The Friday gratitude forced us to look back and remember something good that someone did that helped us in some way. Not just remember, but also announce it.<\/p>\n\n\n\n<p>It is like social-engineering happiness into people, pushing them to look at the beauty in the world. With practice, I got more and more comfortable thanking people and telling them I appreciate them.<\/p>\n\n\n\n<p>Kindness is another quality that I found in abundance during my time at CF. The lengths people went to—to support one another, to assume the best of intentions and to help each other grow—was incredible. I’m a recipient of much of that kindness myself.&nbsp;<\/p>\n\n\n\n<p>Like with gossiping and complaining, gratitude and kindness are just habits. The more we practice them, the easier it becomes to do it the next time.&nbsp;<\/p>\n\n\n\n<p>The more we are exposed to any of them, the more we reciprocate it to others. Hence it becomes easier to find people who exhibit the same. It is a beautiful self-sustaining cycle.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lesson <\/strong>#2 &#8211; Growth mindset, or the idea of unlocking new skills with practice<\/h3>\n\n\n\n<p>Growth mindset is simply believing that many skills can be learned and improved upon by regular practice and timely feedback as opposed to being born with an innate capacity to do them.<\/p>\n\n\n\n<p>The first time I heard about growth mindset was through one of Martin’s Monday morning speeches. It made sense, but it was only after applying it to many of the skills I wanted to pick up that I understood how powerful a simple change to a way of thinking can be.<\/p>\n\n\n\n<p>I got into many hobbies after that, learned fun skills and gained many friends due to the hobbies. It changed my way of looking at everything and made me more curious.<\/p>\n\n\n\n<p>I’ve gamified the whole experience of knowing absolutely nothing about something, then learning more and more about it, practising, getting feedback and improving, and then magically being able to do it &#8212; something that I’d have deemed impossible a short while ago.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lesson <\/strong>#3 &#8211; Good people with good intentions are the overwhelming majority<\/h3>\n\n\n\n<p>There was a rant post on Reddit about how Berlin is changing for the worse, and there was this following reply to that post. I thought it was really well written.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>You leave a megaphone in a public space, and mostly as**oles pick it up to yell thinly veiled hatred in it. No one cares, except for the other assholes in the megaphone line, who cheer for the bile and can’t wait to be cheered in return. But then, when I picked the megaphone and asked for help, I found help. And when I picked up the megaphone and offered some, I found people to help. The regular people are here. They just aren’t ranting or cheering the rants.<\/p>\n\n\n\n<p>&#8211; reddit r\/berlin<\/p>\n<\/blockquote>\n\n\n\n<p>It isn’t news to anyone that <a href=\"https:\/\/twitter.com\/harvard\/status\/1419290090208116739?lang=en\">negativity spreads much faster than positivity<\/a>, and social media only amplifies that. As a result of this, it is very easy to be cynical of everything and everyone.<\/p>\n\n\n\n<p>What I’ve learned at CF is that most people are just like me.&nbsp;<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>They will do good if given a chance.&nbsp;<\/li>\n\n\n\n<li>They’ll help if they can.&nbsp;<\/li>\n\n\n\n<li>They’ll get out of the way if told they or their actions are causing hurt<\/li>\n<\/ul>\n\n\n\n<p>One of Martin’s Monday morning speeches was about assuming the best of intentions. I thought it was appropriate as most people have good intentions most of the time, so it makes a lot of sense to have that as our default stance.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lesson <\/strong>#4 &#8211; Rules can be made up to come together with others, do good and spread happiness<\/h3>\n\n\n\n<p>Another important lesson I’ve learned at CF goes hand in hand with an amazing video I watched about <a href=\"https:\/\/www.youtube.com\/watch?v=MBRqu0YOH14\">Optimistic Nihilism from this youtube channel called Kurzgesagt<\/a>. The premise of the video was that if the universe doesn’t have any purpose, then we get to dictate its purpose; our purpose.<\/p>\n\n\n\n<p>An extension to that idea is creating arbitrary rules for ourselves that help us do more of what we love. At CF, many people are givers. They love doing something for others.&nbsp;<\/p>\n\n\n\n<p>So why wait for a special yearly holiday to cook for others? Just make up a couple of things like <strong>Soup Kitchen<\/strong> and <strong>Breakfast Thursdays<\/strong> to enable anyone who loves cooking for others to do it.<\/p>\n\n\n\n<p>And why wait for Thanksgiving to thank someone when we could just thank them every Friday in our <strong>Friday Gratitude<\/strong>.<\/p>\n\n\n\n<p>And why wait to take that new colleague of ours and the rest of the team to the best burger joint when you could just have <strong>Burger Fridays<\/strong> every Friday.<\/p>\n\n\n\n<p>Convenient, eh?<\/p>\n\n\n\n<p>Honestly, Burger Fridays is my most missed tradition at CF. I’d have also proposed a Donnerstag Döners but Covid had other plans.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lesson <\/strong>#5 &#8211; Company culture is just the people of CF<\/h3>\n\n\n\n<p>Recently I watched this speech titled <a href=\"https:\/\/www.youtube.com\/watch?v=8CrOL-ydFMI\">“This is water” by David Wallace<\/a> in which Mr. Wallace tells us the importance of being aware of the most obvious things around us.<\/p>\n\n\n\n<p>It made me think of this phrase “company culture” and wonder what it is. When I joined CF, I remember trying to fit into the culture. Before I knew it, I was interviewing people who were seeing me and judging the culture of the company. I went from trying to fit in, to defining what the culture at CF was. All of us did.<\/p>\n\n\n\n<p>I then realised something interesting. Since “CF” itself is a virtual entity that only exists in our shared minds, CF’s culture is just how we perceive the rest of CF. In that sense, each and everyone at CF is playing a part in defining the culture of CF at that moment. When someone joins, they bring something new to the table. When someone leaves, they take something away.&nbsp;<\/p>\n\n\n\n<p>CF’s culture is as dynamic as the people it is made up of and suddenly, “How will we keep the culture at CF the same?” &#8212; a question that gets asked a lot whenever we speak of hiring &#8212; automatically turns into “How will we hire the kind of people we’d like representing CF?”, and I think that is a more useful question.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Lesson <\/strong>#6 &#8211; There&#8217;s more to life than just work<\/h3>\n\n\n\n<p>My first day at CF was 14th of January, 2019. I was busy setting up my laptop and various company accounts, and reading some documentation. At around 6.30pm, Megan came to my table and said “that’s enough for the first day &#8212; go home now”. I looked around and almost everyone had already left.<\/p>\n\n\n\n<p>This was strange to me. It was still a couple of hours till dinner time. Why not just keep working and go straight to dinner?<\/p>\n\n\n\n<p>You see, I didn’t have leisure time in my vocabulary back then. It was always doing something. Working, eating, sleeping, coding, studying. Something.&nbsp;<\/p>\n\n\n\n<p>I grew up with a hustle-culture mindset where if I&#8217;m not working 10 hours a day and coding in my free time, I&#8217;d not consider myself “ambitious” and probably not “make it”. Berlin and CF changed all of that.<\/p>\n\n\n\n<p>All of a sudden, I had at least a couple of hours every day, and two full days of weekend when I wasn’t expected to keep working. I could do something else. But what?&nbsp;<\/p>\n\n\n\n<p>Anything.<\/p>\n\n\n\n<p>I started pursuing hobbies that weren’t career related or would ever be monetized. I started biking and playing chess, painting and playing music or just sitting by the canal doing absolutely nothing.&nbsp;<\/p>\n\n\n\n<p>It is nice to not have to constantly think of free time as wasted time, and I have CF and Berlin to thank for this huge change in my way of thinking and living my life.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Thank you, dear friends<\/h2>\n\n\n\n<p>I am grateful for everything I’ve learned from the people at CF. It has made me a different and, in my opinion, better version of myself, and I can’t thank you all enough. I’ll pay it forward wherever I end up in life.<\/p>\n\n\n\n<p>All the best &#8211; Abhi!<\/p>\n\n\n\n<p>Crossposted from <a href=\"https:\/\/www.linkedin.com\/pulse\/6-lessons-learned-during-my-time-careerfoundry-abhishek-nagekar\/?trackingId=rL2hNuqgRRmqFIvmJ9ey6Q%3D%3D\">Linkedin<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>I started working at CareerFoundry (&#8220;CF&#8221;) in January 2019. Ever since then, I&#8217;ve changed in many ways. Change is inevitable and we have very limited control over it. In fact, I think that that only tiny bit of control we have over it is the kind of change we&#8217;d like to see in ourselves. One [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":1606,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[207,206],"class_list":["post-1603","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized","tag-careerfoundry","tag-work"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1603","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1603"}],"version-history":[{"count":2,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1603\/revisions"}],"predecessor-version":[{"id":1605,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1603\/revisions\/1605"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media\/1606"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1603"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1603"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1603"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}