{"id":1691,"date":"2023-01-15T17:47:35","date_gmt":"2023-01-15T16:47:35","guid":{"rendered":"https:\/\/nagekar.com\/?p=1691"},"modified":"2023-01-15T17:48:34","modified_gmt":"2023-01-15T16:48:34","slug":"letter-to-my-18-year-old-self","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2023\/01\/letter-to-my-18-year-old-self.html","title":{"rendered":"Letter To My 18 Year Old Self"},"content":{"rendered":"\n<p>I have a love-hate relationship with articles such as this. On one hand, the thought of going back in time and changing certain decisions is always fascinating, and documenting some of those thoughts into text that I can keep coming back is alluring. What is also appealing is to have this documented as a reference for my future self who&#8217;d probably (read: most likely) also want to write back to his 18 year old (or <a href=\"http:\/\/nagekar.com\/2022\/11\/twenty-seven.html\" data-type=\"post\" data-id=\"1585\">27 year old self<\/a> 🤷‍♂️, who knows).<\/p>\n\n\n\n<p>But on the other hand, articles with titles such as this are so cliche that they don&#8217;t feel sincere and make me cringe. What&#8217;s even the point of publishing it? Don&#8217;t I believe that my current state defines the combined success or failure of all my past decisions and events in my life? If I&#8217;m happy with the state of affairs in my life right now, doesn&#8217;t that mean everything in the past kinda worked out in the end?<\/p>\n\n\n\n<p>I don&#8217;t know. My current philosophy doesn&#8217;t <em>allow<\/em> for an article like this one, for it doesn&#8217;t make any sense to wish for the possibility of a different present when I have the certainty of my current present, which I believe I&#8217;m okay with. But then, why stop myself from writing down all the lessons that I&#8217;ve learned ever since I turned 18. I guess I could post that under a less cringey title along the lines of &#8220;Generic useful lessons in life&#8221;.<\/p>\n\n\n\n<p>But then, useful to whom? When? Would I like it to be handed over to me when I was 5? 10? <\/p>\n\n\n\n<p>Exactly. We&#8217;ll move in circles here and never get anywhere. That&#8217;s probably the reason this article has been a draft for a year or more. But I think I&#8217;ll have to get it out of my head first, and deal with the above thought later. Having cleared that, let&#8217;s get started <em>* snaps finger *<\/em><\/p>\n\n\n\n\n\n<h2 class=\"wp-block-heading\">The satisfaction of reaching a goal is so much smaller than the satisfaction of doing something you love, so love the process for that&#8217;s where most of the satisfaction lies<\/h2>\n\n\n\n<p>Quotes that urge us to enjoy the climb more than the peak, the journey more than the destination or something along those lines are dime a dozen. Being a <a href=\"http:\/\/nagekar.com\/quotes\">quote-collector<\/a>, I&#8217;ve known them forever. <\/p>\n\n\n\n<p>But it is only after repeatedly going through the same journey over and over again &#8212; desiring something, working my way towards it and then eventually getting it &#8212; have I learned that the joy of having achieved something is minuscule compared to the joy I got along the way doing the thing I loved. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Happiness derived from external sources is very limited, and once the basics are covered, very superficial<\/h2>\n\n\n\n<p>Very similar to the previous point, but with an important distinction. Time and again, something has repeated: <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>I&#8217;ve desired something materialistic<\/li>\n\n\n\n<li>Spent countless hours reading about it and contemplating about the joys its possession will bring me<\/li>\n\n\n\n<li>Eventually acquiring it<\/li>\n\n\n\n<li>Only to have the joy feel underwhelming after a matter of minutes of doing it<\/li>\n<\/ul>\n\n\n\n<p>And then recently I came across this quote<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>“Traveling is a fool&#8217;s paradise. Our first journeys discover to us the indifference of places. At home I dream that at Naples, at Rome, I can be intoxicated with beauty, and lose my sadness. I pack my trunk, embrace my friends, embark on the sea, and at last wake up in Naples, and there beside me is the stern fact, the sad self, unrelenting, identical, that I fled from. I seek the Vatican, and the palaces. I affect to be intoxicated with sights and suggestions, but I am not intoxicated. My giant goes with me wherever I go.”<\/p>\n<cite>Ralph Waldo Emerson wrote in his 1841 essay, “Self-Reliance.”<\/cite><\/blockquote>\n\n\n\n<p>I think what Emerson is trying to say is that trying to fix something that&#8217;s an issue on the inside by changing something on the outside seldom, if ever, works. But if you&#8217;ve ever spent hours browsing Amazon out of boredom thinking the new iPhone or Sony&#8217;s new mirrorless camera will make you content and solve all of your life problems, and were lucky to actually be able to buy it, you&#8217;ll know that the satisfaction was very short lived and things go back to being exactly the way they were before.<\/p>\n\n\n\n<p>We also vastly overestimate how much joy we&#8217;d get from achieving our material goals. Getting to a higher salary, or a dream job, or the latest iPhone; I realized how little joy the outcome eventually brought compared to the misery that the desire for it brought.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Friends and family are what keep you going even on the gloomiest days<\/h2>\n\n\n\n<p>I <a href=\"http:\/\/nagekar.com\/2019\/01\/mumbai-to-berlin.html\" data-type=\"post\" data-id=\"1055\">arrived in Berlin<\/a> on a very cold and gloomy day, and the next few weren&#8217;t any different. Unable to cope, and having had my luggage misplaced, I was naturally sad after the second day, asking why was I even there. <\/p>\n\n\n\n<p>Just sitting quietly in my bedroom having exactly 0 friends in this new city, I was feeling (what I&#8217;d later learn) the seasonal low mood sprinkled over homesickness. Then I got a call from a friend back home. Then my parents called me. And within an hour or so, I was actually happy I was in Berlin, went out for a walk and had some kebab 🥙<\/p>\n\n\n\n<p>Case in point, I learned that my brain is easily tricked into happiness by interacting with people I love and care about. Just a casual chat a day with a friend keeps me in generally good mood. It is like a tonic for my mental health, doubling as first aid when time comes.<\/p>\n\n\n\n<p>Hence, I think it is important to always have people that one can open up with. These people don&#8217;t magically appear but have to be invested in over years to cultivate such relationships and that&#8217;s something I really value in my life today. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Bad decisions attract bad circumstances which bring a bad state of mind, and a bad state of mind brings more bad decisions. Works just as well with good decisions<\/h2>\n\n\n\n<p>Or the <a href=\"https:\/\/en.wikipedia.org\/wiki\/Snowball_effect\">snowball effect<\/a>. Habits, outcomes of decisions and events in our lives, both good or bad, generally start small and they slowly spiral and become greater in magnitude and have a greater influence on our lives. <\/p>\n\n\n\n<p>For this reason, I think it is important to 1. Be mindful of smaller problems that might have the potential to spiral into bigger ones, 2. Have people around you who can point out and alert you of the small cracks developing and 3. Believe that little good habits, however small, will compound with other little good habits and bring much greater good than their perceived insignificance.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Be aware and intentional<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.youtube.com\/watch?v=ms2BvRbjOYo\">David Foster Wallace&#8217;s speech titled this is water<\/a> talks about learning how to think, how to chose what we think about inside our minds irrespective of what&#8217;s happening outside of it, to be in control of our thoughts. I&#8217;d highly recommend you listen to it.<\/p>\n\n\n\n<p>Like many, I found the speech very educational, and decided to not only be more attentive of my thoughts and the way I think about things, but also be very intentional about my actions. For me, it means to jump out of the default setting and steering the direction in which I mind decides to run with a thought after having passed it through my values filter.<\/p>\n\n\n\n<p>It also means that when something doesn&#8217;t work out, it is usually not a sad outcome, but an educational one because I chose this version of reality over the others, and accepted the risks and rewards associated.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">In closing<\/h2>\n\n\n\n<p>Phew, that was not easy to write. But I&#8217;m happy I did. I can already see myself coming back to this article from time to time. I hope you found some value in the text above<\/p>\n\n\n\n<p>Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I have a love-hate relationship with articles such as this. On one hand, the thought of going back in time and changing certain decisions is always fascinating, and documenting some of those thoughts into text that I can keep coming back is alluring. What is also appealing is to have this documented as a reference [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-1691","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1691","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1691"}],"version-history":[{"count":4,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1691\/revisions"}],"predecessor-version":[{"id":1822,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1691\/revisions\/1822"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1691"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1691"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1691"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}