{"id":1854,"date":"2023-03-16T01:02:03","date_gmt":"2023-03-16T00:02:03","guid":{"rendered":"https:\/\/nagekar.com\/?p=1854"},"modified":"2023-04-16T23:02:20","modified_gmt":"2023-04-16T21:02:20","slug":"focusing-on-the-beauty-in-the-world-with-a-camera","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2023\/03\/focusing-on-the-beauty-in-the-world-with-a-camera.html","title":{"rendered":"Focusing on the beauty in the world with a camera"},"content":{"rendered":"\n<p>In late 2021, my friend Ed handed me his Canon 7D for me to <a href=\"http:\/\/nagekar.com\/2022\/01\/learning-photography.html\" data-type=\"URL\" data-id=\"http:\/\/nagekar.com\/2022\/01\/learning-photography.html\">try my hands at photography<\/a>. I already had an itch to get into it but didn&#8217;t have the &#8220;gear&#8221;, or so I told myself. The camera came without a lens or SD card so I rode my bike to the Saturn store at Alexanderplatz and got myself a Nifty-Fifty; a <a href=\"https:\/\/store.canon.de\/canon-ef-50mm-f-1-8-stm-objektiv\/0570C005\/\">Canon 50mm f1.8 lens<\/a>. It is still to this day the most fun-to-shoot-with lens I own.<\/p>\n\n\n\n<p>I&#8217;ve taken thousands of pictures since then. What&#8217;s changed between owning a smartphone (that features brilliant cameras) and owning a dedicated camera is that when I have a dedicated camera on me, I go looking for something interesting, something beautiful, something funny, something new. It is deliberate and intentional. <\/p>\n\n\n\n<p>The world is full of patterns, symmetry, life, history, people, clues, colors, shades. There&#8217;s just so much that sparks curiosity. Would I find it interesting even if I wasn&#8217;t trying to take a picture? Probably. The camera on me reminds me frequently that I&#8217;m trying to focus on the beauty in the world that I can sometimes forget to notice.<\/p>\n\n\n\n<p>Having a camera just gives me an excuse to step out, wander around, stare at walls, look at people and dogs and cats and insects and flowers.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">The best camera is the one you have you on<\/h2>\n\n\n\n<p>I&#8217;ve read this quote at a bunch of places, and that&#8217;s why I got a paid pro camera app for my iPhone last year. A smartphone is perfect as a camera. It is always there, always charged and it is getting <em>better<\/em> at a rate faster than any dedicated camera system can imagine. It is getting to the point where smartphones are taking pictures that isn&#8217;t reality but what the phone thinks you wanted to shoot, <a href=\"https:\/\/www.youtube.com\/watch?v=MZ8giCWDcyE\">but that&#8217;s a different topic<\/a>.<\/p>\n\n\n\n<p>But smartphones don&#8217;t just take photos. They have our social and work life on them, and they&#8217;re always connected. I struggle to stay intentional about anything with a smartphone around me, probably because it does so many things. And that constant state of being distracted by nothing in particular is quite exhausting. <\/p>\n\n\n\n<p>What I wanted, for lack of a better excuse, was a camera that was just a camera. And that&#8217;s why I decided to get my self a relatively cheap point and shoot camera from Sony.<\/p>\n\n\n\n<p>With the little Sony, it is as fun to take pictures with as my DSLR, but at the same time it is more subtle and it fits in my other pocket. It is like the best of both worlds! Of course, it isn&#8217;t without its drawbacks. It needs to be charged separately from the smartphone, the photos are worse than the DSLR and so on. But it is always with me and it forces me to be intentional with my hobby which makes it all worth it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Photography as a memories generation tool<\/h2>\n\n\n\n<p>I remember watching <a href=\"https:\/\/www.youtube.com\/watch?v=zUTL4Op56CM\">this video<\/a> where that idea of routine making time fly faster was exposed to me. I watched it many years ago and thought it was very true, although I had not had any real routine back then. Today, I kinda still think it holds true.<\/p>\n\n\n\n<p>Photos are a good way to get back some memories, especially when they&#8217;re taken intentionally. I read somewhere that good photographers are intentional with their shots. They try to remember what made them take a picture. There&#8217;s a story associated with a picture in their heads that they can tell you. It isn&#8217;t about the camera or the lens or any of the technicality. Just the moment captured on film.<\/p>\n\n\n\n<p>I&#8217;m trying to copy this&#8211;to think why I&#8217;m taking a picture before clicking the shutter button so that when I&#8217;m looking at the pictures later, I can really remember the scene very vividly; the scene in the frame, sure, but just as importantly, the scene outside of the frame&#8211;the sun&#8217;s warmth or the cold wind and rain on my skin, the sounds and my thoughts, and also did I decide to take picture of this very thing of all the other things. Like a wormhole back to that moment in time. That somehow helps make memories easier to go back to and make the time spent doing event the mundane-est of things count.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">In closing<\/h2>\n\n\n\n<p>That was a bit all over the place, so apologies if you kept searching for a topic in this article and failed to find it. I just wanted to get it out. On a different note, I want to document my photographs better, but I&#8217;ve not found a good way to do so. Instagram isn&#8217;t ideal, and while Flickr might work, I find myself questioning how long will it be around. In the end, I think hosting an image gallery plugin on WordPress with my showcase-worthy photos might be a good idea. We shall see.<\/p>\n\n\n\n<p>Thank you for reading! <\/p>\n","protected":false},"excerpt":{"rendered":"<p>In late 2021, my friend Ed handed me his Canon 7D for me to try my hands at photography. I already had an itch to get into it but didn&#8217;t have the &#8220;gear&#8221;, or so I told myself. The camera came without a lens or SD card so I rode my bike to the Saturn [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[202,5],"class_list":["post-1854","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-hobbies","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1854","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1854"}],"version-history":[{"count":7,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1854\/revisions"}],"predecessor-version":[{"id":1866,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1854\/revisions\/1866"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1854"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1854"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1854"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}