{"id":1871,"date":"2023-07-09T17:32:26","date_gmt":"2023-07-09T15:32:26","guid":{"rendered":"https:\/\/nagekar.com\/?p=1871"},"modified":"2023-07-09T17:32:28","modified_gmt":"2023-07-09T15:32:28","slug":"want-to-write-more","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2023\/07\/want-to-write-more.html","title":{"rendered":"Want to write more"},"content":{"rendered":"\n<p>Back in the day, I’d try to publish an article every month on my blog. It was difficult, but I’d still manage it for most part. I just looked at my last published article, which was in March, and the plethora or drafts sitting there, receiving little to no love.<\/p>\n\n\n\n<p>Whenever I come across blogs with last published articles from years ago, I wondered what might’ve happened. Why (and how) do some people manage to keep publishing long form content after all these years, while others have given up on blogs. Some of them have done so in favour of more short form content that has taken over the web in the last decade or so. And of course, there’s a whole spectrum in between, where I see myself right now.<\/p>\n\n\n\n<p>I came across this&nbsp;<a rel=\"noreferrer noopener\" href=\"http:\/\/jsomers.net\/blog\/speed-matters\" target=\"_blank\">idea of perceived cost of doing things<\/a>, depending on how much time it takes. For example, if I have an article that took my 2 months to finalise (and thus get satisfaction from), my brain might associate the cost of writing a long form article to be 2 months, thus discouraging me from picking up my computer to write again. If the actual satisfaction is derived from people finding my writing useful, then the gratification is delayed by several months or even years.<\/p>\n\n\n\n<p>Creating a meme for Instagram, on the other hand, gets me gratification within minutes. Of course I know how these things work. But possession of a piece of knowledge isn’t very useful if it cannot be applied in a meaningful way.<\/p>\n\n\n\n<p>Again, there’s nothing inherently wrong about creating short form content, and there’s nothing superior about people who create long form content. Personally, as long as I retain my ability to do either when I wish, I&#8217;d be pretty happy. I want to make memes and make my friends laugh, and keep publishing valuable content on the internet.<\/p>\n\n\n\n<p>And that&#8217;s why I started writing in the morning today as I was on my way to meet some friends: To publish it immediately and remove some of the cost burden that has creeped into my head around publishing on my blog. Hopefully I can write more soon.<\/p>\n\n\n\n<p>Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Back in the day, I’d try to publish an article every month on my blog. It was difficult, but I’d still manage it for most part. I just looked at my last published article, which was in March, and the plethora or drafts sitting there, receiving little to no love. Whenever I come across blogs [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-1871","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1871","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=1871"}],"version-history":[{"count":1,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1871\/revisions"}],"predecessor-version":[{"id":1872,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/1871\/revisions\/1872"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=1871"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=1871"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=1871"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}