{"id":2081,"date":"2023-12-28T00:31:54","date_gmt":"2023-12-27T23:31:54","guid":{"rendered":"https:\/\/nagekar.com\/?p=2081"},"modified":"2023-12-28T00:31:54","modified_gmt":"2023-12-27T23:31:54","slug":"wifi-router-keeps-disconnecting-exactly-when-speed-testing","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2023\/12\/wifi-router-keeps-disconnecting-exactly-when-speed-testing.html","title":{"rendered":"Wifi Router Keeps Disconnecting Exactly When Speed Testing"},"content":{"rendered":"\n<p>I got a cheap Huawei Wifi 6 Router (AX2 Pro) which was the only sub-20 Euro router I could find on the market that supported Wifi 6. It is a used one of course, and the person I got it from got it from their previous tenants, who I assume got it from China (or Aliexpress?) because the product doesn&#8217;t support any language other than Chinese. <\/p>\n\n\n\n<p>I knew that before buying, but I thought it was an okay tradeoff given the Wifi 6 capabilities at the price. So after an hour of Google Translating every item in the UI and setting everything up, I was very excited to run an internet speed test.<\/p>\n\n\n\n<p>To my surprise, the Wifi connection just dropped as soon as the speed hit 100Mbps, crashing with a &#8220;socket broken&#8221; error. It was as if someone pulled the plug exactly when I ran the speed test. I tried again with the same result. I could surf the internet, watch youtube and do other things just fine. Just not run a speed test.<\/p>\n\n\n\n<p>Connecting my laptop with the Ethernet cable gave me the full 1Gbps, what I was expecting. Interestingly, I could replicate the behavior of the router restarting via any device and exactly while speed testing.<\/p>\n\n\n\n<p>I was a bit disappointed, but not a lot. After all, blindly buying cheap imported routers off kleinanzeigen ought to have its risks. I sat down to write the seller (who probably had never once tried to run the router, just passed it on from her tenants to me) that the product they sold was <a href=\"https:\/\/de.pons.com\/%C3%BCbersetzung\/deutsch-englisch\/kaputt\"><em>kaputt<\/em><\/a>, simultaneously trying to come up with a search query that&#8217;d probably match someone else&#8217;s description of this problem.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Eureka! <\/h2>\n\n\n\n<p>As I was writing my seller a message (not exactly expecting a refund, as these things are sold with zero guarantees), it occurred to me that benchmarking an electronic device ought to push its power utilization. It would make sense why the device would operate normally otherwise. I immediately checked the output of the power supply and the required input from the router. TADAA! <\/p>\n\n\n\n<p>The seller gave me a TP-Link power supply that supplied 9V at 0.6A but the Huawei router was expecting 12V at 1A. I fanatically searched my box of cables and adapters to find a power supply and found a variable power supply that could help with the case.<\/p>\n\n\n\n<p>As expected, that was it. As soon as the router got the right juice, it started pushing 900mbps+. I find that very impressive, given I picked it up for just 20 euros! Welcome to your new home little guy.<\/p>\n\n\n\n<p>Thank you for reading!<\/p>\n\n\n\n<p> <\/p>\n","protected":false},"excerpt":{"rendered":"<p>I got a cheap Huawei Wifi 6 Router (AX2 Pro) which was the only sub-20 Euro router I could find on the market that supported Wifi 6. It is a used one of course, and the person I got it from got it from their previous tenants, who I assume got it from China (or [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[231,232],"class_list":["post-2081","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-home-server","tag-networking"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2081","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2081"}],"version-history":[{"count":1,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2081\/revisions"}],"predecessor-version":[{"id":2082,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2081\/revisions\/2082"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2081"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2081"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2081"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}