{"id":2088,"date":"2024-01-14T15:26:28","date_gmt":"2024-01-14T14:26:28","guid":{"rendered":"https:\/\/nagekar.com\/?p=2088"},"modified":"2024-01-14T15:29:37","modified_gmt":"2024-01-14T14:29:37","slug":"building-vs-buying-a-nas-a-non-hardware-nerds-perspective","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2024\/01\/building-vs-buying-a-nas-a-non-hardware-nerds-perspective.html","title":{"rendered":"Building vs Buying a NAS &#8211; A non-hardware nerd&#8217;s perspective"},"content":{"rendered":"\n<p>After years of contemplating on making or buying myself a NAS, I finally decided to bite and got a Synology DS223j two-bay NAS as a present for myself for Christmas along with two refurbished 16TB Seagate Exos hard drives. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Rewinding a bit<\/h2>\n\n\n\n<p>For most of my life, the only &#8220;backup&#8221; I had was a 500gb hard disk that came preinstalled in the <a href=\"http:\/\/nagekar.com\/2015\/11\/fujitsu-lifebook-a514-review.html\">Fujitsu A514<\/a>, my first laptop. I had also bought a 120gb solid-state disk at the time and immediately replaced the hard disk with it. The hard disk went into an enclosure and I used it to back up any important data as my laptop went through frequent cycles of OS reinstalls during my distro-hopping era.<\/p>\n\n\n\n<p>Any time I&#8217;d want to back up my photos, it would become a folder on the hard disk and then cleared from phone storage as phones came with much smaller storage back then. I remember having 16gb internal storage on my Galaxy Note and thinking I&#8217;d never fill it up no matter how many pictures I take.<\/p>\n\n\n\n<p>I used Gmail and the 15gb storage the free account comes with was enough for email and the occasional document sharing via Google Drive. Life was good.<\/p>\n\n\n\n<p>At some point I hooked this 500gb drive to my <a href=\"http:\/\/nagekar.com\/2016\/01\/how-to-private-local-cloud-using-raspberrypi.html\">Raspberry Pi running Nextcloud<\/a> and even had my very first &#8220;NAS&#8221; setup.<\/p>\n\n\n\n<p>In 2018, I had some INR 300 of Google Play credits that I used to get some of the apps that I wanted to support and use pro versions of, like Nova launcher, Tasker etc. Along with those, I got the 100gb Google storage plan (at INR 130 a month) and started backing up photos to Google Drive. It was an okay cost as I was already working by then and had some money to spare for subscriptions. <\/p>\n\n\n\n<p>Since then, I had kept that subscription and even upgraded it to 200gb after <a href=\"http:\/\/nagekar.com\/2019\/01\/mumbai-to-berlin.html\">moving to Berlin<\/a>. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Problem statement<\/h2>\n\n\n\n<p>The problem I set out to solve was to get rid of some of the cloud storage subscription fees I&#8217;m paying each month. I was paying duplicate fees for cloud between two Google accounts (and an iCloud account), so the plan would help get rid of two of the three subscriptions resulting in some 50 euros saved each year while providing me to actually follow the 3-2-1 backup strategy for some important data that I wouldn&#8217;t want to lose. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Requirements<\/h2>\n\n\n\n<p>Late last December I got a bit obsessed with watching computer build videos. It was fun to learn something new, and to be honest it also was entertaining. From the videos, I learned some important considerations that I&#8217;ll have to think for myself before spending my first Euro on this new project.<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Number of drive bays: While a NAS can just be a single drive attached to the network, generally they also offer redundancy (using RAID configurations) for NAS with two or more drive bays. I knew I&#8217;d want a RAID 1 so I&#8217;d need at least two drives.<\/li>\n\n\n\n<li>Idle power consumption: Power is expensive in Germany and I&#8217;d want to stay away from any old hardware that&#8217;s cheap to buy but very expensive to run. The last thing I&#8217;d want to do is invest in a NAS that I&#8217;m going to not keep running all the time.<\/li>\n\n\n\n<li>NAS application \/ operating system: Ideally, I&#8217;d like some bells and whistles like automatic backups to make my life a little easier and not having to do that manually. The popular NAS applications come with add-ons that allow more specific usecases. <a href=\"https:\/\/www.truenas.com\/apps\/\">TrueNAS<\/a>, <a href=\"https:\/\/www.synology.com\/de-de\/dsm\/packages\">Synology<\/a> and others have public pages where one can see if the application they&#8217;d need is available on the platform they&#8217;re choosing for the NAS. <\/li>\n\n\n\n<li>Gigabit access speeds: I wanted to NAS to be accessible at the same speeds as the rest of my home network, which is currently at a Gigabit. Fortunately, that seems like the minimum one gets in 2023.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Non-requirements<\/h2>\n\n\n\n<p>I also learned about what other people prioritize in their NAS, but it didn&#8217;t resonate with me. More specifically, I couldn&#8217;t justify the price overhead that acquiring those features needed. Namely,<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>SSD Cache: While there are many strategies to use an SSD for read and write caching, it primarily makes read\/write operations feel faster for some use cases. I thought this was over-optimizing for my modest use case.<\/li>\n\n\n\n<li>CPU \/ RAM to run containers \/ VMs: I also found that folks like to run Docker containers \/ VMs on their NAS and need more powerful CPU and added RAM. This hadn&#8217;t even crossed my mind, and as such, I stayed true to the &#8220;if I didn&#8217;t know it exists, I probably don&#8217;t need it yet&#8221; principle. <\/li>\n\n\n\n<li>Multi-gigabit or multiple LAN ports: Folks opt for 2.5 or even 10gig LAN ports on their NAS for faster transfer speeds. Now while I&#8217;d looove to have transfer rates more than 120 MB\/s, I&#8217;d need to upgrade my entire home network to multi-gigabit LAN and WLAN, and that&#8217;s expensive. That also would mean having a beefier CPU to handle the transfers which would increase the cost of NAS hardware itself.<\/li>\n\n\n\n<li>Four or more drive bays: This was the one I was most unsure about; Most if not everyone one reddit suggested to get at least a 4 bay NAS and then just using a couple of the bays until the requirement arises. It sounds reasonable, but I have a feeling that the requirement for 4 bays would never arise and 16TB in RAID-1 is going to be enough for a very long time.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Building vs buying<\/h2>\n\n\n\n<p>The nerd in me wanted to really go down the route of buying all the parts and assembling everything myself. The videos I had watched made me confident enough that I could pull it off. Building a PC is fun, and truth be told, I&#8217;ve never actually built one for myself.<\/p>\n\n\n\n<p>Having said that, I also recognized that I&#8217;m mixing two things together; my requirement for a secure and reliable NAS for my critical data and my desire to build a PC that I can experiment on. I&#8217;ve lost important data in the past and I didn&#8217;t want to risk it. Especially not after having just watched a bunch of videos and never actually having built a decent PC myself. <\/p>\n\n\n\n<p>I decided to pick up a Synology 2 bay NAS DS223j with 1gb RAM and a relatively weak but does-the-job quad-core Realtek CPU. The cost of the NAS was 180 euros. To do with it, I got a couple of refurbished <a href=\"https:\/\/www.seagate.com\/files\/www-content\/datasheets\/pdfs\/exos-x16-DS2011-1-1904US-en_US.pdf\">16TB Seagate Exos<\/a> drives, each of which was 180 euros, for a total cost of 540 euros. <\/p>\n\n\n\n<p>My rationale behind going down this path was as follows:<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>I don&#8217;t trust my PC building and setting up skills enough to offload all of my data to the built-NAS and then cancel a couple of cloud subscriptions.<\/li>\n\n\n\n<li>At 4-5 watts of idle (hibernation) and 16 watts of under-load power consumption, it is comparable to a relatively efficient Mini PC.<\/li>\n\n\n\n<li>Hardware isn&#8217;t cheap in Germany, and actually saving money on hardware would require sourcing parts off Aliexpress which takes time and is often less than reliable.<\/li>\n\n\n\n<li>Building a PC and setting up the necessary software takes time. I could use this time on another project (home server blog post coming soon :D). <\/li>\n\n\n\n<li>Synology&#8217;s DSM (their proprietary operating system) comes out of the box with remote access via QuickConnect. <\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">Tradeoffs I&#8217;ve ((sub)consciously) made<\/h2>\n\n\n\n<p>I feel like I&#8217;ve given up on some of my preferences when going down the Synology NAS route. And while some of these are conscious, there are some that will only show up once enough time has passed. In any case, I&#8217;m still documenting some of them here.<\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li>Open source and free software: Synology DSM only runs on Synology hardware, at least officially. It means I&#8217;m stuck to using Synology software for as long as I&#8217;m using this hardware.<\/li>\n\n\n\n<li>Synology tax: Like I mentioned, using these off the shelf NAS&#8217;s requires paying the software and marketing budget of the companies in addition to the cost of the actual hardware. That&#8217;s fair, of course. Just something to be aware of.<\/li>\n\n\n\n<li>NAS hardware: I&#8217;m sure my &#8220;16TB ought to be enough for me&#8221; might not age very well. I also faced some situations where the NAS really slowed down and made me realize that it is running a very under-powered CPU after all. Again, tradeoffs.<\/li>\n\n\n\n<li>Noise: Seagate Exos drives aren&#8217;t the most silent hard drives. My wooden floor made it much worse and I ended up putting the NAS on a softer raised surface to absorb some of the vibrations. I believe this problem would&#8217;ve not completely vanished had I chose to get non-enterprise drives like the Seagate IronWolf, but it would&#8217;ve been better.<\/li>\n\n\n\n<li>Electricity costs: While my Synology NAS is efficient, and consumes single digit Watt power most of the times idling, it will still add 30-40 euros of additional power consumption to my yearly electricity bills (at 10w average power consumption 24x7x365 and 40 cents per kWh). <\/li>\n\n\n\n<li>Breakeven cost: From a purely utility perspective, it will take some years of not using Google Drive and iCloud before the cost of investing in a personal NAS is broken even. This is especially true if I do not fill up the 16TB that I have and then have regular need to access those files. This isn&#8217;t factoring in the added electricity cost, nor can I effectively compare the reliability of Google Drive to a NAS set up at home. Overall, for most people without the need to store TBs of data, Cloud is a very logical option.<\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">In closing<\/h2>\n\n\n\n<p>I hope that was informative in some way. I am looking forward to seeing how my investment turns out and if the list of tradeoffs grows further. I&#8217;ll leave you with some pictures of the NAS.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"1920\" src=\"http:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-scaled.jpg\" alt=\"\" class=\"wp-image-2097\" style=\"width:840px;height:auto\" srcset=\"https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-scaled.jpg 2560w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-300x225.jpg 300w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-250x188.jpg 250w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-768x576.jpg 768w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-1536x1152.jpg 1536w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/IMG_6806-2048x1536.jpg 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><figcaption class=\"wp-element-caption\">Fresh out of the box with its accessories<\/figcaption><\/figure>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"2560\" height=\"1440\" src=\"http:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-scaled.jpg\" alt=\"\" class=\"wp-image-2098\" style=\"width:840px;height:auto\" srcset=\"https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-scaled.jpg 2560w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-300x169.jpg 300w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-250x141.jpg 250w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-768x432.jpg 768w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-1536x864.jpg 1536w, https:\/\/nagekar.com\/wp-content\/uploads\/2024\/01\/FD697044-A0B3-4216-9DE8-C50F50F6BCE7-2048x1152.jpg 2048w\" sizes=\"auto, (max-width: 2560px) 100vw, 2560px\" \/><figcaption class=\"wp-element-caption\">Initial setup in my &#8220;Lack rack&#8221;. It has since been replaced but wait for an update on that.<\/figcaption><\/figure>\n\n\n\n<p>Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After years of contemplating on making or buying myself a NAS, I finally decided to bite and got a Synology DS223j two-bay NAS as a present for myself for Christmas along with two refurbished 16TB Seagate Exos hard drives. Rewinding a bit For most of my life, the only &#8220;backup&#8221; I had was a 500gb [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[19,3,231,234,233],"class_list":["post-2088","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-diy","tag-electronics","tag-home-server","tag-pc-build","tag-synology"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2088","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2088"}],"version-history":[{"count":4,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2088\/revisions"}],"predecessor-version":[{"id":2102,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2088\/revisions\/2102"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2088"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2088"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2088"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}