{"id":2255,"date":"2024-05-22T22:53:59","date_gmt":"2024-05-22T20:53:59","guid":{"rendered":"https:\/\/nagekar.com\/?p=2255"},"modified":"2024-05-22T22:54:12","modified_gmt":"2024-05-22T20:54:12","slug":"2020-was-a-long-ago","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2024\/05\/2020-was-a-long-ago.html","title":{"rendered":"2020 was a long time ago"},"content":{"rendered":"\n<p>I&#8217;m playing a game of chess while listening to a remix album of Nusrat Fateh Ali Khan. I finished work for the day, went to buy seeds to plant coriander and mint plants in my balcony, ate warm food and an Alphonso mango. In short, life is good.<\/p>\n\n\n\n<iframe style=\"border-radius:12px\" src=\"https:\/\/open.spotify.com\/embed\/album\/1URshX6wM3IvvtYrGyuzYq?utm_source=generator\" width=\"100%\" height=\"352\" frameBorder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"><\/iframe>\n\n\n\n<p>This playlist always reminds me of the first half of 2020. Hearing about this new disease for the first time in the media and really not caring about it. Then all of a sudden, Berlin case #1 turns out to be a second degree contact.<\/p>\n\n\n\n<p>It was a scary day. I remember fearing fear to the level that I had not experienced before. It was fair, to be honest. No one seemed to know what was happening, and all I was seeing was growing numbers on <a href=\"https:\/\/www.worldometers.info\/coronavirus\/country\/us\/\">worldmeters.info<\/a>&#8216;s coronavirus stats. <\/p>\n\n\n\n<p>Going through my Google Maps timeline shows an interesting stoppage in going to office or getting food outside in the middle of March, which was when I believe it hit us in Berlin, Germany. Within a week or two, most of the city went offline, so to speak. <\/p>\n\n\n\n<p>Seeing the people we always met and hung out with on Google Meet calls was weird at first, and we wondered if things would ever change. It felt persistent and tiring. It felt like things would stay this way forever. It was overwhelming and I&#8217;d closely monitor any symptom I was showing and then trying to over fit it to Covid19 (with so many first hand experiences on the internet, almost any general sickness symptom could&#8217;ve been attributed to Covid19).<\/p>\n\n\n\n<p>I still remember closing looking at the stats for age vs fatality graphs and convincing myself and my family that it isn&#8217;t that bad, although I didn&#8217;t believe it fully myself then either.<\/p>\n\n\n\n<p>Masks were the norm. Shops had a N-people-only-inside ordinance, and sanitizing supermarket groceries was common. Entire days were spent just thinking about how life felt like before this new norm, and that was mixed with news of people dying, strangers and familiar names alike.<\/p>\n\n\n\n<p>What a weird time. And I was one of the privileged ones who didn&#8217;t actually get affected nearly as much. A work from home job, residence in a country with state healthcare, parents who could afford staying indoors etc. I cannot imagine what it must&#8217;ve been for those who weren&#8217;t as privileged.<\/p>\n\n\n\n<p>I regret not documenting more of my thoughts from that time. I tried to suppress it, trying to convince myself this is kinda normal. It has been more than four years since those scary first two weeks of lockdown. &#8220;Lockdown&#8221; feels like a strange word to type, but it had become such an integral part of our vocabularies back then. <\/p>\n\n\n\n<p>It was a troubling time, and we&#8217;ve just come out of it, albeit not everyone and not completely. I feel grateful for being able to do the things that we couldn&#8217;t do during the covid19 time, things like hugging, eating out and traveling freely. Things that I took for granted before 2020. That year will serve as a good reminder of how quickly life can change, the fragility of it all and the importance to make the most of our now.<\/p>\n\n\n\n<p>Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I&#8217;m playing a game of chess while listening to a remix album of Nusrat Fateh Ali Khan. I finished work for the day, went to buy seeds to plant coriander and mint plants in my balcony, ate warm food and an Alphonso mango. In short, life is good. This playlist always reminds me of the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-2255","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2255","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2255"}],"version-history":[{"count":3,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2255\/revisions"}],"predecessor-version":[{"id":2258,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2255\/revisions\/2258"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2255"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2255"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2255"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}