{"id":2278,"date":"2024-06-22T23:13:40","date_gmt":"2024-06-22T21:13:40","guid":{"rendered":"https:\/\/nagekar.com\/?p=2278"},"modified":"2024-07-01T21:43:05","modified_gmt":"2024-07-01T19:43:05","slug":"10th-anniversary-of-blog","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2024\/06\/10th-anniversary-of-blog.html","title":{"rendered":"10th Anniversary Of Blog!"},"content":{"rendered":"\n<p>I can hardly believe it, but 6th June 2024 marked 10 years since I originally purchased nagekar.com, my beloved blog&#8217;s address. In terms of longevity, this is the longest running project of mine, and outside of a few friendships and family, it even predates most of the people I have in my life today. How interesting!<\/p>\n\n\n\n<p>As I spoke about in my <a href=\"https:\/\/nagekar.com\/2019\/06\/5th-aniversary-blog.html\">5th Anniversary blog post<\/a>, it felt very pretentious to get a domain with my name in it, only so that I can show off my firstname@lastname.com email address to <strike>plebs<\/strike> friends who were using gmail and yahoo mail.<\/p>\n\n\n\n<p>The website itself was never very popular. Partly because of the inconsistency in terms of the topics I wrote about, the quality of my writing or the efforts (or lack thereof) I put into promoting any of my pieces. The SEO game is also lacking hugely, although I refuse to participate in bot pleasing.<\/p>\n\n\n\n<p>But that is also what is liberating about this website. I’m literally writing this line as I’m waiting for RE8 local train on Berlin’s Zoologischer Garten train station. The activation energy to starting writing about a topic is minimal, around the same as writing a whatsapp message to a friend you’ve not spoken with in a couple of months. Perhaps lower than that, now that I think about it. <\/p>\n\n\n\n<p>10 years ago, it would’ve been inconceivable that I might <a href=\"https:\/\/nagekar.com\/2019\/01\/mumbai-to-berlin.html\">not even be in India<\/a> when I’d be writing the 10th anniversary post. Or that there would be one for that matter. Or that I&#8217;d be working with my dream company. Conceivability, perhaps, is just a product of the size of your dreams and desires. More importantly, it is perhaps the size of what one considers is possible and feasible. <\/p>\n\n\n\n<p>I was recently watching a video of Rahul Gandhi where he talks about this very thing; about how what one dreams about and thinks is possible depends on the environment they grow up in. Think about all the human potential that’s underutilized due to lack of being able to see a bird’s eye view of the world; to understand all the possibilities, whether it is through traveling, reading, or consuming diverse media from different parts of the world. <\/p>\n\n\n\n<p>Anyway, I digress. This time, I want to dream big. I want to dream big enough that the dream scares me away; that I myself laugh at the impracticality and infeasibility of it all. And then still attempt to do it. As Rutger Bregman wrote in Utopia for Realists<\/p>\n\n\n\n<blockquote class=\"wp-block-quote is-layout-flow wp-block-quote-is-layout-flow\">\n<p>One needs to be able to believe passionately and also be able to see the absurdity of one’s own beliefs and laugh at them<\/p>\n<\/blockquote>\n\n\n\n<p>What will June 2034 look like? I don&#8217;t know. That&#8217;s slightly discomforting. But then, no one does. There are innumerable possibilities for how things might turn out in June 2034, but I could also say that about tomorrow. And yet, we don&#8217;t stop trying. I hope to be a kind person tomorrow, and also 10 years later. I hope my blog stays, along with the thing we refer to as the Web, and everything we love about it. <\/p>\n\n\n\n<p>Thank you for reading!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>I can hardly believe it, but 6th June 2024 marked 10 years since I originally purchased nagekar.com, my beloved blog&#8217;s address. In terms of longevity, this is the longest running project of mine, and outside of a few friendships and family, it even predates most of the people I have in my life today. How [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-2278","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2278","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2278"}],"version-history":[{"count":19,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2278\/revisions"}],"predecessor-version":[{"id":2307,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2278\/revisions\/2307"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2278"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2278"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2278"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}