{"id":2311,"date":"2024-08-21T00:37:34","date_gmt":"2024-08-20T22:37:34","guid":{"rendered":"https:\/\/nagekar.com\/?p=2311"},"modified":"2024-08-21T00:37:34","modified_gmt":"2024-08-20T22:37:34","slug":"defining-slow-things-in-life","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2024\/08\/defining-slow-things-in-life.html","title":{"rendered":"Defining slow things in life"},"content":{"rendered":"\n<p>I came across the idea of slow living and slow things in life through some videos, and wanted to document some of my own after-thoughts on the matter for future reference.<\/p>\n\n\n\n<p>Here’s a synopsis of the original idea: With technology, a lot of things are sped up. Communicating with a friend or family is an instantaneous act. Airplane travel have made traveling anywhere around the world an at most two day endeavor. Access to most of human knowledge is usually a click or two away. Generating a plausible-sounding article draft on a topic takes a minute (caution: ‘plausible-sounding’ is lifting a lot of weight there).<\/p>\n\n\n\n<p>But should the end goal be to speed up everything in life? Intuitively, we&#8217;d all say no. But then, how do we know when we’re doing something that should be optimized versus something that we&#8217;d always like to do slowly, without the need to speed up or optimize? I suppose one way is to define some of the slow things in life, and be mindful of them.<\/p>\n\n\n\n<p>This article is my attempt at bringing conscious thought to these activities and have a reference to look back to later. In the process, I hope you get some ideas too!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Reading a book<\/h3>\n\n\n\n<p>There was a time when I read regularly. It has since then turned into very occasional bursts of motivation when I try to read a book as much as possible, ideally to the end, in one sitting as I know I might not get back to it soon again. There&#8217;s always something else I should be doing rather than taking some time to read a good book. Perhaps I should try <a href=\"https:\/\/www.blinkist.com\/\">blinkist<\/a>.<\/p>\n\n\n\n<p>Not only is relying on bursts of motivation significantly more inefficient than just small but consistent steps towards a goal, it is also not very fun. Trying to read fast and get to the end of books has made me not want to read all. It sucked the joy out of immersing myself into a book and swimming in the sea of thoughts created by the author. The same is true of book summarizing services.<\/p>\n\n\n\n<p>I don&#8217;t want to rush through a book, reach the end only to have not understood anything and lost any motivation to re-read it properly again. Worse, I don&#8217;t want to read\/listen to a summary of a book, feel like I&#8217;ve gotten everything out of it having missed most of it. Then why ruin the fun by speed-running through the book barely letting anything stick on the wall of my mind.<\/p>\n\n\n\n<p>I feel like this is a big miss, and I should see to it that I don&#8217;t ruin reading completely for the sake of reading faster.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Hanging out with a friend<\/h3>\n\n\n\n<p>I live in Berlin. One of the nice things about this city is that I&#8217;m surrounded by very friendly people who I love seeing often. Growing older, I&#8217;ve often found myself scheduling hangouts with friends that feel inadequate or too organized. <\/p>\n\n\n\n<p>I don&#8217;t want to see a friend for an hour after which I have the next appointment scheduled. The hangout feels shallow, and like a task when it is scheduled so tight in terms of time or agenda. I know that my favorite hangouts are hangouts without a strict agenda that just flowed into its own unique shape. <\/p>\n\n\n\n<p>I&#8217;ve also realized that most of the deeper conversations I&#8217;ve had with my friends were in private setting with no time bounds. It takes time for conversations to naturally flow into a deeper state, where people think before responding and have time to express complex feelings and emotions. I really value these conversations as they&#8217;ve done a good deal to shape my thoughts, and for that reason, I&#8217;d like to always find adequate time for my friends. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Time for myself<\/h3>\n\n\n\n<p>I often pack my schedule to the point where I&#8217;m constantly chasing behind the next task on my list, the next person I have committed to meeting or getting on a call with, and so on. Some weeks I hardly have a single evening to myself where it is just me, my home and nothing else. <\/p>\n\n\n\n<p>I&#8217;ve found that empty evenings with no plans are a nice way to recharge, think, play guitar, paint or do anything unplanned. They&#8217;re meditative, and help zoom out and refocus. This time must not be rushed, or spent in worry. This leisure shouldn&#8217;t make me feel guilty. This downtime is important, just as sleep is.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Cooking and eating a good meal<\/h3>\n\n\n\n<p>With home office and heavy workload, sometimes I cut corners on my meal quality. I grab a quick snack in the afternoon or just eat something that barely qualifies as food, much less dinner, in the evening. <\/p>\n\n\n\n<p>I&#8217;ve also noticed how much joy it brings me to take time to cook something nice for myself. I&#8217;m an okay cook, and given an hour of time, I can cook a good meal that I&#8217;m extremely satisfied eating. Whenever I skip on this and order something from outside, I am always reminded of how little time that saved and how significantly less satisfying it felt. <\/p>\n\n\n\n<p>That&#8217;s why I try to take my time to cook. Even if it eats into my other task time, it is worth it. It must not be rushed, and it isn&#8217;t something worth cutting corners in. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Vacation time<\/h3>\n\n\n\n<p>I get a limited number of days off per year. This creates a compulsion to always have a lot of plans crammed into vacation time. If I take a day off, and I don&#8217;t completely jam pack it with todos, I feel guilty that I didn&#8217;t use my day off well. <\/p>\n\n\n\n<p>It doesn&#8217;t have to feel this way. A day off is a day off, whether it is spent doing some adventures or just relaxed with a nice cup of masala tea and some snacks watching an anime. Sometimes it is okay to go to a new city, visit museums, walk around all day until the legs hurt. Other times, just staying home is golden! Perhaps an off day while in a new city doing nothing but eating and sleeping isn&#8217;t a bad idea either.<\/p>\n\n\n\n<p>I am particularly bad at this, but I&#8217;ll try to remind myself that if I always try to follow a template during my off days as I do during my working days, it kinda defeats the point of the off day. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\">In conclusion<\/h3>\n\n\n\n<p>Working in tech, and trying to optimize everything we work on, sometimes we can go a bit too much in the other direction with things that should be left untouched. Capitalism hasn&#8217;t help this case either, having convinced us to keep automating and abstracting our life and moving to the next levels and creating more value (whatever that means) as fast as possible.<\/p>\n\n\n\n<p>But some things, especially ones that really matter, shouldn&#8217;t be cursed with the infinite growth and optimization virus of tech world. They are better done slowly.<\/p>\n\n\n\n<p>Thank you for reading! <\/p>\n","protected":false},"excerpt":{"rendered":"<p>I came across the idea of slow living and slow things in life through some videos, and wanted to document some of my own after-thoughts on the matter for future reference. Here’s a synopsis of the original idea: With technology, a lot of things are sped up. Communicating with a friend or family is an [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-2311","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2311","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2311"}],"version-history":[{"count":10,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2311\/revisions"}],"predecessor-version":[{"id":2336,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2311\/revisions\/2336"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2311"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2311"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2311"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}