{"id":2502,"date":"2025-02-11T23:17:53","date_gmt":"2025-02-11T22:17:53","guid":{"rendered":"https:\/\/nagekar.com\/?p=2502"},"modified":"2025-02-12T11:48:21","modified_gmt":"2025-02-12T10:48:21","slug":"on-local-friendships","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2025\/02\/on-local-friendships.html","title":{"rendered":"On local friendships"},"content":{"rendered":"\n<p>Manasi, Adi and I always spoke about wanting to live in a commune, not more than few minutes away from each other and being able see each other every day. This way, we’d be able to spend a lot of time together, nurturing and deepening our friendship. <\/p>\n\n\n\n<p>While not in its ideal form, I did get to actualize some of our thought experiments when Kunal decided to move to Berlin some three years ago. It meant that I&#8217;ll have someone living within 30 mins distance who I&#8217;ve known for more than a decade.<\/p>\n\n\n\n<p>Over the next two years that he lived in Berlin, I learned a lot about local friendships. Some I anticipated, and others were totally new learnings. Kunal left Berlin for India last year. Last week, I was wondering what changed since he left, and what can I do differently about my friendships to make them feel more like our school friendships.<\/p>\n\n\n\n<p>This article is a reflection of some of those thoughts. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Why I think friends from our school friendships hit different<\/h2>\n\n\n\n<p>Whenever I meet someone who I studied with in school or university, we immediately hit off. It somehow seems to matter a lot less that we&#8217;ve not been in touch or haven&#8217;t spoken in years. Time has flown, lives changed, many important life milestones passed without having the other person involved, but all of that somehow doesn&#8217;t seem to matter much. We still meet, laugh, make fun of each other and hang out like there was never a break in the relationship. Why?<\/p>\n\n\n\n<p>Here&#8217;s my take: <\/p>\n\n\n\n<p>First, school and university times are tough. Long commutes, lack of ample cash in pocket, academics, coming of age woes, family drama, insecurities etc meant we suffered through a lot of crap together. At the same time, we also had some wonderful times. We got to experience secure friendships, love and moments of intense joys. Going through diverse, emotionally high times together teaches us a lot about people that a well planned brunch at an uptown restaurant where everyone is talking about safe topics with filters doesn&#8217;t get you.<\/p>\n\n\n\n<p>Secondly, being in the same room for a large part of the day everyday for years helps too. I don&#8217;t find it coincidental that my best friends from school and university life aren&#8217;t people I filtered through consciously like we do on the meetup and dating apps, but just folks who were in the same classroom as me, had the same schedules or lived close by. In other words, I just had a regular exposure to these people with mix of me liking to spend time with them, it being easy to find time to spend with them and then sometimes just not having the option to not spent time with them.<\/p>\n\n\n\n<p>We were just forced to be kind to each other, take care of each other and help each other. Well, we weren&#8217;t, but we&#8217;d still have to see each other the next day, so we might as well. We formed our little communes slowly, and then we stuck with it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Having a local friend<\/h2>\n\n\n\n<p>Having a local friend from school meant that I could reach out to him in the evening and ask if he wants to get dinner. It meant that I could rely on him to be there for all house parties and even help clean up when the guests have left, casual ranting session or just a evening to chill together. <\/p>\n\n\n\n<p>Having a local friend also means there&#8217;s someone who&#8217;s aware of the ins and outs of your current life and can give you critical feedback on things and ask the tough questions. Away from home and parents, it is good to have a person to rely on for pointing out when you&#8217;re being stupid.<\/p>\n\n\n\n<p>Having a friend who I can meet multiple times a week also changed how I perceived the city and passage of time. It establishes a nice social routine and de-stress, have a nice dinner and talk about the week. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How can we &#8220;fix&#8221; adult friendships?<\/h2>\n\n\n\n<p>Of course, local friendships are a privilege. In bigger cities, it can be challenging to build longer term friendships due to a multitude of reasons. Some of these reasons are extrinsic, and there&#8217;s not much that we can do about them. But there are steps that can be taken on an individual level to foster secure local friendships that feel like a commune, improve our mental well being and make us feel home.  <\/p>\n\n\n\n<ol class=\"wp-block-list\">\n<li><strong>Being spontaneous<\/strong> &#8211; I&#8217;ve found that being able to see a friend at a short notice is often a very positive signal of how fast the friendship will grow. Building a deep friendship often requires hours and hours of context sharing and supporting one another through thick and thin, and being able to do it more often is always going to help, especially in the busy adult life.<\/li>\n\n\n\n<li><strong>Being well adjusted<\/strong> &#8211; As we grow older, we build higher and thicker walls around us. Some of these walls are non-negotiable, but others are just preferences in things or our tastes. Our preferences and tastes can subconsciously exclude people and make them feel distant. Being well adjusted to me means to have a personality that&#8217;s compatible with different kinds of people and situations.<\/li>\n\n\n\n<li><strong>Showing vulnerability &#8211; <\/strong>As a 30ish year old figuring things out, I think it helps to open up about what we&#8217;re not good at, struggling with, insecure about rather than sticking to safe topics all the time. As a bonus, the early one does that, the sooner they get rid of people who might find something non-negotiable, thus freeing up more time for the people who stick around.<\/li>\n\n\n\n<li><strong>Speaking your mind, losing the filter<\/strong> &#8211; With the best intentions, we often hide our thoughts and feelings. This often leads to boring and dull conversations that don&#8217;t have any emotions in them, like a corporate presentation. If you&#8217;ve ever come out of a chat not remembering a single thing that was talked about, this is why. Everyone was so busy not saying anything potentially offensive, share anything personal or expose any weakness that nothing got said at all.<\/li>\n\n\n\n<li><strong>Respecting invitations<\/strong> &#8211; Simple one: If you&#8217;re accepting an invitation, try to actually make it. If you&#8217;re going to be late, let them know. If you can&#8217;t make it, say you&#8217;re sorry and plan the next one yourself.<\/li>\n\n\n\n<li><strong>Committing to people<\/strong> &#8211; Large cities like Berlin make it very easy to have a busy social life without any real need to connect deeply or invest in anyone in particular. But making local friends that I can see every week requires really committing to people. It means prioritizing meeting them, reaching out proactively and spending quality time with them. It also means finding joy in meeting the same set of people that you already think you know most things about, instead of constantly seeking to meet <em>exciting<\/em> new people. <\/li>\n\n\n\n<li><strong>Mixing friends<\/strong> &#8211; Mixing friends from different walks of your life is often nerve wrecking, and understandably, many adults avoid it. I&#8217;ve found that the people who introduced me to their friends sooner stayed my friends for longer. Perhaps that level of security with your existing friendships makes those people great friends in general. Or perhaps because we got along so well from the start that we were destined to stay good friends anyway? I&#8217;m not sure if that&#8217;s a causation, or just a correlation, but I often try to involve new friends with my existing set of friends for this reason.<\/li>\n<\/ol>\n\n\n\n<p>Of course, that&#8217;s all how I think, and how I&#8217;ve come to think after my <a href=\"https:\/\/nagekar.com\/2025\/01\/six-whole-years-in-berlin.html\">few years here in Berlin<\/a>. I stick by these principles and do my part in making building a little commune in the foreign city I&#8217;ve found myself in, building on top of the lessons I&#8217;ve learned after having Kunal live in Berlin for a couple of years.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">In closing<\/h2>\n\n\n\n<p>Maybe someday, all of my friends do move to a little town where we all live together, see each other for coffee everyday and support each other in all walks of life. But until then, I&#8217;ll try to keep improving my friendship skills. I&#8217;ll turn 30 this year, and I think this skill is going to be one of the more important ones going forward. <\/p>\n\n\n\n<p>Thank you for reading.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Manasi, Adi and I always spoke about wanting to live in a commune, not more than few minutes away from each other and being able see each other every day. This way, we’d be able to spend a lot of time together, nurturing and deepening our friendship. While not in its ideal form, I did [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-2502","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2502","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2502"}],"version-history":[{"count":17,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2502\/revisions"}],"predecessor-version":[{"id":2538,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2502\/revisions\/2538"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2502"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2502"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2502"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}