{"id":2722,"date":"2025-09-01T00:05:34","date_gmt":"2025-08-31T22:05:34","guid":{"rendered":"https:\/\/nagekar.com\/?p=2722"},"modified":"2025-09-01T12:07:32","modified_gmt":"2025-09-01T10:07:32","slug":"uk-and-stories-from-the-other-side-of-fears","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2025\/09\/uk-and-stories-from-the-other-side-of-fears.html","title":{"rendered":"UK, and stories from the other side of fears"},"content":{"rendered":"\n<p>One way to make decisions in life is to imagine yourself having made that decision and think if you&#8217;d like to live in that reality along with the risks that the decision brings. Or would you rather live in the reality of having not made that decision.<\/p>\n\n\n\n<p>I think we humans are fairly bad at gauging the costs associated with indecision. I was raised in a way that I was always aware of the risks associated with doing something, and almost never the risks of not doing something. &#8220;Stick to the defaults, to the basics&#8221; was the mantra in my and many households like mine. Middle class Indian families seldom encourage risk taking, even if that comes at a cost of a mostly mediocre life without much social, economic, geographical or any sort of mobility.<\/p>\n\n\n\n<p>Anyway, I digress.<\/p>\n\n\n\n<p>I love driving. I have driven tens of thousands of kilometers in India, thousands more abroad. Last week, I went to the UK. I had a huge desire to drive there after the work part of my trip had concluded.<\/p>\n\n\n\n<p>But there was a problem. I was scared. I had never been to the UK, never driven in Europe and never rented a car by myself. My heart said yes, but the brain had its fair share of concerns. My brain was trained to seeing the risks in doing something, and sticking to the status quo (which in my case meant taking public transport or staying in London, for example) was easier and comfortable.<\/p>\n\n\n\n<p>I read up online and learned that it isn&#8217;t really necessary to have a car in the UK. Trains work just fine. I like trains too. Problem solved. I don&#8217;t need to face my fears. I told Florian that perhaps trains are the better option, and in a very disapproving tone, he asked me &#8220;but don&#8217;t <em>you<\/em> want to drive?&#8221;<\/p>\n\n\n\n<p>Sometimes, I get so stuck in the process of rationalizing that I forget what it is that I actually want to do, what my heart is <em>begging<\/em> me to do. Trains being the logical mode of transport is an irrelevant piece of fact if it is driving that I want to do. That&#8217;s <em>my<\/em> goal. That&#8217;s the definition of rationality right there, not making my decisions based on someone else&#8217;s metrics of efficiency and logic.<\/p>\n\n\n\n<p>On Thursday, I had to make a decision. I was thirty minutes away from checking out of my hotel, and I didn&#8217;t have a plan for my extended weekend or even a place to stay that evening. As hard as it was to swallow the fear of doing something new, something I actually wanted to do for all my life, I did it. I booked a small hatchback car to be picked up from Heathrow Airport and I booked a place to stay that night in Bath.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1924\" height=\"2560\" src=\"https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-scaled.png\" alt=\"\" class=\"wp-image-2732\" srcset=\"https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-scaled.png 1924w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-225x300.png 225w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-188x250.png 188w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-768x1022.png 768w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-1154x1536.png 1154w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2-1539x2048.png 1539w\" sizes=\"auto, (max-width: 1924px) 100vw, 1924px\" \/><\/figure>\n\n\n\n<p>After finishing work on Thursday, I reached the car rental pickup place and had the keys in my hands at around 7.15pm. I was tired, scared and mentally drained by all of the thoughts of having to do this, and I was finally doing it. I just had some 80 miles to drive before I could lay in bed and feel the feeling of having done it. Would I like that feeling? I absolutely would. And that was the motivation. I took to the road, blasting Bollywood classics, figuring out the car and the rules of the road all on the fly as I drove miles after miles on west-bound M4.<\/p>\n\n\n\n<p>It worked out. I reached an empty parking lot near my Hotel after 10pm. I parked the car, and went to sleep in my hotel room feeling a sense of pride and accomplishment. &#8220;Look maa, I did it. I f-ing lived my dream!&#8221; I wanted to yell.<\/p>\n\n\n\n<p>The next day I asked Ed if I can visit his mom who lived around an hour away from Bath. It worked out. I drove to Wells, spent few hours there and then drove to Glastonbury. Ed&#8217;s parents and I spoke for hours about what felt like every possible topic on Earth. The drive was lovely, and I felt a sense of pride having found their home without much difficulties.<\/p>\n\n\n\n<p>The next day, I drove off early to make it to Stonehenge. The drive there was probably one of the best of my life. I felt like I&#8217;m riding on Aladdin&#8217;s flying carpet through some beautiful grasslands with twisty roads going up and down, revealing and hiding the landscapes as they do. It was all poetic. I probably could&#8217;ve stopped the car and cried a bit to thank the circumstances that led to that moment, but that&#8217;d have looked weird and I think stopping on UK roads to cry isn&#8217;t allowed either.<\/p>\n\n\n\n<p>Ed&#8217;s mom gave me some recommendations for smaller towns to spend my last evening in the UK and I chose Hungerford, a tiny town with what looked like one main street around which most of commerce was arranged. I spent my evening in an Italian restaurant with a talkative server who herself was a Ukrainian immigrant. That evening was a memorable one, and my randomly found hotel in the randomly found city was very cozy, and had live Beatles music performance in the night.<\/p>\n\n\n\n<p>I knew meeting Ed&#8217;s parents would be a highlight of my trip even before I met them, because it connects people in my life that I love. I also knew if I&#8217;m brave enough to rent the car, the entire trip would become one of the best I&#8217;ve ever lived through precisely because driving is something I love doing. I also (also!) knew I&#8217;d love the no-name small towns much more than the bustling cities, something I learned I really like while traveling in the USA.<\/p>\n\n\n\n<p>I wrote the last paragraph thinking of what I&#8217;d have done if I had decided to pursue the recommendations of the internet, or worse, not decided upon anything and spent the time in London sightseeing. Isn&#8217;t it funny that our heart knows it all? It already tells you what you should do by looking at things from the future. I braved a few decisions and I was rewarded with a lifetime of memories.<\/p>\n\n\n\n<p>If only we&#8217;re brave enough to listen to our hearts more often, who knows what other adventures await us to make our wildest dreams feel meager in comparison.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full is-style-default\"><img loading=\"lazy\" decoding=\"async\" width=\"2410\" height=\"1808\" src=\"https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image.png\" alt=\"Glastonbury Tor https:\/\/en.wikipedia.org\/wiki\/Glastonbury_Tor\" class=\"wp-image-2724\" srcset=\"https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image.png 2410w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-300x225.png 300w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-250x188.png 250w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-768x576.png 768w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-1536x1152.png 1536w, https:\/\/nagekar.com\/wp-content\/uploads\/2025\/09\/image-2048x1536.png 2048w\" sizes=\"auto, (max-width: 2410px) 100vw, 2410px\" \/><\/figure>\n\n\n\n<p>Thank you for reading!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One way to make decisions in life is to imagine yourself having made that decision and think if you&#8217;d like to live in that reality along with the risks that the decision brings. Or would you rather live in the reality of having not made that decision. I think we humans are fairly bad at [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5,13],"class_list":["post-2722","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life","tag-travel"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2722","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2722"}],"version-history":[{"count":9,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2722\/revisions"}],"predecessor-version":[{"id":2738,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2722\/revisions\/2738"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2722"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2722"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2722"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}