{"id":2741,"date":"2025-11-21T21:23:50","date_gmt":"2025-11-21T20:23:50","guid":{"rendered":"https:\/\/nagekar.com\/?p=2741"},"modified":"2025-11-21T21:23:51","modified_gmt":"2025-11-21T20:23:51","slug":"summary-of-my-20s","status":"publish","type":"post","link":"https:\/\/nagekar.com\/2025\/11\/summary-of-my-20s.html","title":{"rendered":"Summary of my 20s"},"content":{"rendered":"\n<p>I turned 30 about a month ago. Weeks before I turned 30, I had already started to internally retrospect my soon-to-be-past decade. What went well, what could be improved of I were to do it again. A decade isn&#8217;t the same as a two week sprint they typically have in software teams. Life isn&#8217;t the same as a startup. Nevertheless, the acquired vocabulary slips in, something I&#8217;m not very proud of.<\/p>\n\n\n\n<p>Anyway, a decade isn&#8217;t a trivial amount of time in any human&#8217;s life. For the average person, it is between 10 and 20 percentage of their whole lives. And 20s are definitely special. Many claim they&#8217;re the best ones of your life. We&#8217;ll see about that, but for now, I want to write about some of the 20s-defining moments of my 20s. Not everything can and should be documented in a silly (and very public) blog post, but I&#8217;ll still make an attempt.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Entering 20s &#8211; The would&#8217;ve-been-first-paid-project<\/h2>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2015\/12\/the-october-dance-with-cool-indians.html\" target=\"_blank\">My 20s started with me drowning in stress<\/a>. I had accepted to work on a project that I knew I didn&#8217;t have the time or the skills to complete. The 3rd of October, 2015 was a blur. I was busy working to finish this website project that I shouldn&#8217;t have accepted to work on, but not only did I accept it and not complete it, it also took me 3-4 whole days to realize that I&#8217;m never going to finish it. It was a mess and I even dragged Rajashree into it.<\/p>\n\n\n\n<p>Zooming out slightly, Adi had freshly vanished from the scene and I was also getting used to university commute without him. The friendships formed in the initial years of college were either strengthening or losing their charm and we were all growing up.<\/p>\n\n\n\n<p>The start of my 20s weren&#8217;t without uncertainties. The confidence that I once had in my technical skills were definitely not very healthy and the realities of the world I lived in were slowly dawning. The &#8220;I&#8217;ll start my own company&#8221; spirit was forgotten and I was busy looking at websites of startups to find a place to fit.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Project Lumos<\/h2>\n\n\n\n<p>In the third year of engineering, I was lucky to connect with some college seniors who I collaborated with to start something called&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2016\/07\/the-project-lumos-experience.html\" target=\"_blank\">Project Lumos<\/a>. It was a mentoring initiative that aimed to create a community around tech learnings and practical skills building. That project helped me form connections in college, feel what it feels like when someone looks up to you, learn and teach and just be part of something bigger than myself.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Internship in Delhi<\/h2>\n\n\n\n<p>My first&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2018\/12\/working-for-startups.html\" target=\"_blank\">professional tech endeavor<\/a>&nbsp;arrived in the summary of 2016. I got a email asking if I’d like to be a summer intern for a government tech startup in Delhi. I got the email on a Friday and I had to make a decision, prepare myself (including mentally) and start working from the office on the following Monday.<\/p>\n\n\n\n<p>I had never travelled that far from home before, neither had I taken a flight. Mom was worried, and given the reputation Delhi had back then, rightly so.<\/p>\n\n\n\n<p>But I showed more courage and took up the offer. The next two months gave me many sweet memories. I could channel all of the passion I had for engineering towards a few projects. I was also doing well socially, a confidence building moment that will help me for years after that.<\/p>\n\n\n\n<p>I remember going on a spontaneous&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2016\/11\/a-visit-to-the-taj-mahal.html\" target=\"_blank\">trip to visit the Taj Mahal<\/a>, which became the first instance of many in my long list of spontaneous travel adventures.<\/p>\n\n\n\n<p>I think of going to Delhi as a major milestone in my life. It helped me put my hard and soft skills into perspective, and gave me a lot of confidence. It felt like for the first time in my life, I had an elaborate life experience to actually tell others about.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Brahmatal Trek<\/h2>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2017\/02\/trip-to-brahmatal-uttarakhand.html\" target=\"_blank\">Brahmatal trek<\/a>&nbsp;was special. Traveling from Mumbai all the way to Uttarakhand, covering thousands of kilometres by various modes of transport with friends was special, and the first of its kind of trip for me.<\/p>\n\n\n\n<p>Brahmatal trek made me realize the importance of a family outside of my family; friends. In the wild, I had to rely on friends, make compromises and enjoy time outside of the world of computers, all relatively novel things for me back then.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">First Full-time Job &#8211; Laughguru Time<\/h2>\n\n\n\n<p>I didn’t find a job straight of out college. The companies that came hunting for freshers to join didn’t excite me, and I was left without a job towards the end of college.<\/p>\n\n\n\n<p>Around then, Juneja’s company was looking for a Reactjs developer. I didn’t know React, but I did write Javascript. I decided to interview with them and somehow even landed the job.<\/p>\n\n\n\n<p>Working at&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2018\/05\/the-laughguru-experience.html\" target=\"_blank\">LaughGuru<\/a>&nbsp;meant I had a big fat salary (or at least it felt like that) that was a lot more than the pocket money my parents gave me, or the stipend I got at my internship. I still remember the day the salary was credited into my bank account. I felt rich.<\/p>\n\n\n\n<p>Working at LaughGuru was pleasant. The people were really nice, work was more or less chill, and the job enabled me to rent an apartment closer to work. This was my first time living separately by myself and taking care of my flat. It taught me how to <a href=\"https:\/\/nagekar.com\/2018\/02\/home.html\" target=\"_blank\" rel=\"noreferrer noopener\">make a home out of a shelter<\/a> and gave me a place to create my very first homelab of sorts.<\/p>\n\n\n\n<p>The LaughGuru adventure only lasted nine months, and so was the end of my living-out phase, but it gave me a taste if what adult life might feel like and I was excited for doing it again.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Jagriti Yatra<\/h2>\n\n\n\n<p>When I was in Delhi, Riya told me about&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2018\/01\/jagriti-yatra.html\" target=\"_blank\">Jagriti Yatra<\/a>. She had recently been and the description sounded really interest. Spending half a month of a train with some 500 other likeminded young people and discovering india and the problems that one can solve through enterprise.<\/p>\n\n\n\n<p>Soon after joining Laughguru, I prioritized going to JY. I got selected and arranged for off time at my new job. It all worked out.<\/p>\n\n\n\n<p>Jagriti Yatra was special because I didn’t really make use of it. I didn’t talk to enough people, I didn’t take the activities seriously, nor did I live the “yatra spirit” so to speak. Partly it was about being influenced by the wrong set of people, and party just misaligned priorities.<\/p>\n\n\n\n<p>The entire Yatra, while enjoyable, taught me how not to approach a novel experience, and I’m grateful for it. I suppose that learning is just as important as any other.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2019\/01\/mumbai-to-berlin.html\" target=\"_blank\">Moving to Berlin<\/a><\/h2>\n\n\n\n<p>Sometime in mid 2018, I was back on the hunt for a new job. As I was applying for jobs in Banglore and Delhi, I was told that I could also apply for jobs abroad. I think it was Juneja who told me that, but I&#8217;m fading in my memory.<\/p>\n\n\n\n<p>Emigrating abroad was something I had stopped thinking of ever since&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2016\/10\/why-no-masters-for-now.html\" target=\"_blank\">dropping the masters plan<\/a>. I applied for a few jobs that had “visa sponsorship available” written on their listings, and eventually landed an offer CareerFoundry. I didn’t know it back then, but moving countries would turn out to be one of the more significant turning points of my entire life.<\/p>\n\n\n\n<p>I want to believe I’d have turned out to be a similar person even without moving countries, but it did help speed that process up. As a bonus, I ended up more interesting experiences that I’d have ever dreamt, or is possible to summarise. It is a privilege to move countries, and if you get the slightest chance to do it, do it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">My Longest Employer Yet &#8211; Careerfoundry<\/h2>\n\n\n\n<p>The ticket to my European dreams was funded by&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2022\/11\/6-lessons-learned-during-my-time-at-careerfoundry.html\" target=\"_blank\">CareerFoundry<\/a>, the company I joined when I first moved to Berlin. I ended up working at CareerFoundry for close to four years, much more than I&#8217;d have anticipated when I had accepted the offer. Partly, it was them offering me a role more catered to my career aspirations, but mostly it was the people and my tribe in Berlin. It was really hard to let go of what felt so comfortable, like a home, away from home. It just happened to be at my employer.<\/p>\n\n\n\n<p>CareerFoundry time taught me many important life lessons. It not only defined me as a person, but also emphasized what my traits. The validation we get for our qualities solidifies them, which is probably why company matters and reinforcement of our behaviors is critical.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Dreams Do Come True &#8211; Joining Mozilla<\/h2>\n\n\n\n<p>I joined Mozilla in October 2022. I said I&#8217;d join Mozilla in a&nbsp;<a rel=\"noreferrer noopener\" href=\"https:\/\/nagekar.com\/2014\/12\/top-reasons-why-you-should-start-using.html\" target=\"_blank\">blog post dated 2014<\/a>. To say it was one of the major dreams of my adult life come true wouldn&#8217;t be an overstatement. One of the first things I did after starting my job was schedule a meeting with Aza Dotzler, someone I saw in Mumbai back in 2015 in IIT Bombay Techfest.<\/p>\n\n\n\n<p>I must admit that the pursuit of the dream was a lot more satisfying than the part of living the dream, as with most things in life, but it is still a defining milestone of my 20s and worth a shoutout in this blogpost.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Learning music<\/h2>\n\n\n\n<p>People often ask &#8220;what&#8217;s something you wish you had done in your 20s?&#8221;. For me, it was learning a musical instrument. During Covid times, I bought my first musical instrument, a Ukulele. I taught myself how to play basic songs and enjoyed the journey. I later got a western acoustic guitar and taught myself basic chords to play my favorite soundtracks.<\/p>\n\n\n\n<p>It is one of those things where you consciously decide upon a task, a deadline and somehow actually make it. For me, that was learning music. I&#8217;m glad I did.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">As the video game nerds say &#8211; character development<\/h2>\n\n\n\n<p>I want to add the importance 20s had on discovering the kind of person I want to become. 20s, especially the Berlin time, not only helped me figure my preferences and beliefs as a person, but also be able to articulate them clearly.<\/p>\n\n\n\n<p>The journey of self discovery and self awareness is an important one, as without it we’re like a windsock changing direction depending on the gust of culture we’re surrounded by. It is a delicate balance of confidence in one’s beliefs and opinions, and a practice in humility to not take oneself and one’s world view too seriously. I’m nowhere near done, but it is good to have made some progress on this front.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">In conclusion<\/h2>\n\n\n\n<p>I&#8217;m 30 years old now. That&#8217;s quite a milestone, perhaps one of the major ones. In a way, nothing&#8217;s changed. I was about this age for sometime now. But in a more semantic way, it is quite different. To imagine how old people who were 30 felt when I was in my teens and early 20s, and to realize now I&#8217;m that is&#8230;something.<\/p>\n\n\n\n<p>It is exciting what the next decade would bring for me personally but also for all of us as a society. I sure hope I have some interesting updates to share in my &#8220;Summary of my 30s blog post&#8221;. Stay tuned for that.<\/p>\n\n\n\n<p>Thank you for reading!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>I turned 30 about a month ago. Weeks before I turned 30, I had already started to internally retrospect my soon-to-be-past decade. What went well, what could be improved of I were to do it again. A decade isn&#8217;t the same as a two week sprint they typically have in software teams. Life isn&#8217;t the [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[5],"class_list":["post-2741","post","type-post","status-publish","format-standard","hentry","category-uncategorized","tag-life"],"_links":{"self":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2741","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/comments?post=2741"}],"version-history":[{"count":1,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2741\/revisions"}],"predecessor-version":[{"id":2748,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/posts\/2741\/revisions\/2748"}],"wp:attachment":[{"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/media?parent=2741"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/categories?post=2741"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nagekar.com\/wp-json\/wp\/v2\/tags?post=2741"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}